[
  {
    "names": [
      "عنترة بن شداد بن عمرو بن معاوية بن قراد العبسي. أشهر فرسان العرب في الجاهلية المتوفى سنة (22 ق. ه / 601 م)",
      "Cantara Ibn Shaddad",
      "عنترة بن شداد",
      "عنترة بن شدّاد",
      "ʿAntarah ibn Shaddād"
    ],
    "variations": [
      "ʿAntarah ibn Shaddad"
    ]
  },
  {
    "names": [
      "الحسن البصري",
      "al-Ḥasan al-Baṣrī",
      "أبو سعيد الحسن بن يسار البصري",
      "Hasan Basri",
      "Abū Saʿīd al-Ḥasan b. Yasār al-Baṣrī"
    ],
    "variations": [
      "al-Hasan al-Basri",
      "Abu Saʿid al-Hasan b. Yasar al-Basri",
      "Abu Saʿid Hasan b. Yasar Basri"
    ]
  },
  {
    "names": [
      "زيد بن علي بن الحسين بن علي بن أبي طالب",
      "Zayd Ibn Cali",
      "Zayd b. ʿAlī b. al-Ḥusayn b. ʿAlī b. Abī Ṭālib"
    ],
    "variations": [
      "Zayd b. ʿAli b. al-Husayn b. ʿAli b. Abi Talib",
      "Zayd b. ʿAli b. Husayn b. ʿAli b. Abi Talib"
    ]
  },
  {
    "names": [
      "ابن المقفع",
      "Ibn Muqaffac",
      "عبد الله بن المقفع (المتوفى: 142هـ)",
      "عبد الله بن المقفع",
      "عبد الله بن المقفّع",
      "Abd ʿAllāh ibn al-Muqaffaʿ",
      "عبد الله بن المقفع (المتوفى: 142 هـ) (ترجمة لكتاب الفيلسوف الهندي بيدبا)"
    ],
    "variations": [
      "Abd ʿAllah ibn al-Muqaffaʿ",
      "Abd ʿAllah ibn Muqaffaʿ"
    ]
  },
  {
    "names": [
      "أبو حنيفة",
      "Abū Ḥanīfaŧ",
      "أبو حنيفة النعمان بن ثابت بن زوطا الفارسي",
      "Abu Hanifa",
      "Abū Ḥanīfaŧ al-Nuʿmān b. Ṯābit b. Zūṭā al-Fārisī"
    ],
    "variations": [
      "Abu Hanifat",
      "Abu Hanifat al-Nuʿman b. Tabit b. Zuta al-Farisi",
      "Abu Hanifat Nuʿman b. Tabit b. Zuta Farisi"
    ]
  },
  {
    "names": [
      "ابن اسحاق",
      "åbn Isḥāq",
      "محمد ابن اسحاق ابن يسار ابن خيار",
      "Ibn Ishaq",
      "Muḥammad åbn Isḥāq åbn Yasār åbn ḫiyār"
    ],
    "variations": [
      "abn Ishaq",
      "Muhammad abn Ishaq abn Yasar abn hiyar"
    ]
  },
  {
    "names": [
      "سفيان الثوري",
      "Sufyān al-Ṯawrī",
      "أبو عبد الله سفيان بن سعيد بن مسروق الكوفي، الثوري",
      "Sufyan Thawri",
      "ʾAbū ʿAbd Allãh Sufyān b. Saʿīd b. Masrūq al-Kūfī, al-Ṯawrī"
    ],
    "variations": [
      "Sufyan al-Tawri",
      "Sufyan Tawri",
      "ʾAbu ʿAbd Allah Sufyan b. Saʿid b. Masruq al-Kufi, al-Tawri",
      "ʾAbu ʿAbd Allah Sufyan b. Saʿid b. Masruq Kufi, Tawri"
    ]
  },
  {
    "names": [
      "سيبويه",
      "Sībawayhi",
      "أبو بشر عمرو بن عثمان بن قنبر",
      "Sibawayhi",
      "Abū Bišr ʿAmrů b. ʿUṯmān b. Qanbar"
    ],
    "variations": [
      "Abu Bisr ʿAmru b. ʿUtman b. Qanbar"
    ]
  },
  {
    "names": [
      "أبو يوسف",
      "Abū Yūsuf",
      "أبو يوسف يعقوب بن ابراهيم الأنصاري الكوفي",
      "Abu Yusuf Yacqub",
      "Abū Yūsuf Yaʿqūb b. Ibrāhīm al-Anṣārī al-Kūfī"
    ],
    "variations": [
      "Abu Yusuf",
      "Abu Yusuf Yaʿqub b. Ibrahim al-Ansari al-Kufi",
      "Abu Yusuf Yaʿqub b. Ibrahim Ansari Kufi"
    ]
  },
  {
    "names": [
      "الشيباني",
      "al-Šaybānī",
      "أبو عبد الله محمد بن الحسن الشيباني",
      "Muhammad Shaybani",
      "Abū ʿAbd Al-lãh Muḥammad b. al-Ḥasan al-Šaybānī"
    ],
    "variations": [
      "al-Saybani",
      "Saybani",
      "Abu ʿAbd Al-lah Muhammad b. al-Hasan al-Saybani",
      "Abu ʿAbd lah Muhammad b. Hasan Saybani"
    ]
  },
  {
    "names": [
      "يحيى بن البطريق",
      "Yaḥyá b. al-Biṭrīq",
      "Yahya Ibn Bitriq"
    ],
    "variations": [
      "Yahya b. al-Bitriq",
      "Yahya b. Bitriq"
    ]
  },
  {
    "names": [
      "ابن الكلبي",
      "Ibn al-Kalbī",
      "أبو المنذر هشام بن محمد أبي النضر بن السائب بن بشر الكلبي",
      "Ibn Kalbi",
      "Abū al-Munḏir Hišām b. Muḥammad Abī al-Naḍir b. al-Sāʾib b. Bišr al-Kalbī"
    ],
    "variations": [
      "Ibn al-Kalbi",
      "Abu al-Mundir Hisam b. Muhammad Abi al-Nadir b. al-Saʾib b. Bisr al-Kalbi",
      "Abu Mundir Hisam b. Muhammad Abi Nadir b. Saʾib b. Bisr Kalbi"
    ]
  },
  {
    "names": [
      "محمد بن إدريس الشافعي أبو عبد الله",
      "Shafici",
      "الشافعي",
      "محمد بن إدريس الشافعي",
      "الشافعي أبو عبد الله محمد بن إدريس بن العباس بن عثمان بن شافع بن عبد المطلب بن عبد مناف المطلبي القرشي المكي",
      "أبى عبد الله محمد بن ادريس الشافعى المتوفى عام 204 ه",
      "الإمام الشافعي",
      "الشافعي أبو عبد الله محمد بن إدريس بن العباس بن عثمان بن شافع بن عبد المطلب بن عبد مناف المطلبي القرشي المكي (المتوفى: 204هـ)",
      "محمد بن إدريس أبو عبدالله الشافعي",
      "محمد بن إدريس أبو عبد الله الشافعي",
      "Muḥammad ibn Idrīs al-Shāfiʿī",
      "محمّد بن إدريس الشافعيّ",
      "الإمام / أبو عبد الله محمد بن إدريس المطلبي"
    ],
    "variations": [
      "Muhammad ibn Idris al-Shafiʿi",
      "Muhammad ibn Idris Shafiʿi"
    ]
  },
  {
    "names": [
      "الواقدي",
      "al-Wāqidī",
      "محمد بن عمر بن واقد السهمي الاسلامي",
      "Waqidi",
      "Muḥammad b. ʿAmr b. Wāqid al-Sahmī al-Islāmī"
    ],
    "variations": [
      "al-Waqidi",
      "Muhammad b. ʿAmr b. Waqid al-Sahmi al-Islami",
      "Muhammad b. ʿAmr b. Waqid Sahmi Islami"
    ]
  },
  {
    "names": [
      "أبو عبيدة",
      "Abū ʿUbaydaŧ",
      "أبو عبيدة معمر بن المثنى",
      "Abu Cubayda",
      "Abū ʿUbaydaŧ Maʿmar b. al-Muṯanná"
    ],
    "variations": [
      "Abu ʿUbaydat",
      "Abu ʿUbaydat Maʿmar b. al-Mutanna",
      "Abu ʿUbaydat Maʿmar b. Mutanna"
    ]
  },
  {
    "names": [
      "ابن هشام",
      "Ibn Hišām",
      "جمال الدين أبو محمد عبد الملك بن هشام بن أيوب الحميري، المعافري",
      "Ibn Hisham",
      "Ǧamāl al-dīn Abū Muḥammad ʿAbd al-Malik b. Hišām b. Ayyūb al-ḥimyarī, al-Maʿāfirī"
    ],
    "variations": [
      "Ibn Hisam",
      "Gamal al-din Abu Muhammad ʿAbd al-Malik b. Hisam b. Ayyub al-himyari, al-Maʿafiri",
      "Gamal din Abu Muhammad ʿAbd Malik b. Hisam b. Ayyub himyari, Maʿafiri"
    ]
  },
  {
    "names": [
      "ابن عبد الحكم المصري",
      "Ibn ʿabd al-ḥakam al-Miṣrī",
      "أبو محمد عبد الله بن عبد الحكم المصري",
      "Ibn Cabd Hakam Misri",
      "abū muḥammad ʿabd allāh b. ʿabd al-ḥakam al-Miṣrī"
    ],
    "variations": [
      "Ibn ʿabd al-hakam al-Misri",
      "Ibn ʿabd hakam Misri",
      "abu muhammad ʿabd allah b. ʿabd al-hakam al-Misri",
      "abu muhammad ʿabd allah b. ʿabd hakam Misri"
    ]
  },
  {
    "names": [
      "الأصمعي",
      "al-Aṣmaʿī",
      "أبو سعيد عبد الملك بن قريب بن علي بن أصمع الباهلي",
      "Ibn Qurayb Asmaci",
      "Abū Saʿīd ʿAbd al-malik b. Qurayb b. ʿAlī b. Aṣmaʿ al-Bāhilī"
    ],
    "variations": [
      "al-Asmaʿi",
      "Asmaʿi",
      "Abu Saʿid ʿAbd al-malik b. Qurayb b. ʿAli b. Asmaʿ al-Bahili",
      "Abu Saʿid ʿAbd malik b. Qurayb b. ʿAli b. Asmaʿ Bahili"
    ]
  },
  {
    "names": [
      "(مؤلف مجهول)",
      "(muʾallif majhūl)",
      "",
      "Anonymous",
      ""
    ],
    "variations": [
      "(muʾallif majhul)"
    ]
  },
  {
    "names": [
      "المدائني",
      "al-Madāʾinī",
      "أبو الحسن علي بن محمد بن عبد الله المدائني",
      "Ibn Muhammad Madaini",
      "Abū al-Ḥasan ʿAlī b. Muḥammad b. ʿAbd Allāh al-Madāʾinī"
    ],
    "variations": [
      "al-Madaʾini",
      "Madaʾini",
      "Abu al-Hasan ʿAli b. Muhammad b. ʿAbd Allah al-Madaʾini",
      "Abu Hasan ʿAli b. Muhammad b. ʿAbd Allah Madaʾini"
    ]
  },
  {
    "names": [
      "ابن سعد",
      "Ibn Saʿd",
      "أبو عبد الله محمد بن سعد بن منيع الهاشمي البصري",
      "Ibn Sacd",
      "Abū ʿAbd Al-lãh Muḥammad b. Saʿd b. Manīʿ al-Hāšimī al-Baṣrī"
    ],
    "variations": [
      "Abu ʿAbd Al-lah Muhammad b. Saʿd b. Maniʿ al-Hasimi al-Basri",
      "Abu ʿAbd lah Muhammad b. Saʿd b. Maniʿ Hasimi Basri"
    ]
  },
  {
    "names": [
      "ابن سلام الجمحي",
      "Ibn salām al-ǧumḥī",
      "محمد بن سلام الجمحي",
      "Ibn Sallam Jumahi",
      "muḥammad b. sallām al-ǧumḥī"
    ],
    "variations": [
      "Ibn salam al-gumhi",
      "Ibn salam gumhi",
      "muhammad b. sallam al-gumhi",
      "muhammad b. sallam gumhi"
    ]
  },
  {
    "names": [
      "ابن حبيب، القرطبي",
      "Ibn Ḥabīb, al-Qurṭubī",
      "أبو مروان عبد الملك بن حبيب بن حبيب بن سليمان بن هارون السلمي، الالبيري، القرطبي",
      "Ibn Habib Qurtubi",
      "Abū Marwān ʿAbd al-Malik b. Ḥabīb b. Ḥabīb b. Sulaymān b. Hārūn al-Sulamī, al-Ilbīrī, al-Qurṭubī"
    ],
    "variations": [
      "Ibn Habib, al-Qurtubi",
      "Ibn Habib, Qurtubi",
      "Abu Marwan ʿAbd al-Malik b. Habib b. Habib b. Sulayman b. Harun al-Sulami, al-Ilbiri, al-Qurtubi",
      "Abu Marwan ʿAbd Malik b. Habib b. Habib b. Sulayman b. Harun Sulami, Ilbiri, Qurtubi"
    ]
  },
  {
    "names": [
      "أحمد بن حنبل",
      "aḥmad b. ḥanbal",
      "أبو عبد الله أحمد بن محمد بن حنبل الشيباني",
      "Ibn Hanbal",
      "Abū ʿabd allāh Aḥmad b. muḥammad b. ḥanbal al-šaybānī"
    ],
    "variations": [
      "ahmad b. hanbal",
      "Abu ʿabd allah Ahmad b. muhammad b. hanbal al-saybani",
      "Abu ʿabd allah Ahmad b. muhammad b. hanbal saybani"
    ]
  },
  {
    "names": [
      "ابن أبي عمر العدني",
      "Ibn Abī ʿUmar al-ʿAdanī",
      "أبو عبد الله محمد بن يحيى بن أبي عمر العدني، الدراوردي",
      "Ibn Yahya Cadani",
      "Abū ʿAbd Allāh Muḥammad b. Yaḥyá b. Abī ʿUmar al-ʿAdanī, al-Darāwardī"
    ],
    "variations": [
      "Ibn Abi ʿUmar al-ʿAdani",
      "Ibn Abi ʿUmar ʿAdani",
      "Abu ʿAbd Allah Muhammad b. Yahya b. Abi ʿUmar al-ʿAdani, al-Darawardi",
      "Abu ʿAbd Allah Muhammad b. Yahya b. Abi ʿUmar ʿAdani, Darawardi"
    ]
  },
  {
    "names": [
      "محمد بن حبيب",
      "Muḥammad b. Ḥabīb",
      "أبو جعفر محمد بن حبيب بن أمية بن عمرو الهاشمي، البغدادي",
      "Muhammad Ibn Habib",
      "Abū Ǧaʿfar Muḥammad b. Ḥabīb b. Umayyaŧ b. ʿAmrů al-Hāšimī, al-Baġdādī"
    ],
    "variations": [
      "Muhammad b. Habib",
      "Abu Gaʿfar Muhammad b. Habib b. Umayyat b. ʿAmru al-Hasimi, al-Bagdadi",
      "Abu Gaʿfar Muhammad b. Habib b. Umayyat b. ʿAmru Hasimi, Bagdadi"
    ]
  },
  {
    "names": [
      "الأزرقي",
      "al-Azraqī",
      "أبو الوليد محمد بن عبد الله بن أحمد الأزرقي",
      "Azraqi",
      "Abū al-Walīd Muḥammad b. ʿAbd Allāh b. Aḥmad al-Azraqī"
    ],
    "variations": [
      "al-Azraqi",
      "Abu al-Walid Muhammad b. ʿAbd Allah b. Ahmad al-Azraqi",
      "Abu Walid Muhammad b. ʿAbd Allah b. Ahmad Azraqi"
    ]
  },
  {
    "names": [
      "عبد المسيح الناعمي",
      "ʿAbd al-Masīḥ al-Nāʿimī",
      "عبد المسيح بن عبد الله الحمسي الناعمي",
      "Cabd Masih Nacimi",
      "ʿAbd al-Masīḥ b. ʿAbd Allāh al-Ḥimsī al-Nāʿimī"
    ],
    "variations": [
      "ʿAbd al-Masih al-Naʿimi",
      "ʿAbd Masih Naʿimi",
      "ʿAbd al-Masih b. ʿAbd Allah al-Himsi al-Naʿimi",
      "ʿAbd Masih b. ʿAbd Allah Himsi Naʿimi"
    ]
  },
  {
    "names": [
      "الجاحظ",
      "al-ǧāḥiẓ",
      "أبو عثمان عمرو بن بحر الفقامي البصري",
      "Jahiz",
      "abū ʿUṯmān ʿamrů b. baḥr al-fuqāmī al-baṣrī"
    ],
    "variations": [
      "al-gahiz",
      "gahiz",
      "abu ʿUtman ʿamru b. bahr al-fuqami al-basri",
      "abu ʿUtman ʿamru b. bahr fuqami basri"
    ]
  },
  {
    "names": [
      "البخاري",
      "al-buḫārī",
      "أبو عبد الله محمد بن اسماعيل بن ابراهيم بن المغيرة الجعفي البخاري",
      "Bukhari",
      "abū ʿabd allāh muḥammad b. ismāʿīl b. ibrāhīm b. al-muġīrŧ al-ǧuʿfī al-buḫārī"
    ],
    "variations": [
      "al-buhari",
      "buhari",
      "abu ʿabd allah muhammad b. ismaʿil b. ibrahim b. al-mugirt al-guʿfi al-buhari",
      "abu ʿabd allah muhammad b. ismaʿil b. ibrahim b. mugirt guʿfi buhari"
    ]
  },
  {
    "names": [
      "الزبير بن بكار",
      "al-zubayr b. bakkār",
      "أبو عبد الله الزبير بن بكار بن عبد الله بن مصعب",
      "Zubayr Ibn Bakkar",
      "abū ʿabd allāh al-zubayr b. bakkār b. ʿabd allāh b. muṣʿab"
    ],
    "variations": [
      "al-zubayr b. bakkar",
      "zubayr b. bakkar",
      "abu ʿabd allah al-zubayr b. bakkar b. ʿabd allah b. musʿab",
      "abu ʿabd allah zubayr b. bakkar b. ʿabd allah b. musʿab"
    ]
  },
  {
    "names": [
      "ابن عبد الحكم",
      "Ibn ʿAbd al-Ḥakam",
      "أبو القاسم عبد الرحمن بن عبد الله بن عبد الحكم بن أعين المصري",
      "Ibn Cabd Hakam",
      "Abū al-Qāsim ʿAbd al-Raḥmãn b. ʿAbd Allāh b. ʿAbd al-Ḥakam b. Aʿyan al-Miṣrī"
    ],
    "variations": [
      "Ibn ʿAbd al-Hakam",
      "Ibn ʿAbd Hakam",
      "Abu al-Qasim ʿAbd al-Rahman b. ʿAbd Allah b. ʿAbd al-Hakam b. Aʿyan al-Misri",
      "Abu Qasim ʿAbd Rahman b. ʿAbd Allah b. ʿAbd Hakam b. Aʿyan Misri"
    ]
  },
  {
    "names": [
      "حنين بن اسحاق",
      "Ḥunayn b. Isḥāq",
      "حنين بن اسحاق العبادي",
      "Hunayn Ibn Ishaq",
      "Ḥunayn b. Isḥāq al-ʿIbādī"
    ],
    "variations": [
      "Hunayn b. Ishaq",
      "Hunayn b. Ishaq al-ʿIbadi",
      "Hunayn b. Ishaq ʿIbadi"
    ]
  },
  {
    "names": [
      "العجلي",
      "al-ʿiǧlī",
      "أبو الحسن أحمد بن عبد الله بن صالح بن مسلم العجلي الكوفي",
      "Abu Hasan Cijli",
      "abū al-ḥassan aḥmad b. ʿabd allāh b. ṣāliḥ b. muslim al-ʿiǧlī al-kūfī"
    ],
    "variations": [
      "al-ʿigli",
      "ʿigli",
      "abu al-hassan ahmad b. ʿabd allah b. salih b. muslim al-ʿigli al-kufi",
      "abu hassan ahmad b. ʿabd allah b. salih b. muslim ʿigli kufi"
    ]
  },
  {
    "names": [
      "مسلم",
      "Muslim",
      "أبو الحسين مسلم بن الحجاج بن مسلم القشيري النيسابوري",
      "Abū al-Ḥusayn Muslim b. al-Ḥaǧǧāǧ b. Muslim al-Qušayrī al-Naysābūrī"
    ],
    "variations": [
      "Abu al-Husayn Muslim b. al-Haggag b. Muslim al-Qusayri al-Naysaburi",
      "Abu Husayn Muslim b. Haggag b. Muslim Qusayri Naysaburi"
    ]
  },
  {
    "names": [
      "عمر بن شبة",
      "ʿUmar b. Šabbaŧ",
      "أبو زيد عمر بن شبة بن عبيدة النميري",
      "Cumar Ibn Shabba",
      "Abū Zayd ʿUmar b. Šabbaŧ b. ʿAbīdaŧ al-Numayrī"
    ],
    "variations": [
      "ʿUmar b. Sabbat",
      "Abu Zayd ʿUmar b. Sabbat b. ʿAbidat al-Numayri",
      "Abu Zayd ʿUmar b. Sabbat b. ʿAbidat Numayri"
    ]
  },
  {
    "names": [
      "المزني",
      "al-Muzanī",
      "أبو ابراهيم اسماعيل بن يحيى بن اسماعيل بن عمرو بن مسلم المزني المصري",
      "Ibn Yahya Muzani",
      "Abū Ibrāhīm Ismāʿīl b. Yaḥyá b. Ismāʿīl b. ʿAmrů b. Muslim al-Muzanī al-Miṣrī"
    ],
    "variations": [
      "al-Muzani",
      "Muzani",
      "Abu Ibrahim Ismaʿil b. Yahya b. Ismaʿil b. ʿAmru b. Muslim al-Muzani al-Misri",
      "Abu Ibrahim Ismaʿil b. Yahya b. Ismaʿil b. ʿAmru b. Muslim Muzani Misri"
    ]
  },
  {
    "names": [
      "عباس الدوري",
      "ʿAbbās al-Dūrī",
      "أبو الفضل عباس بن محمد بن حاتم الدوري",
      "Cabbas Duri",
      "Abū al-Faḍl ʿAbbās b. Muḥammad b. Ḥātim al-Dūrī"
    ],
    "variations": [
      "ʿAbbas al-Duri",
      "ʿAbbas Duri",
      "Abu al-Fadl ʿAbbas b. Muhammad b. Hatim al-Duri",
      "Abu Fadl ʿAbbas b. Muhammad b. Hatim Duri"
    ]
  },
  {
    "names": [
      "محمد ابن اسحاق الفاكهي",
      "Muḥammad Ibn Isḥāq al-Fākihī",
      "أبو عبد الله محمد بن اسحاق بن العباس المكي الفاكهي",
      "Ibn Ishaq Fakihi",
      "Abū ʿAbd Allāh Muḥammad b. Isḥāq b. al-ʿAbbās al-Makkī al-Fākihī"
    ],
    "variations": [
      "Muhammad Ibn Ishaq al-Fakihi",
      "Muhammad Ibn Ishaq Fakihi",
      "Abu ʿAbd Allah Muhammad b. Ishaq b. al-ʿAbbas al-Makki al-Fakihi",
      "Abu ʿAbd Allah Muhammad b. Ishaq b. ʿAbbas Makki Fakihi"
    ]
  },
  {
    "names": [
      "أبو بكر المروذي",
      "Abū Bakr al-Marrūḏī",
      "أبو بكر أحمد بن محمد بن الحجاج بن عبد الله المروذي",
      "Abu Bakr Marrudhi",
      "Abū Bakr Aḥmad b. Muḥammad b. al-Ḥaǧǧāǧ b. ʿAbd Allāh al-Marrūḏī"
    ],
    "variations": [
      "Abu Bakr al-Marrudi",
      "Abu Bakr Marrudi",
      "Abu Bakr Ahmad b. Muhammad b. al-Haggag b. ʿAbd Allah al-Marrudi",
      "Abu Bakr Ahmad b. Muhammad b. Haggag b. ʿAbd Allah Marrudi"
    ]
  },
  {
    "names": [
      "أبو داود سليمان بن الأشعث بن إسحاق بن بشير بن شداد بن عمرو الأزدي السجستاني",
      "Abu Dawud Sijistani",
      "السجستاني، أبو داود",
      "أبو داود سليمان بن الأشعث السجستاني",
      "سليمان بن الأشعث السجستاني أبو داود",
      "أبو داود السجستاني",
      "أبو داود سليمان بن الأشعث بن إسحاق بن بشير بن شداد بن عمرو الأزدي السجستاني (المتوفى: 275هـ)",
      "أبو داود سليمان بن الأشعث بن إسحاق بن بشير بن شداد بن عمرو الأزدي السجستاني (المتوفى: 275هـ) :: أبو عبد الله أحمد بن محمد بن حنبل بن هلال بن أسد الشيباني (المتوفى: 241هـ)",
      "سليمان بن الأشعث أبو داود",
      "سليمان بن الأشعث",
      "أبو بكر محمد بن الحسين بن عبد الله الآجُرِّيُّ البغدادي",
      "الآجري",
      "سليمان بن الأشعث أبو داود السجستاني",
      "ابن الأشعث السجستاني",
      "سليمان بن الأشعث أبو داود السجستاني الأزدي",
      "أبو داود سليمان بن الأشعث بن إسحاق بن بشير بن شداد بن عمرو الأزدي السجستاني (المتوفى : 275هـ)"
    ],
    "variations": [
      "أبو بكر محمد بن الحسين بن عبد الله الآجري البغدادي"
    ]
  },
  {
    "names": [
      "أبو الحواري الأعمى",
      "Abū al-Ḥawārī al-Aʿmá",
      "الأعمى أبو الحواري محمد بن الحواري بن عثمان العماني",
      "Abu Hawari Cumani",
      "al-Aʿmá Abū al-Ḥawārī Muḥammad b. al-Ḥawārī b. ʿUṯmān al-ʿUmānī"
    ],
    "variations": [
      "Abu al-Hawari al-Aʿma",
      "Abu Hawari Aʿma",
      "al-Aʿma Abu al-Hawari Muhammad b. al-Hawari b. ʿUtman al-ʿUmani",
      "Aʿma Abu Hawari Muhammad b. Hawari b. ʿUtman ʿUmani"
    ]
  },
  {
    "names": [
      "(مترجم مجهول)",
      "(mutarjim majhūl)",
      "",
      "Anon Translator",
      ""
    ],
    "variations": [
      "(mutarjim majhul)"
    ]
  },
  {
    "names": [
      "اصطفن ابن بسيل",
      "Iṣṭifan ibn Basīl",
      "اصطفن بن بسيل",
      "Istifan Ibn Basil",
      "Iṣṭifan b. Basīl"
    ],
    "variations": [
      "Istifan ibn Basil",
      "Istifan b. Basil"
    ]
  },
  {
    "names": [
      "ثيادورس ابن بسيل",
      "Ṯayādūrus Ibn Basīl",
      "ثيادورس، ثدارä بن بسيل أخ اصطفن",
      "Thayadurus Ibn Basil",
      "Ṯayādūrus, Ṯadārä b. Basīl aḫ Iṣṭifan"
    ],
    "variations": [
      "Tayadurus Ibn Basil",
      "ثيادورس، ثدارa بن بسيل أخ اصطفن",
      "Tayadurus, Tadara b. Basil ah Istifan"
    ]
  },
  {
    "names": [
      "أسطاث",
      "Usṭāṯ",
      "Ustath"
    ],
    "variations": [
      "Ustat"
    ]
  },
  {
    "names": [
      "ابن قتيبة، الدينوري",
      "Ibn Qutaybaŧ, al-Dīnawarī",
      "أبو محمد عبد الله بن مسلم بن قتيبة الدينوري، الكوفي، المروزي",
      "Ibn Qutayba Dinawari",
      "Abū Muḥammad ʿAbd Allāh b. Muslim b. Qutaybaŧ al-Dīnawarī, al-Kūfī, al-Marwazī"
    ],
    "variations": [
      "Ibn Qutaybat, al-Dinawari",
      "Ibn Qutaybat, Dinawari",
      "Abu Muhammad ʿAbd Allah b. Muslim b. Qutaybat al-Dinawari, al-Kufi, al-Marwazi",
      "Abu Muhammad ʿAbd Allah b. Muslim b. Qutaybat Dinawari, Kufi, Marwazi"
    ]
  },
  {
    "names": [
      "بن سفيان الفسوي",
      "b. sufyān al-fasawī",
      "الحافظ أبو يوسف يعقوب بن سفيان بن حوان الفارسي الفسوي",
      "Ibn Sufyan Fasawi",
      "al-ḥāfiẓ abū yūsuf yaʿqūb b. sufyān b. ḥawān al-fārsī al-fasawī"
    ],
    "variations": [
      "b. sufyan al-fasawi",
      "b. sufyan fasawi",
      "al-hafiz abu yusuf yaʿqub b. sufyan b. hawan al-farsi al-fasawi",
      "hafiz abu yusuf yaʿqub b. sufyan b. hawan farsi fasawi"
    ]
  },
  {
    "names": [
      "يحيى بن الحسن العقيقي",
      "Yaḥyá b. al-Ḥasan al-ʿAqīqī",
      "أبو الحسين يحيى بن الحسن بن جعفر العقيقي",
      "Yahya Ibn Hasan Caqiqi",
      "Abū al-Ḥusayn Yaḥyá b. al-Ḥasan b. Ǧaʿfar al-ʿAqīqī"
    ],
    "variations": [
      "Yahya b. al-Hasan al-ʿAqiqi",
      "Yahya b. Hasan ʿAqiqi",
      "Abu al-Husayn Yahya b. al-Hasan b. Gaʿfar al-ʿAqiqi",
      "Abu Husayn Yahya b. Hasan b. Gaʿfar ʿAqiqi"
    ]
  },
  {
    "names": [
      "بلاذري",
      "Balāḏurī",
      "أبو الحسن أحمد بن يحيى بن جابر بن داوود",
      "Baladhuri",
      "Abū al-Ḥasan Aḥmad b. Yaḥyá b. Jābir b. Dāwůd"
    ],
    "variations": [
      "Baladuri",
      "Abu al-Hasan Ahmad b. Yahya b. Jabir b. Dawud",
      "Abu Hasan Ahmad b. Yahya b. Jabir b. Dawud"
    ]
  },
  {
    "names": [
      "ابن أبي خيثمة",
      "Ibn Abī Ḫayṯamaŧ",
      "أبو بكر أحمد بن زهير بن حرب",
      "Ibn Abi Khaythama",
      "Abū Bakr Aḥmad b. Zuhayr b. Ḥarb"
    ],
    "variations": [
      "Ibn Abi Haytamat",
      "Abu Bakr Ahmad b. Zuhayr b. Harb"
    ]
  },
  {
    "names": [
      "عثمان بن سعيد الدارمي",
      "ʿUṯmān b. Saʿīd al-Dārimī",
      "أبو سعيد عثمان بن سعيد بن خالد بن سعيد السجستاني الدارمي",
      "Cuthman Ibn Sacid Darimi",
      "Abū Saʿīd ʿUṯmān b. Saʿīd b. Ḫālid b. Saʿīd al-Sijistānī al-Dārimī"
    ],
    "variations": [
      "ʿUtman b. Saʿid al-Darimi",
      "ʿUtman b. Saʿid Darimi",
      "Abu Saʿid ʿUtman b. Saʿid b. Halid b. Saʿid al-Sijistani al-Darimi",
      "Abu Saʿid ʿUtman b. Saʿid b. Halid b. Saʿid Sijistani Darimi"
    ]
  },
  {
    "names": [
      "ابن طيفور",
      "Ibn Ṭayfūr",
      "أبو الفضل أحمد بن أبي طاهر المروذي الكاتب",
      "Ibn Tayfur",
      "Abū al-Faḍl Aḥmad b. Abī Ṭāhir al-Marwḏī al-Kātib"
    ],
    "variations": [
      "Abu al-Fadl Ahmad b. Abi Tahir al-Marwdi al-Katib",
      "Abu Fadl Ahmad b. Abi Tahir Marwdi Katib"
    ]
  },
  {
    "names": [
      "ابن أبي الدنيا",
      "Ibn Abī al-Dunyā",
      "الحافظ أبو بكر عبد الله بن محمد بن عبيد بن سفيان بن قيس البغدادي، الأموي، القرشي",
      "Ibn Abi Dunya",
      "al-Ḥāfiẓ Abū Bakr ʿAbd Allāh b. Muḥammad b. ʿUbayd b. Sufyān b. Qays al-Baġdādī, al-Umawī, al-Qurašī"
    ],
    "variations": [
      "Ibn Abi al-Dunya",
      "al-Hafiz Abu Bakr ʿAbd Allah b. Muhammad b. ʿUbayd b. Sufyan b. Qays al-Bagdadi, al-Umawi, al-Qurasi",
      "Hafiz Abu Bakr ʿAbd Allah b. Muhammad b. ʿUbayd b. Sufyan b. Qays Bagdadi, Umawi, Qurasi"
    ]
  },
  {
    "names": [
      "ابن يزيد المبرد",
      "Ibn Yazīd al-Mubarrad",
      "أبو لعباس محمد بن يزيد بن عبد الأكبر بن عمير بن حسان بن سليم بن سعد بن عبدالله بن زيد بن مالك بن الحارث بن عامر بن عبدالله بن بلال بن عوف بن أسلم بن كعب بن الحارث بن كعب بن عبدالله بن مالك بن النضر بن الأزد بن الغوث الأزدي الثمالي المبرد",
      "Ibn Yazid Mubarrad",
      "Abū l-ʿAbbās Muḥammad b. Yazīd b. ʿAbd al-Akbar b. ʿUmayr b. Ḥasān b. Salīm b. Saʿd b. ʿAbdallāh b. Zayd b. Mālik b. al-Ḥāriṯ b. ʿĀmir b. ʿAbdallāh b. Bilāl b. ʿAwf b. Aslam b. Kaʿb b. al-Ḥāriṯ b. Kaʿb b. ʿAbdallāh b. Mālik b. al-Naḍr b. al-Azad b. al-Ġawṯ al-Azdī al-Ṯimālī al-Mubarrad"
    ],
    "variations": [
      "Ibn Yazid al-Mubarrad",
      "Abu l-ʿAbbas Muhammad b. Yazid b. ʿAbd al-Akbar b. ʿUmayr b. Hasan b. Salim b. Saʿd b. ʿAbdallah b. Zayd b. Malik b. al-Harit b. ʿAmir b. ʿAbdallah b. Bilal b. ʿAwf b. Aslam b. Kaʿb b. al-Harit b. Kaʿb b. ʿAbdallah b. Malik b. al-Nadr b. al-Azad b. al-Gawt al-Azdi al-Timali al-Mubarrad",
      "Abu l-ʿAbbas Muhammad b. Yazid b. ʿAbd Akbar b. ʿUmayr b. Hasan b. Salim b. Saʿd b. ʿAbdallah b. Zayd b. Malik b. Harit b. ʿAmir b. ʿAbdallah b. Bilal b. ʿAwf b. Aslam b. Kaʿb b. Harit b. Kaʿb b. ʿAbdallah b. Malik b. Nadr b. Azad b. Gawt Azdi Timali Mubarrad"
    ]
  },
  {
    "names": [
      "ابن أبي عاصم",
      "Ibn Abī ʿĀṣim",
      "أحمد بن عمرو بن الضحاك بن مخلد بن الضحاك بن مسلم بن الضحاك الشيباني",
      "Ibn Abi Casim",
      "Aḥmad b. ʿAmr*w b. al-Ḍaḥḥāk b. Ma_hlad b. al-Ḍaḥḥāk b. Muslim b. al-Ḍaḥḥāk al-^Saybānī"
    ],
    "variations": [
      "Ibn Abi ʿAsim",
      "Ahmad b. ʿAmr*w b. al-Dahhak b. Ma_hlad b. al-Dahhak b. Muslim b. al-Dahhak al-^Saybani",
      "Ahmad b. ʿAmr*w b. Dahhak b. Ma_hlad b. Dahhak b. Muslim b. Dahhak ^Saybani"
    ]
  },
  {
    "names": [
      "ثابت ابن قرة",
      "Ṯābit ibn Qurraŧ",
      "ثابت بن قرة",
      "Thabit Ibn Qurra",
      "Ṯābit b. Qurraŧ"
    ],
    "variations": [
      "Tabit ibn Qurrat",
      "Tabit b. Qurrat"
    ]
  },
  {
    "names": [
      "أبو عبد الرحمان عبد الله بن أحمد بن محمد بن حنبل الشيباني",
      "Ibn Ahmad Ibn Hanbal",
      "Abū ʿAbd al-Raḥmān ʿAbd Allāh b. Aḥmad b. Muḥammad b. Ḥanbal al-Šaybānī"
    ],
    "variations": [
      "Abu ʿAbd al-Rahman ʿAbd Allah b. Ahmad b. Muhammad b. Hanbal al-Saybani",
      "Abu ʿAbd Rahman ʿAbd Allah b. Ahmad b. Muhammad b. Hanbal Saybani"
    ]
  },
  {
    "names": [
      "بحشل الواصطي",
      "baḥšal al-wāṣiṭī",
      "أبو حسن أسلم بن سهل بن حبيب الرزاز الواصطي",
      "Bahshal",
      "abū ḥassan aslam b. sahl b. ḥabīb al-razāz al-wāṣiṭī"
    ],
    "variations": [
      "bahsal al-wasiti",
      "bahsal wasiti",
      "abu hassan aslam b. sahl b. habib al-razaz al-wasiti",
      "abu hassan aslam b. sahl b. habib razaz wasiti"
    ]
  },
  {
    "names": [
      "اليعقوبي، ابن واضح الأخباري",
      "al-Yaʿqūbī, Ibn Wāḍiḥ al-Aḫbārī",
      "الكاتب العباسي أبوالعباس أحمد بن أبي يعقوب بن جعفر بن وهب بن واضح اليعقوبي",
      "Yacqubi",
      "al-Kātib al-ʿAbbāsī Abū-al-ʿAbbās Aḥmad b. Abī Yaʿqūb b. Ǧaʿfar b. Wahb b. Wāḍiḥ al-Yaʿqūbī"
    ],
    "variations": [
      "al-Yaʿqubi, Ibn Wadih al-Ahbari",
      "Yaʿqubi, Ibn Wadih Ahbari",
      "al-Katib al-ʿAbbasi Abu-al-ʿAbbas Ahmad b. Abi Yaʿqub b. Gaʿfar b. Wahb b. Wadih al-Yaʿqubi",
      "Katib ʿAbbasi Abu-ʿAbbas Ahmad b. Abi Yaʿqub b. Gaʿfar b. Wahb b. Wadih Yaʿqubi"
    ]
  },
  {
    "names": [
      "أبو عمران موسى بن هارون بن عبد الله البزاز",
      "Ibn Harun Bazzaz",
      "Abū ʿImrān Mūsá b. Hārūn b. ʿAbd Allāh al-Bazzāz"
    ],
    "variations": [
      "Abu ʿImran Musa b. Harun b. ʿAbd Allah al-Bazzaz",
      "Abu ʿImran Musa b. Harun b. ʿAbd Allah Bazzaz"
    ]
  },
  {
    "names": [
      "اسحاق بن حنين",
      "Isḥāq b. Ḥunayn",
      "اسحاق بن حنين بن اسحاق",
      "Ishaq Ibn Hunayn",
      "Isḥāq b. Ḥunayn b. Isḥāq"
    ],
    "variations": [
      "Ishaq b. Hunayn",
      "Ishaq b. Hunayn b. Ishaq"
    ]
  },
  {
    "names": [
      "(مترجم مجهول)",
      "(mutarjim majhūl)",
      "",
      "Anon Translator",
      ""
    ],
    "variations": [
      "(mutarjim majhul)"
    ]
  },
  {
    "names": [
      "عيسى بن يحيى",
      "ʿĪsá b. Yaḥyá",
      "عيسى بن يحيى بن ابراهيم",
      "Cisa Ibn Yahya",
      "ʿĪsá b. Yaḥyá b. Ibrāhīm"
    ],
    "variations": [
      "ʿIsa b. Yahya",
      "ʿIsa b. Yahya b. Ibrahim"
    ]
  },
  {
    "names": [
      "حبيش بن الحسن",
      "Ḥubayš b. al-Ḥasan",
      "أبو الخير حبيش بن الحسن بن الأعسم الدمشقي",
      "Hubaysh Ibn Hasan",
      "Abū al-Ḫayr Ḥubayš b. al-Ḥasan b. al-Aʿsam al-Dimašqī"
    ],
    "variations": [
      "Hubays b. al-Hasan",
      "Hubays b. Hasan",
      "Abu al-Hayr Hubays b. al-Hasan b. al-Aʿsam al-Dimasqi",
      "Abu Hayr Hubays b. Hasan b. Aʿsam Dimasqi"
    ]
  },
  {
    "names": [
      "ابن خرداذبه",
      "Ibn Ḫurdāḏbih",
      "أبو القاسم عبيد الله بن عبد الله (oر أحمد) بن خرداذبه",
      "Ibn Khurdadhbih",
      "Abū al-Qāsim ʿUbayd Al-lãh b. ʿAbd Al-lãh (or Aḥmad) b. Ḫurdāḏbih"
    ],
    "variations": [
      "Ibn Hurdadbih",
      "Abu al-Qasim ʿUbayd Al-lah b. ʿAbd Al-lah (or Ahmad) b. Hurdadbih",
      "Abu Qasim ʿUbayd lah b. ʿAbd lah (or Ahmad) b. Hurdadbih"
    ]
  },
  {
    "names": [
      "ابن رسته",
      "Ibn Rustah",
      "أبو علي أحمد بن عمر بن رسته",
      "Ibn Rusta",
      "Abū ʿAlī Aḥmad b. ʿUmar b. Rustah"
    ],
    "variations": [
      "Abu ʿAli Ahmad b. ʿUmar b. Rustah"
    ]
  },
  {
    "names": [
      "ابن شهدا الكرخي",
      "Ibn Šahdā al-Karḫī",
      "الكرخي",
      "Ibn Shahda Karkhi",
      "al-Karḫī"
    ],
    "variations": [
      "Ibn Sahda al-Karhi",
      "Ibn Sahda Karhi",
      "al-Karhi",
      "Karhi"
    ]
  },
  {
    "names": [
      "اسحاق بن علي الرهاوي",
      "Isḥāq b. ʿAlī al-Ruhāwī",
      "Ishaq Ruhawi"
    ],
    "variations": [
      "Ishaq b. ʿAli al-Ruhawi",
      "Ishaq b. ʿAli Ruhawi"
    ]
  },
  {
    "names": [
      "قسطا بن لوقا",
      "Qusṭā b. Lūqā",
      "قسطا بن لوقا البعلبكي",
      "Qusta Ibn Luqa",
      "Qusṭā b. Lūqā al-Baʿlabakkī"
    ],
    "variations": [
      "Qusta b. Luqa",
      "Qusta b. Luqa al-Baʿlabakki",
      "Qusta b. Luqa Baʿlabakki"
    ]
  },
  {
    "names": [
      "ابن سفيان النسوي",
      "Ibn Sufyān al-Nasawī",
      "أبو العباس الحسن بن سفيان بن عامر بن عبد العزيز بن النعمان الشيباني، الخراساني، النسوي",
      "Ibn Sufyan Nasawi",
      "Abū al-ʿAbbās al-Ḥasan b. Sufyān b. ʿĀmir b. ʿAbd al-ʿAzīz b. al-Nuʿmān al-Šaybānī, al-Ḫurāsānī, al-Nasawī"
    ],
    "variations": [
      "Ibn Sufyan al-Nasawi",
      "Abu al-ʿAbbas al-Hasan b. Sufyan b. ʿAmir b. ʿAbd al-ʿAziz b. al-Nuʿman al-Saybani, al-Hurasani, al-Nasawi",
      "Abu ʿAbbas Hasan b. Sufyan b. ʿAmir b. ʿAbd ʿAziz b. Nuʿman Saybani, Hurasani, Nasawi"
    ]
  },
  {
    "names": [
      "النسائي",
      "al-Nasā'ī",
      "القاضي أبو عبد الرحمان أحمد بن شعيب بن علي بن سنان بن بحر بن دينار",
      "Nasai",
      "al-Qāḍī Abū ʿAbd al-Raḥmān Aḥmad b. Šuʿayb b. ʿAlī b. Sinān b. Baḥr b. Dīnār"
    ],
    "variations": [
      "al-Nasa'i",
      "Nasa'i",
      "al-Qadi Abu ʿAbd al-Rahman Ahmad b. Suʿayb b. ʿAli b. Sinan b. Bahr b. Dinar",
      "Qadi Abu ʿAbd Rahman Ahmad b. Suʿayb b. ʿAli b. Sinan b. Bahr b. Dinar"
    ]
  },
  {
    "names": [
      "أبو عثمان الدمشقي",
      "Abū ʿUṯmān al-Dimašqī",
      "أبو عثمان سعيد بن يعقوب الدمشقي",
      "Abu Cuthman Dimashqi",
      "Abū ʿUṯmān Saʿīd b. Yaʿqūb al-Dimašqī"
    ],
    "variations": [
      "Abu ʿUtman al-Dimasqi",
      "Abu ʿUtman Dimasqi",
      "Abu ʿUtman Saʿid b. Yaʿqub al-Dimasqi",
      "Abu ʿUtman Saʿid b. Yaʿqub Dimasqi"
    ]
  },
  {
    "names": [
      "Aḥmad ibn Faḍlān",
      "Ibn Fadlan",
      "أحمد بن فضلان",
      "أحمد بن فضلان بن العباس بن راشد ابن حماد (المتوفى: بعد 310هـ)",
      "أحمد ابن فضلان",
      "أحمد بن فضلان بن العباس بن راشد",
      "ابن فضلان"
    ],
    "variations": [
      "Ahmad ibn Fadlan"
    ]
  },
  {
    "names": [
      "كراع النمل",
      "Kurāʿ al-Naml",
      "أبو الحسن علي بن الحسن الهنائي، الأزدي",
      "Kurac Naml",
      "Abū al-Ḥasan ʿAlī b. al-Ḥasan al-Hunāʾī, al-Azdī"
    ],
    "variations": [
      "Kuraʿ al-Naml",
      "Kuraʿ Naml",
      "Abu al-Hasan ʿAli b. al-Hasan al-Hunaʾi, al-Azdi",
      "Abu Hasan ʿAli b. Hasan Hunaʾi, Azdi"
    ]
  },
  {
    "names": [
      "أبو العباس النيريزي",
      "Abū al-ʿAbbās al-Nayrīzī",
      "أبو العباس الفضل بن حاتم النيريزي",
      "Abu Cabbas Nayrizi",
      "Abū al-ʿAbbās al-Faḍl b. Ḥātim al-Nayrīzī"
    ],
    "variations": [
      "Abu al-ʿAbbas al-Nayrizi",
      "Abu ʿAbbas Nayrizi",
      "Abu al-ʿAbbas al-Fadl b. Hatim al-Nayrizi",
      "Abu ʿAbbas Fadl b. Hatim Nayrizi"
    ]
  },
  {
    "names": [
      "الطبري",
      "al-Ṭabarī",
      "أبو جعفر محمد بن جرير بن يزيد بن كثير بن غالب الطبري، الآملي",
      "Tabari",
      "Abū Ǧaʿfar Muḥammad b. Ǧarīr b. Yazīd b. Kaṯīr b. Ġālib al-Ṭabarī, al-Āmulī"
    ],
    "variations": [
      "al-Tabari",
      "Abu Gaʿfar Muhammad b. Garir b. Yazid b. Katir b. Galib al-Tabari, al-Amuli",
      "Abu Gaʿfar Muhammad b. Garir b. Yazid b. Katir b. Galib Tabari, Amuli"
    ]
  },
  {
    "names": [
      "الخلال",
      "al-Ḫallāl",
      "أبو بكر أحمد بن محمد بن هارون",
      "Abu Bakr Khallal",
      "Abū Bakr Aḥmad b. Muḥammad b. Hārūn"
    ],
    "variations": [
      "al-Hallal",
      "Hallal",
      "Abu Bakr Ahmad b. Muhammad b. Harun"
    ]
  },
  {
    "names": [
      "الطحاوي",
      "al-Ṭaḥāwī",
      "أبو جعفر أحمد بن محمد بن سلامة بن عبد الملك الأزدي الحجري الطحاوي",
      "Tahawi",
      "Abū Ǧaʿfar Aḥmad b. Muḥammad b. Salāmaŧ b. ʿAbd al-malik al-Azdī al-Ḥaǧrī al-Ṭaḥāwī"
    ],
    "variations": [
      "al-Tahawi",
      "Abu Gaʿfar Ahmad b. Muhammad b. Salamat b. ʿAbd al-malik al-Azdi al-Hagri al-Tahawi",
      "Abu Gaʿfar Ahmad b. Muhammad b. Salamat b. ʿAbd malik Azdi Hagri Tahawi"
    ]
  },
  {
    "names": [
      "ابن أبي عون البغدادي",
      "Ibn Abī ʿAwn al-Baġdādī",
      "أبو اسحاق ابراهيم بن محمد بن أحمد بن أبي عون الكاتب البغدادي",
      "Ibn Abi Cawn",
      "Abū Isḥāq Ibrāhīm b. Muḥammad b. Aḥmad b. Abī ʿAwn al-Kātib al-Baġdādī"
    ],
    "variations": [
      "Ibn Abi ʿAwn al-Bagdadi",
      "Ibn Abi ʿAwn Bagdadi",
      "Abu Ishaq Ibrahim b. Muhammad b. Ahmad b. Abi ʿAwn al-Katib al-Bagdadi",
      "Abu Ishaq Ibrahim b. Muhammad b. Ahmad b. Abi ʿAwn Katib Bagdadi"
    ]
  },
  {
    "names": [
      "أبو بكر الخرائطي",
      "Abū Bakr al-Ḫarāʾiṭī",
      "أبو بكر محمد بن جعفر بن محمد بن سهل الخرائطي، السامري",
      "Abu Bakr Kharaiti",
      "Abū Bakr Muḥammad b. Ǧaʿfar b. Muḥammad b. Sahl al-Ḫarāʾiṭī, al-Sāmirī"
    ],
    "variations": [
      "Abu Bakr al-Haraʾiti",
      "Abu Bakr Haraʾiti",
      "Abu Bakr Muhammad b. Gaʿfar b. Muhammad b. Sahl al-Haraʾiti, al-Samiri",
      "Abu Bakr Muhammad b. Gaʿfar b. Muhammad b. Sahl Haraʾiti, Samiri"
    ]
  },
  {
    "names": [
      "أبو بشر متى بن يونس",
      "Abū Bišr Mattá b. Yūnus",
      "أبو بشر متى بن يونس القنائي",
      "Abu Bishr Ibn Yunus",
      "Abū Bišr Mattá b. Yūnus al-Qunnāʾī"
    ],
    "variations": [
      "Abu Bisr Matta b. Yunus",
      "Abu Bisr Matta b. Yunus al-Qunnaʾi",
      "Abu Bisr Matta b. Yunus Qunnaʾi"
    ]
  },
  {
    "names": [
      "ابن عبد ربه",
      "Ibn ʿAbd Rabbih",
      "أبو عمر محمد بن محمد بن عبد ربه",
      "Ibn Cabd Rabbih",
      "Abū ʿUmar Muḥammad b. Muḥammad b. ʿAbd Rabbih"
    ],
    "variations": [
      "Abu ʿUmar Muhammad b. Muhammad b. ʿAbd Rabbih"
    ]
  },
  {
    "names": [
      "الكليني",
      "al-Kulaynī",
      "ثقة الإسلام أبو جعفر محمد بن يعقوب بن اسحاق الكلينيىلكليني الرازي",
      "Ibn Yacqub Kulayni",
      "Ṯiqaŧ al-ʾIslām Abū Ǧaʿfar Muḥammad b. Yaʿqūb b. Isḥāq al-Kulaynī/al-Kulīnī al-Rāzī"
    ],
    "variations": [
      "al-Kulayni",
      "Kulayni",
      "Tiqat al-ʾIslam Abu Gaʿfar Muhammad b. Yaʿqub b. Ishaq al-Kulayni/al-Kulini al-Razi",
      "Tiqat ʾIslam Abu Gaʿfar Muhammad b. Yaʿqub b. Ishaq Kulayni/Kulini Razi"
    ]
  },
  {
    "names": [
      "ابن مروان الدينوري",
      "Ibn Marwān al-Dīnawarī",
      "أبي بكر أحمد بن مروان بن محمد الدينوري، القاضي، المالكي، الفقيه، العلامة، ال محدث",
      "Ibn Marwan Dinawari",
      "ʾAbī Bakr ʾAḥmad b. Marwān b. Muḥammad al-Dīnawarī, al-Qāḍī, al-Mālikī, al-Faqīh, al-ʿAllāma=t, al- muḥaddi_t"
    ],
    "variations": [
      "Ibn Marwan al-Dinawari",
      "ʾAbi Bakr ʾAhmad b. Marwan b. Muhammad al-Dinawari, al-Qadi, al-Maliki, al-Faqih, al-ʿAllama=t, al- muhaddi_t",
      "ʾAbi Bakr ʾAhmad b. Marwan b. Muhammad Dinawari, Qadi, Maliki, Faqih, ʿAllama=t,  muhaddi_t"
    ]
  },
  {
    "names": [
      "ابن حائك الهمداني، ابن أبي الدمين الهمداني",
      "Ibn Ḥāʾik al-Hamdānī, Ibn Abī al-Dumayna al-Hamdānī",
      "أبو محمد الحسن بن أحمد بن يعقوب الهمداني",
      "Ibn Haik Hamdani",
      "Abū Muḥammad al-Ḥasan b. Aḥmad b. Yaʿqūb al-Hamdānī"
    ],
    "variations": [
      "Ibn Haʾik al-Hamdani, Ibn Abi al-Dumayna al-Hamdani",
      "Ibn Haʾik Hamdani, Ibn Abi Dumayna Hamdani",
      "Abu Muhammad al-Hasan b. Ahmad b. Yaʿqub al-Hamdani",
      "Abu Muhammad Hasan b. Ahmad b. Yaʿqub Hamdani"
    ]
  },
  {
    "names": [
      "ابن القاص",
      "Ibn al-Qāṣṣ",
      "أبو العباس أحمد بن أحمد بن أبي أحمد الطبري",
      "Ibn Qass",
      "Abū al-ʿAbbās Aḥmad b. Aḥmad b. Abī Aḥmad al-Ṭabarī"
    ],
    "variations": [
      "Ibn al-Qass",
      "Abu al-ʿAbbas Ahmad b. Ahmad b. Abi Ahmad al-Tabari",
      "Abu ʿAbbas Ahmad b. Ahmad b. Abi Ahmad Tabari"
    ]
  },
  {
    "names": [
      "الصولي",
      "al-Ṣūlī",
      "أبو بكر محمد بن يحيى بن العباس بن محمد بن صول",
      "Suli",
      "Abū Bakr Muḥammad b. Yaḥyá b. al-ʿAbbās b. Muḥammad b. Ṣūl"
    ],
    "variations": [
      "al-Suli",
      "Abu Bakr Muhammad b. Yahya b. al-ʿAbbas b. Muhammad b. Sul",
      "Abu Bakr Muhammad b. Yahya b. ʿAbbas b. Muhammad b. Sul"
    ]
  },
  {
    "names": [
      "قدامة بن جعفر",
      "Qudāmaŧ b. Ǧaʿfar",
      "أبو الفرج قدامة بن جعفر الكاتب البغدادي",
      "Qudama Ibn Jacfar",
      "Abū al-Faraǧ Qudāmaŧ b. Ǧaʿfar al-Kātib al-Baġdādī"
    ],
    "variations": [
      "Qudamat b. Gaʿfar",
      "Abu al-Farag Qudamat b. Gaʿfar al-Katib al-Bagdadi",
      "Abu Farag Qudamat b. Gaʿfar Katib Bagdadi"
    ]
  },
  {
    "names": [
      "أبو نصر محمد بن محمد الفارابي (المتوفى : 339هـ)",
      "Abu Nasr Farabi",
      "الفارابي",
      "الفارابي، أبو نصر",
      "محمد بن محمد بن طرخان بن أوزلغ، أبو نصر الفارابي، ويعرف بالمعلم الثاني",
      "al-Fārābī",
      "محمد بن محمد بن طرخان بن أوزلغ، أبو نصر الفارابي، ويعرف بالمعلم الثاني (المتوفى: 339هـ)",
      "أبو النصر الفارابي"
    ],
    "variations": [
      "al-Farabi",
      "Farabi"
    ]
  },
  {
    "names": [
      "ابن الداية",
      "Ibn Daya",
      "أحمد بن يوسف الكاتب ابن الداية (340 ه)",
      "Ibn al-Dāya Aḥmad ibn Yūsuf al-Ṭūlūnī"
    ],
    "variations": [
      "Ibn al-Daya Ahmad ibn Yusuf al-Tuluni",
      "Ibn Daya Ahmad ibn Yusuf Tuluni"
    ]
  },
  {
    "names": [
      "المنصور بالله",
      "al-Manṣūr bi-Allãh",
      "المنصور بالله أبو طاهر اسماعيل بن محمد بن عبيد الله",
      "Mansur Bi Allah",
      "al-Manṣūr bi-Allãh Abū Ṭāhir Ismāʿīl b. Muḥammad b. ʿUbayd Allãh"
    ],
    "variations": [
      "al-Mansur bi-Allah",
      "Mansur bi-Allah",
      "al-Mansur bi-Allah Abu Tahir Ismaʿil b. Muhammad b. ʿUbayd Allah",
      "Mansur bi-Allah Abu Tahir Ismaʿil b. Muhammad b. ʿUbayd Allah"
    ]
  },
  {
    "names": [
      "الاصطخري",
      "al-Iṣṭaḫrī",
      "أبو اسحاق ابراهيم بن محمد الفارسي الاصطخري",
      "Istakhri",
      "Abū Isḥāq Ibrāhīm b. Muḥammad al-Fārisī al-Iṣṭaḫrī"
    ],
    "variations": [
      "al-Istahri",
      "Istahri",
      "Abu Ishaq Ibrahim b. Muhammad al-Farisi al-Istahri",
      "Abu Ishaq Ibrahim b. Muhammad Farisi Istahri"
    ]
  },
  {
    "names": [
      "المسعودي",
      "al-Masʿūdī",
      "أبوالحسن علي بن الحسين بن علي المسعودي",
      "Mascudi",
      "Abū-al-Ḥasan ʿAlī b. al-Ḥusayn b. ʿAlī al-Masʿūdī"
    ],
    "variations": [
      "al-Masʿudi",
      "Masʿudi",
      "Abu-al-Hasan ʿAli b. al-Husayn b. ʿAli al-Masʿudi",
      "Abu-Hasan ʿAli b. Husayn b. ʿAli Masʿudi"
    ]
  },
  {
    "names": [
      "ابن يونس الصدفي",
      "Ibn Yūnus al-Ṣadafī",
      "أبو سعيد عبد الرحمن بن أحمد بن يونس بن عبد الأعلى الصدفي، المصري",
      "Ibn Yunus Sadafi",
      "Abū Saʿīd ʿAbd al-Raḥmãn b. Aḥmad b. Yūnus b. ʿAbd al-Aʿlá al-Ṣadafī, al-Miṣrī"
    ],
    "variations": [
      "Ibn Yunus al-Sadafi",
      "Abu Saʿid ʿAbd al-Rahman b. Ahmad b. Yunus b. ʿAbd al-Aʿla al-Sadafi, al-Misri",
      "Abu Saʿid ʿAbd Rahman b. Ahmad b. Yunus b. ʿAbd Aʿla Sadafi, Misri"
    ]
  },
  {
    "names": [
      "البلوي",
      "al-Balawī",
      "أبو محمد عبد الله بن محمد بن عمير بن محفوظ المديني البلوي",
      "Balawi",
      "Abū Muḥammad ʿAbd Al-lãh b. Muḥammad b. ʿUmayr b. Maḥfūẓ al-Madīnī al-Balawī"
    ],
    "variations": [
      "al-Balawi",
      "Abu Muhammad ʿAbd Al-lah b. Muhammad b. ʿUmayr b. Mahfuz al-Madini al-Balawi",
      "Abu Muhammad ʿAbd lah b. Muhammad b. ʿUmayr b. Mahfuz Madini Balawi"
    ]
  },
  {
    "names": [
      "الماهيار البزّاز",
      "Ibn Jahham"
    ],
    "variations": [
      "الماهيار البزاز"
    ]
  },
  {
    "names": [
      "محمد الكندي",
      "Muḥammad al-Kindī",
      "أبو عمر محمد بن يوسف بن يعقوب بن حفص التجيبي الكندي",
      "Muhammad Kindi",
      "Abū ʿUmar Muḥammad b. Yūsuf b. Yaʿqūb b. Ḥafṣ al-Tuǧībī al-Kindī"
    ],
    "variations": [
      "Muhammad al-Kindi",
      "Abu ʿUmar Muhammad b. Yusuf b. Yaʿqub b. Hafs al-Tugibi al-Kindi",
      "Abu ʿUmar Muhammad b. Yusuf b. Yaʿqub b. Hafs Tugibi Kindi"
    ]
  },
  {
    "names": [
      "أبو العباس الحسني",
      "Abū al-ʿAbbās al-Ḥasanī",
      "أبو العباس أحمد بن ابراهيم بن الحسن بن ابراهيم بن ابراهيم بن محمد بن سليمان بن داود بن الحسن بن علي بن أبي طالب الحسني",
      "Abu Cabbas Hasani",
      "Abū al-ʿAbbās Aḥmad b. Ibrāhīm b. al-Ḥasan b. Ibrāhīm b. Ibrāhīm b. Muḥammad b. Sulaymān b. Dāwud b. al-Ḥasan b. ʿAlī b. Abī Ṭālib al-Ḥasanī"
    ],
    "variations": [
      "Abu al-ʿAbbas al-Hasani",
      "Abu ʿAbbas Hasani",
      "Abu al-ʿAbbas Ahmad b. Ibrahim b. al-Hasan b. Ibrahim b. Ibrahim b. Muhammad b. Sulayman b. Dawud b. al-Hasan b. ʿAli b. Abi Talib al-Hasani",
      "Abu ʿAbbas Ahmad b. Ibrahim b. Hasan b. Ibrahim b. Ibrahim b. Muhammad b. Sulayman b. Dawud b. Hasan b. ʿAli b. Abi Talib Hasani"
    ]
  },
  {
    "names": [
      "أبو علي القالي",
      "Abū ʿAlī al-Qālī",
      "أبو علي اسماعيل بن القاسم القالي",
      "Abu Cali Qali",
      "Abū ʿAlī Ismāʿīl b. al-Qāsim al-Qālī"
    ],
    "variations": [
      "Abu ʿAli al-Qali",
      "Abu ʿAli Qali",
      "Abu ʿAli Ismaʿil b. al-Qasim al-Qali",
      "Abu ʿAli Ismaʿil b. Qasim Qali"
    ]
  },
  {
    "names": [
      "أبو سعيد الكدمي",
      "Abū Saʿīd al-Kudamī",
      "أبو سعيد محمد بن سعيد الكدمي",
      "Abu Sacid Kudami",
      "Abū Saʿīd Muḥammad b. Saʿīd al-Kudamī"
    ],
    "variations": [
      "Abu Saʿid al-Kudami",
      "Abu Saʿid Kudami",
      "Abu Saʿid Muhammad b. Saʿid al-Kudami",
      "Abu Saʿid Muhammad b. Saʿid Kudami"
    ]
  },
  {
    "names": [
      "القاضي النعمان",
      "al-Qāḍī al-Nuʿmān",
      "أبو حنيفة النعمان بن محمد بن منصور بن حيون المغربي التميمي",
      "Qadi Nucman",
      "Abū ḥanīfaŧ al-Nuʿmān b. Muḥammad b. Manṣūr b. Ḥayyūn al-Maġribī al-Tamīmī"
    ],
    "variations": [
      "al-Qadi al-Nuʿman",
      "Qadi Nuʿman",
      "Abu hanifat al-Nuʿman b. Muhammad b. Mansur b. Hayyun al-Magribi al-Tamimi",
      "Abu hanifat Nuʿman b. Muhammad b. Mansur b. Hayyun Magribi Tamimi"
    ]
  },
  {
    "names": [
      "أبو الحسن البسيوي",
      "Abū al-Ḥasan al-Basīwī",
      "أبو الحسن علي بن محمد بن علي بن محمد بن الحسن البسيوي، العماني",
      "Abu Hasan Bisyawi",
      "Abū al-Ḥasan ʿAlī b. Muḥammad b. ʿAlī b. Muḥammad b. al-Ḥasan al-Basīwī, al-ʿUmānī"
    ],
    "variations": [
      "Abu al-Hasan al-Basiwi",
      "Abu Hasan Basiwi",
      "Abu al-Hasan ʿAli b. Muhammad b. ʿAli b. Muhammad b. al-Hasan al-Basiwi, al-ʿUmani",
      "Abu Hasan ʿAli b. Muhammad b. ʿAli b. Muhammad b. Hasan Basiwi, ʿUmani"
    ]
  },
  {
    "names": [
      "أبو زكريا يحيى بن عدي",
      "Abū Zakariyā Yaḥyá b. ʿAdī",
      "Yahya Ibn Cadi"
    ],
    "variations": [
      "Abu Zakariya Yahya b. ʿAdi"
    ]
  },
  {
    "names": [
      "ابن عدي، ابن القطان",
      "Ibn ʿAdī, Ibn al-Qaṭṭān",
      "أبو أحمد عبد الله بن عدي بن عبد الله بن محمد بن المبارك الجرجاني",
      "Ibn Cadi Jurjani",
      "Abū Aḥmad ʿAbd Allāh b. ʿAdī b. ʿAbd Allāh b. Muḥammad b. al-Mubārak al-Jurjānī"
    ],
    "variations": [
      "Ibn ʿAdi, Ibn al-Qattan",
      "Ibn ʿAdi, Ibn Qattan",
      "Abu Ahmad ʿAbd Allah b. ʿAdi b. ʿAbd Allah b. Muhammad b. al-Mubarak al-Jurjani",
      "Abu Ahmad ʿAbd Allah b. ʿAdi b. ʿAbd Allah b. Muhammad b. Mubarak Jurjani"
    ]
  },
  {
    "names": [
      "ابن الفقيه",
      "Ibn al-Faqīh",
      "أبو عبد الله أحمد بن محمد بن اسحاق بن الفقيه الهمذاني",
      "Ibn Faqih Hamadhani",
      "Abū ʿAbd Allāh Aḥmad b. Muḥammad b. Isḥāq b. al-Faqīh al-Hamaḏānī"
    ],
    "variations": [
      "Ibn al-Faqih",
      "Ibn Faqih",
      "Abu ʿAbd Allah Ahmad b. Muhammad b. Ishaq b. al-Faqih al-Hamadani",
      "Abu ʿAbd Allah Ahmad b. Muhammad b. Ishaq b. Faqih Hamadani"
    ]
  },
  {
    "names": [
      "النفري",
      "al-Niffarī",
      "محمد بن عبد الجبار النفري",
      "Ibn Cabd Jabbar Niffari",
      "Muḥammad b. ʿAbd al-Ǧabbār al-Niffarī"
    ],
    "variations": [
      "al-Niffari",
      "Niffari",
      "Muhammad b. ʿAbd al-Gabbar al-Niffari",
      "Muhammad b. ʿAbd Gabbar Niffari"
    ]
  },
  {
    "names": [
      "ابن حوقل",
      "Ibn Ḥawqal",
      "أبو القاسم محمد بن حوقل النصيبي",
      "Ibn Hawqal",
      "Abū al-Qāsim Muḥammad b. Ḥawqal al-Naṣībī"
    ],
    "variations": [
      "Abu al-Qasim Muhammad b. Hawqal al-Nasibi",
      "Abu Qasim Muhammad b. Hawqal Nasibi"
    ]
  },
  {
    "names": [
      "أبو الشيخ الحافظ الاصبهاني",
      "Abū al-Šayḫ al-Ḥāfiẓ al-Iṣbahānī",
      "أبو محمد عبد الله بن محمد بن جعفر بن حيان الأنصاري الحياني",
      "Abu Shaykh Isbahani",
      "Abū Muḥammad ʿAbd Al-lãh b. Muḥammad b. Ǧaʿfar b. Ḥayyān al-Anṣārī al-Ḥayyānī"
    ],
    "variations": [
      "Abu al-Sayh al-Hafiz al-Isbahani",
      "Abu Sayh Hafiz Isbahani",
      "Abu Muhammad ʿAbd Al-lah b. Muhammad b. Gaʿfar b. Hayyan al-Ansari al-Hayyani",
      "Abu Muhammad ʿAbd lah b. Muhammad b. Gaʿfar b. Hayyan Ansari Hayyani"
    ]
  },
  {
    "names": [
      "الآمدي",
      "al-Āmidī",
      "أبو القاسم حسن بن بشر بن يحيى",
      "Abu Qasim Amidi",
      "Abū al-Qāsim Ḥasan b. Bišr b. Yaḥyá"
    ],
    "variations": [
      "al-Amidi",
      "Amidi",
      "Abu al-Qasim Hasan b. Bisr b. Yahya",
      "Abu Qasim Hasan b. Bisr b. Yahya"
    ]
  },
  {
    "names": [
      "القرطبي",
      "al-Qurṭubī",
      "أبو الحسن عريب بن سعد الكاتب القرطبي",
      "Carib Qurtubi",
      "Abū al-Ḥasan ʿArīb b. Saʿd al-Kātib al-Qurṭubī"
    ],
    "variations": [
      "al-Qurtubi",
      "Qurtubi",
      "Abu al-Hasan ʿArib b. Saʿd al-Katib al-Qurtubi",
      "Abu Hasan ʿArib b. Saʿd Katib Qurtubi"
    ]
  },
  {
    "names": [
      "الجساس",
      "al-Ǧassās",
      "أبو بكر أحمد بن علي الجساس الرازي",
      "Ibn Cali Jassas",
      "Abū Bakr Aḥmad b. ʿAlī al-Ǧassās al-Rāzī"
    ],
    "variations": [
      "al-Gassas",
      "Gassas",
      "Abu Bakr Ahmad b. ʿAli al-Gassas al-Razi",
      "Abu Bakr Ahmad b. ʿAli Gassas Razi"
    ]
  },
  {
    "names": [
      "ابن زبر الربعي",
      "Ibn Zabr al-Rabʿī",
      "أبو سليمان محمد بن عبدالله بن أحمد بن سليمان بن زبر الربعي، الدمشقي",
      "Muhammad Rabci",
      "Abū Sulaymān Muḥammad b. ʿAbd-Allāh b. Aḥmad b. Sulaymān b. Zabr al-Rabʿī, al-Dimašqī"
    ],
    "variations": [
      "Ibn Zabr al-Rabʿi",
      "Ibn Zabr Rabʿi",
      "Abu Sulayman Muhammad b. ʿAbd-Allah b. Ahmad b. Sulayman b. Zabr al-Rabʿi, al-Dimasqi",
      "Abu Sulayman Muhammad b. ʿAbd-Allah b. Ahmad b. Sulayman b. Zabr Rabʿi, Dimasqi"
    ]
  },
  {
    "names": [
      "المهلبي",
      "al-Muhallabī",
      "أبو الحسين الحسن بن أحمد المهلبي",
      "Muhallabi",
      "Abū al-Ḥusayn al-Ḥasan b. Aḥmad al-Muhallabī"
    ],
    "variations": [
      "al-Muhallabi",
      "Abu al-Husayn al-Hasan b. Ahmad al-Muhallabi",
      "Abu Husayn Hasan b. Ahmad Muhallabi"
    ]
  },
  {
    "names": [
      "القبيصي",
      "al-Qabīṣī",
      "Qabisi"
    ],
    "variations": [
      "al-Qabisi"
    ]
  },
  {
    "names": [
      "ابن بابويه، الشيخ الصدوق",
      "Ibn Bābawayh, al-Šayḫ al-Ṣadūq",
      "أبو جعفر محمد بن علي بن الحسين بن موسا بن بابويه القمي",
      "Ibn Babawayh Saduq",
      "Abū Ǧaʿfar Muḥammad b. ʿAlī b. al-Ḥusayn b. Mūsā b. Bābawayh al-Qummī"
    ],
    "variations": [
      "Ibn Babawayh, al-Sayh al-Saduq",
      "Ibn Babawayh, Sayh Saduq",
      "Abu Gaʿfar Muhammad b. ʿAli b. al-Husayn b. Musa b. Babawayh al-Qummi",
      "Abu Gaʿfar Muhammad b. ʿAli b. Husayn b. Musa b. Babawayh Qummi"
    ]
  },
  {
    "names": [
      "ابن الوراق",
      "Ibn al-Warrāq",
      "أبو الحسن محمد بن عبد الله بن العباس",
      "Ibn Warraq",
      "Abū al-Ḥasan Muḥammad b. ʿAbd Allāh b. al-ʿAbbās"
    ],
    "variations": [
      "Ibn al-Warraq",
      "Abu al-Hasan Muhammad b. ʿAbd Allah b. al-ʿAbbas",
      "Abu Hasan Muhammad b. ʿAbd Allah b. ʿAbbas"
    ]
  },
  {
    "names": [
      "العامري",
      "al-ʿĀmirī",
      "أبو الحسن محمد بن يوسف العامري النيسابوري",
      "Muhammad Ibn Yusuf Camiri",
      "Abū al-Ḥasan Muḥammad b. Yūsuf al-ʿĀmirī al-Naysābūrī"
    ],
    "variations": [
      "al-ʿAmiri",
      "ʿAmiri",
      "Abu al-Hasan Muhammad b. Yusuf al-ʿAmiri al-Naysaburi",
      "Abu Hasan Muhammad b. Yusuf ʿAmiri Naysaburi"
    ]
  },
  {
    "names": [
      "الرماني",
      "al-Rummānī",
      "أبو الحسن علي بن عيسى بن علي بن عبد الله الاخشيدي، الوراق، الجامع، الرماني",
      "Abu Hasan Rummani",
      "Abū al-Ḥasan ʿAlī b. ʿĪsá b. ʿAlī b. ʿAbd Allāh al-Iḫšīdī, al-Warrāq, al-Jāmiʿ, al-Rummānī"
    ],
    "variations": [
      "al-Rummani",
      "Rummani",
      "Abu al-Hasan ʿAli b. ʿIsa b. ʿAli b. ʿAbd Allah al-Ihsidi, al-Warraq, al-Jamiʿ, al-Rummani",
      "Abu Hasan ʿAli b. ʿIsa b. ʿAli b. ʿAbd Allah Ihsidi, Warraq, Jamiʿ, Rummani"
    ]
  },
  {
    "names": [
      "القاضي التنوخي",
      "al-Qāḍī al-Tanūḫī",
      "أبو علي المحسن بن علي بن محمد التنوخي، القاضي",
      "Ibn Cali Tanukhi",
      "Abū ʿAlī al-Muḥassin b. ʿAlī b. Muḥammad al-Tanūḫī, al-Qāḍī"
    ],
    "variations": [
      "al-Qadi al-Tanuhi",
      "Qadi Tanuhi",
      "Abu ʿAli al-Muhassin b. ʿAli b. Muhammad al-Tanuhi, al-Qadi",
      "Abu ʿAli Muhassin b. ʿAli b. Muhammad Tanuhi, Qadi"
    ]
  },
  {
    "names": [
      "الدارقطني",
      "al-Dāraquṭnī",
      "أبو الحسن علي بن عمر بن أحمد بن مهدي بن مسعود بن النعمان بن دينار بن عبد الله الدارقطني",
      "Daraqutni",
      "Abū al-Ḥasan ʿAlī b. ʿUmar b. Aḥmad b. Mahdī b. Masʿūd b. al-Nuʿmān b. Dīnār b. ʿAbd Allāh al-Dāraquṭnī"
    ],
    "variations": [
      "al-Daraqutni",
      "Abu al-Hasan ʿAli b. ʿUmar b. Ahmad b. Mahdi b. Masʿud b. al-Nuʿman b. Dinar b. ʿAbd Allah al-Daraqutni",
      "Abu Hasan ʿAli b. ʿUmar b. Ahmad b. Mahdi b. Masʿud b. Nuʿman b. Dinar b. ʿAbd Allah Daraqutni"
    ]
  },
  {
    "names": [
      "ابن النديم",
      "Ibn al-Nadīm",
      "أبو الفرج محمد بن أبي يعقوب اسحاق بن محمد بن اسحاق البغدادي، الوراق",
      "Ibn Nadim",
      "Abū- al-Faraǧ Muḥammad b. Abī Yaʿqūb Isḥāq b. Muḥammad b. Isḥāq al-Baġdādī, al-Warrāq"
    ],
    "variations": [
      "Ibn al-Nadim",
      "Abu- al-Farag Muhammad b. Abi Yaʿqub Ishaq b. Muhammad b. Ishaq al-Bagdadi, al-Warraq",
      "Abu- Farag Muhammad b. Abi Yaʿqub Ishaq b. Muhammad b. Ishaq Bagdadi, Warraq"
    ]
  },
  {
    "names": [
      "ابن بطة",
      "Ibn Batta Cukbari",
      "أبو عبد الله عبيد الله بن محمد بن بطة العكبري الحنبلي",
      "أبو عبد الله عبيد الله بن محمد بن محمد بن حمدان العُكْبَري المعروف بابن بَطَّة العكبري",
      "أبو عبدالله عبيدالله بن محمد بن بطة العكبري الحنبلي",
      "العكبري، ابن بطة",
      "الواحدي",
      "أبو عبد الله عبيد الله بن محمد بن محمد بن حمدان العُكْبَري المعروف بابن بَطَّة العكبري (المتوفى : 387هـ)",
      "أبو عبد الله عبيد الله بن محمد بن محمد بن حمدان العكبري المعروف بابن بطة العكبري (المتوفى: 387هـ)",
      "عبيد الله بن محمد بن بطة العكبري العقبلي",
      "أبو عبد الله عبيد الله بن محمد بن محمد بن حمدان العكبري المعروف بابن بطة العكبري (المتوفى : 387هـ)",
      "ابن بطة العكبري"
    ],
    "variations": [
      "أبو عبد الله عبيد الله بن محمد بن محمد بن حمدان العكبري المعروف بابن بطة العكبري"
    ]
  },
  {
    "names": [
      "الشابشتي",
      "Shabushti",
      "al-Shābushtī",
      "أبو الحسن علي بن محمد ، المعروف بالشابشتي (المتوفى : 388هـ)",
      "أبو الحسن علي بن محمد، المعروف بالشابشتي (المتوفى: 388هـ)"
    ],
    "variations": [
      "al-Shabushti"
    ]
  },
  {
    "names": [
      "المقدسي، البشاري",
      "al-Maqdisī, al-Baššārī",
      "أبو عبد الله محمد بن أحمد",
      "Muqaddasi",
      "Abū ʿAbd Allāh Muḥammad b. Aḥmad"
    ],
    "variations": [
      "al-Maqdisi, al-Bassari",
      "Maqdisi, Bassari",
      "Abu ʿAbd Allah Muhammad b. Ahmad"
    ]
  },
  {
    "names": [
      "أبو طاهر المخلص",
      "Abū Ṭāhir al-Muḫalliṣ",
      "أبو طاهر محمد بن عبد الرحمن بن العباس البغدادي، الذهبي",
      "Abu Tahir Mukhallis",
      "Abū Ṭāhir Muḥammad b. ʿAbd al-Raḥmãn b. al-ʿAbbās al-Baġdādī, al-Ḏahabī"
    ],
    "variations": [
      "Abu Tahir al-Muhallis",
      "Abu Tahir Muhallis",
      "Abu Tahir Muhammad b. ʿAbd al-Rahman b. al-ʿAbbas al-Bagdadi, al-Dahabi",
      "Abu Tahir Muhammad b. ʿAbd Rahman b. ʿAbbas Bagdadi, Dahabi"
    ]
  },
  {
    "names": [
      "ابن الجزار",
      "Ibn al-Ǧazzār",
      "أبو جعفر أحمد بن ابراهيم بن أبي خالد القيرواني",
      "Ibn Jazzar",
      "Abū Ǧaʿfar Aḥmad b. Ibrāhīm b. Abī Ḫālid al-Qayrawānī"
    ],
    "variations": [
      "Ibn al-Gazzar",
      "Ibn Gazzar",
      "Abu Gaʿfar Ahmad b. Ibrahim b. Abi Halid al-Qayrawani",
      "Abu Gaʿfar Ahmad b. Ibrahim b. Abi Halid Qayrawani"
    ]
  },
  {
    "names": [
      "ابن زرع",
      "Ibn Zurʿa",
      "أبو علي عيسى بن اسحاق بن زرعة",
      "Ibn Zurca",
      "Abū ʿAlī ʿĪsá b. Isḥāq b. Zurʿaŧ"
    ],
    "variations": [
      "Abu ʿAli ʿIsa b. Ishaq b. Zurʿat"
    ]
  },
  {
    "names": [
      "مسلمة المجريطي",
      "Maslamaŧ al-Majrīṭī",
      "أبو القاسم مسلمة بن أحمد بن قاسم المجريطي، الفر=دي، القرطبي، الأندلسي",
      "Maslama Majriti",
      "Abū al-Qāsim Maslamaŧ b. Aḥmad b. Qāsim al-Majrīṭī, al-Fara=dī, al-Qurṭubī, al-Andalusī"
    ],
    "variations": [
      "Maslamat al-Majriti",
      "Maslamat Majriti",
      "Abu al-Qasim Maslamat b. Ahmad b. Qasim al-Majriti, al-Fara=di, al-Qurtubi, al-Andalusi",
      "Abu Qasim Maslamat b. Ahmad b. Qasim Majriti, Fara=di, Qurtubi, Andalusi"
    ]
  },
  {
    "names": [
      "أبو بكر البققال ابن الطلاية",
      "Abū Bakr al-Baqqāl Ibn al-Ṭalāyaŧ",
      "أبو بكر أحمد بن أبي غالب بن الطلاية البققال، الوراق",
      "Abu Bakr Baqqal",
      "Abū Bakr Aḥmad b. Abī Ġālib b. al-Ṭalāyaŧ al-Baqqāl, al-Warrāq"
    ],
    "variations": [
      "Abu Bakr al-Baqqal Ibn al-Talayat",
      "Abu Bakr Baqqal Ibn Talayat",
      "Abu Bakr Ahmad b. Abi Galib b. al-Talayat al-Baqqal, al-Warraq",
      "Abu Bakr Ahmad b. Abi Galib b. Talayat Baqqal, Warraq"
    ]
  },
  {
    "names": [
      "أبو القاسم الزهراوي",
      "Abū al-Qāsim al-Zahrāwī",
      "أبو القاسم خلف الزهراوي",
      "Abu Qasim Zahrawi",
      "Abū al-Qāsim Ḫalaf al-Zahrāwī"
    ],
    "variations": [
      "Abu al-Qasim al-Zahrawi",
      "Abu al-Qasim Halaf al-Zahrawi",
      "Abu Qasim Halaf Zahrawi"
    ]
  },
  {
    "names": [
      "(مترجم مجهول)",
      "(mutarjim majhūl)",
      "",
      "Anon Translator",
      ""
    ],
    "variations": [
      "(mutarjim majhul)"
    ]
  },
  {
    "names": [
      "عبيد الله بن حسان",
      "ʿUbayd Allãh b. Ḥassān",
      "بن حسان عبيد الله",
      "Cubayd Allah Ibn Hassan",
      "b. Ḥassān ʿUbayd Allãh"
    ],
    "variations": [
      "ʿUbayd Allah b. Hassan",
      "b. Hassan ʿUbayd Allah"
    ]
  },
  {
    "names": [
      "أبو نصر الفرابي",
      "Abū Naṣr al-Farābī",
      "Pseudo Farabi"
    ],
    "variations": [
      "Abu Nasr al-Farabi",
      "Abu Nasr Farabi"
    ]
  },
  {
    "names": [
      "أبي بكر محمّد بن الطيّب الباقلّاني",
      "Abu Bakr Baqillani",
      "أبو بكر الباقلاني محمد بن الطيب (المتوفى: 403هـ)",
      "أبو بكر محمد بن الطيب الباقلاني",
      "الباقلاني",
      "محمد بن الطيب بن محمد بن جعفر بن القاسم، القاضي أبو بكر الباقلاني المالكي",
      "الإمام الباقلاني",
      "أبو بكر الباقلاني",
      "الدارقطني",
      "أبو الحسن علي بن عمر بن أحمد بن مهدي بن مسعود بن النعمان بن دينار البغدادي الدارقطني (المتوفى : 385هـ)",
      "محمد بن الطيب بن محمد بن جعفر بن القاسم، القاضي أبو بكر الباقلاني المالكي (المتوفى: 403هـ)",
      "محمد بن الطيب الباقلاني",
      "محمد بن الطيب بن محمد بن جعفر بن القاسم، القاضي أبو بكر الباقلاني المالكي (المتوفى: 403 ه)"
    ],
    "variations": [
      "أبي بكر محمد بن الطيب الباقلاني"
    ]
  },
  {
    "names": [
      "ابن الفرضي",
      "Ibn al-Faraḍī",
      "أبو الوليد عبد الله بن محمد بن يوسف بن نصر الأزدي",
      "Ibn Faradi",
      "Abū al-Walīd ʿAbd Al-lãh b. Muḥammad b. Yūsuf b. Naṣr al-Azdī"
    ],
    "variations": [
      "Ibn al-Faradi",
      "Abu al-Walid ʿAbd Al-lah b. Muhammad b. Yusuf b. Nasr al-Azdi",
      "Abu Walid ʿAbd lah b. Muhammad b. Yusuf b. Nasr Azdi"
    ]
  },
  {
    "names": [
      "الحاكم",
      "al-Ḥākim",
      "أبو عبد الله محمد بن عبد الله بن محمد الضبي الطمهاني النيسابوري",
      "Hakim Naysaburi",
      "Abū ʿAbd Al-lãh Muḥammad b. ʿAbd Al-lãh b. Muḥammad al-Ḍabbī al-Ṭamhānī al-Naysābūrī"
    ],
    "variations": [
      "al-Hakim",
      "Hakim",
      "Abu ʿAbd Al-lah Muhammad b. ʿAbd Al-lah b. Muhammad al-Dabbi al-Tamhani al-Naysaburi",
      "Abu ʿAbd lah Muhammad b. ʿAbd lah b. Muhammad Dabbi Tamhani Naysaburi"
    ]
  },
  {
    "names": [
      "الشريف الرضي",
      "al-Šarīf al-Raḍī",
      "أبو الحسن محمد بن الحسين بن موسى",
      "Sharif Radi",
      "Abū al-Ḥasan Muḥammad b. al-Ḥusayn b. Mūsá"
    ],
    "variations": [
      "al-Sarif al-Radi",
      "Sarif Radi",
      "Abu al-Hasan Muhammad b. al-Husayn b. Musa",
      "Abu Hasan Muhammad b. Husayn b. Musa"
    ]
  },
  {
    "names": [
      "الكرماني",
      "al-Kirmānī",
      "حميد الدين أحمد بن عبد الله الكرماني",
      "Hamid Din Kirmani",
      "Ḥamīd al-dīn Aḥmad b. ʿAbd Al-lãh al-Kirmānī"
    ],
    "variations": [
      "al-Kirmani",
      "Kirmani",
      "Hamid al-din Ahmad b. ʿAbd Al-lah al-Kirmani",
      "Hamid din Ahmad b. ʿAbd lah Kirmani"
    ]
  },
  {
    "names": [
      "أبو الفتح بن أبي الفوارس",
      "Abū al-Fatḥ b. Abī al-Fawāris",
      "Abu Fath Ibn Abi Fawaris"
    ],
    "variations": [
      "Abu al-Fath b. Abi al-Fawaris",
      "Abu Fath b. Abi Fawaris"
    ]
  },
  {
    "names": [
      "ابن أبي الفوارس",
      "Ibn Abī al-Fawāris",
      "أبو الفتح محمد بن أحمد بن أبي الفوارس",
      "Ibn Abi Fawaris",
      "Abū al-Fatḥ Muḥammad b. Aḥmad b. Abī al-Fawāris"
    ],
    "variations": [
      "Ibn Abi al-Fawaris",
      "Abu al-Fath Muhammad b. Ahmad b. Abi al-Fawaris",
      "Abu Fath Muhammad b. Ahmad b. Abi Fawaris"
    ]
  },
  {
    "names": [
      "السلمي",
      "al-Sulamī",
      "أبو عبد الرحمان محمد بن الحسين السلمي الأزدي النيسابوري",
      "Sulami",
      "Abū ʿAbd al-Raḥmān Muḥammad b. al-Ḥusayn al-Sulamī al-Azdī al-Naysābūrī"
    ],
    "variations": [
      "al-Sulami",
      "Abu ʿAbd al-Rahman Muhammad b. al-Husayn al-Sulami al-Azdi al-Naysaburi",
      "Abu ʿAbd Rahman Muhammad b. Husayn Sulami Azdi Naysaburi"
    ]
  },
  {
    "names": [
      "التوحيدي",
      "al-Tawḥīdī",
      "أبو حيان علي بن محمد بن عباس",
      "Abu Hayyan Tawhidi",
      "Abū Ḥayyān ʿAlī b. Muḥammad b. ʿAbbās"
    ],
    "variations": [
      "al-Tawhidi",
      "Tawhidi",
      "Abu Hayyan ʿAli b. Muhammad b. ʿAbbas"
    ]
  },
  {
    "names": [
      "القاضيعبد الجبار",
      "al-QāḍīʿAbd al-Ǧabbār",
      "أبو لحسن عبد الجبار بن أحمد بن عبد الجبار بن أحمد الخليل بن عبدالله المعتزلي الأسدابادي",
      "Qadi Cabd Jabbar",
      "Abū l-Ḥassan ʿAbd al-Ǧabbār b. Aḥmad b. ʿAbd al-Ǧabbār b. Aḥmad al-Ḫalīl b. ʿAbdallāh al-Muʿtazilī al-Asadābādī"
    ],
    "variations": [
      "al-QadiʿAbd al-Gabbar",
      "QadiʿAbd Gabbar",
      "Abu l-Hassan ʿAbd al-Gabbar b. Ahmad b. ʿAbd al-Gabbar b. Ahmad al-Halil b. ʿAbdallah al-Muʿtazili al-Asadabadi",
      "Abu l-Hassan ʿAbd Gabbar b. Ahmad b. ʿAbd Gabbar b. Ahmad Halil b. ʿAbdallah Muʿtazili Asadabadi"
    ]
  },
  {
    "names": [
      "أبو سعد الآبي",
      "Abū Saʿd al-Ābī",
      "الوزير ذو المعالي، زين الكفات أبو سعد، أبو سعيد منصور بن الحسين الآبي",
      "Abu Sacd Abi",
      "al-Wazīr Ḏū al-Maʿālī, Zayn al-Kufāt Abū Saʿd, Abū Saʿīd Manṣūr b. al-Ḥusayn al-Ābī"
    ],
    "variations": [
      "Abu Saʿd al-Abi",
      "Abu Saʿd Abi",
      "al-Wazir Du al-Maʿali, Zayn al-Kufat Abu Saʿd, Abu Saʿid Mansur b. al-Husayn al-Abi",
      "Wazir Du Maʿali, Zayn Kufat Abu Saʿd, Abu Saʿid Mansur b. Husayn Abi"
    ]
  },
  {
    "names": [
      "ابن سوار",
      "Ibn Suwār",
      "أبو الخير الحسن بن سوار بن بابا بن الخمار",
      "Hasan Ibn Suwar",
      "Abū al-Ḫayr al-Ḥasan b. Suwār b. Bābā b. al-Ḫammār"
    ],
    "variations": [
      "Ibn Suwar",
      "Abu al-Hayr al-Hasan b. Suwar b. Baba b. al-Hammar",
      "Abu Hayr Hasan b. Suwar b. Baba b. Hammar"
    ]
  },
  {
    "names": [
      "أبو علي مسكويه",
      "Miskawayh",
      "أبو علي مسكويه أحمد بن محمد بن يعقوب الرازي الأصبهاني",
      "أبو عليّ مسكويه",
      "Abū Ḥayyān al-Tawḥīdī",
      "Abū ʿAlī Miskawayh",
      "أبو حيّان التوحيديّ",
      "أبو علي أحمد بن محمد بن يعقوب مسكويه (المتوفى: 421هـ)",
      "أبو علي أحمد بن محمد بن مسكويه (المتوفى : 421هـ)",
      "ابن مسكويه"
    ],
    "variations": [
      "Abu Hayyan al-Tawhidi",
      "Abu Hayyan Tawhidi",
      "Abu ʿAli Miskawayh",
      "أبو حيان التوحيدي"
    ]
  },
  {
    "names": [
      "أبو اسحاق الثعلبي",
      "Abū Isḥāq al-Ṯaʿlabī",
      "أبو اسحاق الثعلبي النيسبوري أحمد بن محمد بن ابراهيم الثعلبي النيسبوري",
      "Abu Ishaq Thaclabi",
      "Abū Isḥāq al-Ṯaʿlabī al-Naysabūrī Aḥmad b. Muḥammad b. Ibrāhīm al-Ṯaʿlabī al-Naysabūrī"
    ],
    "variations": [
      "Abu Ishaq al-Taʿlabi",
      "Abu Ishaq Taʿlabi",
      "Abu Ishaq al-Taʿlabi al-Naysaburi Ahmad b. Muhammad b. Ibrahim al-Taʿlabi al-Naysaburi",
      "Abu Ishaq Taʿlabi Naysaburi Ahmad b. Muhammad b. Ibrahim Taʿlabi Naysaburi"
    ]
  },
  {
    "names": [
      "السهمي",
      "al-Sahmī",
      "أبو القاسم حمزة بن يوسف بن ابراهيم السهمي القرشي الجرجاني",
      "Sahmi",
      "Abū al-Qāsim Ḥamzaŧ b. Yūsuf b. Ibrāhīm al-Sahmī al-Qurašī al-Ǧurǧānī"
    ],
    "variations": [
      "al-Sahmi",
      "Abu al-Qasim Hamzat b. Yusuf b. Ibrahim al-Sahmi al-Qurasi al-Gurgani",
      "Abu Qasim Hamzat b. Yusuf b. Ibrahim Sahmi Qurasi Gurgani"
    ]
  },
  {
    "names": [
      "أبو عبيد الجوزجاني",
      "Abū ʿUbayd al-Ǧūzǧānī",
      "Abu Cubayd Juzjani"
    ],
    "variations": [
      "Abu ʿUbayd al-Guzgani",
      "Abu ʿUbayd Guzgani"
    ]
  },
  {
    "names": [
      "ابن سينا",
      "Ibn Sīnā",
      "أبو علي الحسين بن عبد الله بن سينا",
      "Ibn Sina",
      "Abū ʿAlī al-Ḥusayn b. ʿAbd Al-lãh b. Sīnā"
    ],
    "variations": [
      "Abu ʿAli al-Husayn b. ʿAbd Al-lah b. Sina",
      "Abu ʿAli Husayn b. ʿAbd lah b. Sina"
    ]
  },
  {
    "names": [
      "الثعالبي",
      "al-Ṯaʿālibī",
      "أبو منصور عبد الملك بن محمد بن اسماعيل الثعالبي",
      "Abu Mansur Thacalibi",
      "Abū Manṣūr ʿAbd al-Malik b. Muḥammad b. Ismāʿīl al-Ṯaʿālibī"
    ],
    "variations": [
      "al-Taʿalibi",
      "Taʿalibi",
      "Abu Mansur ʿAbd al-Malik b. Muhammad b. Ismaʿil al-Taʿalibi",
      "Abu Mansur ʿAbd Malik b. Muhammad b. Ismaʿil Taʿalibi"
    ]
  },
  {
    "names": [
      "الاصبهاني",
      "al-Iṣbahānī",
      "أبو نعيم أحمد بن عبد الله بن اسحاق بن موسى بن مهران الشافعي، الاصبهاني",
      "Abu Nucaym Isbahani",
      "Abū Nuʿaym Aḥmad b. ʿAbd Al-lãh b. Isḥāq b. Mūsá b. Mihrān al-Šāfiʿī, al-Iṣbahānī"
    ],
    "variations": [
      "al-Isbahani",
      "Isbahani",
      "Abu Nuʿaym Ahmad b. ʿAbd Al-lah b. Ishaq b. Musa b. Mihran al-Safiʿi, al-Isbahani",
      "Abu Nuʿaym Ahmad b. ʿAbd lah b. Ishaq b. Musa b. Mihran Safiʿi, Isbahani"
    ]
  },
  {
    "names": [
      "ابن بشران",
      "Ibn Bišrān",
      "أبو الحسين علي بن محمد بن عبد الله بن بشران",
      "Cabd Malik Ibn Bishran Umawi",
      "Abū al-Ḥusayn ʿAlī b. Muḥammad b. ʿAbd Allāh b. Bišrān"
    ],
    "variations": [
      "Ibn Bisran",
      "Abu al-Husayn ʿAli b. Muhammad b. ʿAbd Allah b. Bisran",
      "Abu Husayn ʿAli b. Muhammad b. ʿAbd Allah b. Bisran"
    ]
  },
  {
    "names": [
      "ابن الهيثم",
      "Ibn al-Hayṯam",
      "الحسن بن الحسن بن الهيثم",
      "Ibn Haytham",
      "al-Ḥasan b. al-Ḥasan b. al-Hayṯam"
    ],
    "variations": [
      "Ibn al-Haytam",
      "Ibn Haytam",
      "al-Hasan b. al-Hasan b. al-Haytam",
      "Hasan b. Hasan b. Haytam"
    ]
  },
  {
    "names": [
      "مكي بن حموش القيسي",
      "Makkī b. Ḥammūš al-Qaysī",
      "أبو محمد مكي بن أبي طالب حموش بن محمد بن مختار القيسي، القيرواني، الأندلسي، القرطبي، ال مالكي",
      "Makki Ibn Hammush Qaysi",
      "Abū Muḥammad Makkī b. Abī Ṭālib Ḥammūš b. Muḥammad b. Muḫtār al-Qaysī, al-Qayrawānī, al-Andalusī, al-Qurṭubī, al- Mālikī"
    ],
    "variations": [
      "Makki b. Hammus al-Qaysi",
      "Makki b. Hammus Qaysi",
      "Abu Muhammad Makki b. Abi Talib Hammus b. Muhammad b. Muhtar al-Qaysi, al-Qayrawani, al-Andalusi, al-Qurtubi, al- Maliki",
      "Abu Muhammad Makki b. Abi Talib Hammus b. Muhammad b. Muhtar Qaysi, Qayrawani, Andalusi, Qurtubi,  Maliki"
    ]
  },
  {
    "names": [
      "التنوخي",
      "al-Tanūḫī",
      "أبو المحاسن المفضل بن محمد بن مسعر التنوخي المعري",
      "Tanukhi",
      "Abū al-Maḥāsin al-Mufaḍḍal b. Muḥammad b. Misʿar al-Tanūḫī al-Maʿarrī"
    ],
    "variations": [
      "al-Tanuhi",
      "Tanuhi",
      "Abu al-Mahasin al-Mufaddal b. Muhammad b. Misʿar al-Tanuhi al-Maʿarri",
      "Abu Mahasin Mufaddal b. Muhammad b. Misʿar Tanuhi Maʿarri"
    ]
  },
  {
    "names": [
      "گرديزي",
      "Gardīzī",
      "أبو سعيد عبد الحي بن الضحاك بن محمود الگرديزي / الجرديزي",
      "Abu Sacid Gardizi",
      "Abū Saʿīd ʿAbd al-Ḥayy b. al-Ḍaḥḥāk b. Maḥmūd al-Gardīzī / al-Ǧardīzī"
    ],
    "variations": [
      "Gardizi",
      "Abu Saʿid ʿAbd al-Hayy b. al-Dahhak b. Mahmud al-Gardizi / al-Gardizi",
      "Abu Saʿid ʿAbd Hayy b. Dahhak b. Mahmud Gardizi / Gardizi"
    ]
  },
  {
    "names": [
      "الخليلي",
      "al-Ḫalīlī",
      "أبو يعلى الخليل بن عبد الله بن أحمد بن الخليل الخليلي القزويني",
      "Abu Yacla Khalili",
      "Abū Yaʿlá al-Ḫalīl b. ʿAbd Al-lãh b. Aḥmad b. al-Ḫalīl al-Ḫalīlī al-Qazwīnī"
    ],
    "variations": [
      "al-Halili",
      "Halili",
      "Abu Yaʿla al-Halil b. ʿAbd Al-lah b. Ahmad b. al-Halil al-Halili al-Qazwini",
      "Abu Yaʿla Halil b. ʿAbd lah b. Ahmad b. Halil Halili Qazwini"
    ]
  },
  {
    "names": [
      "هلال الصابئ",
      "Hilāl al-Ṣābiʾ",
      "أبو الحسين هلال بن محسن بن ابراهيم الصابئ",
      "Hilal Sabi",
      "Abū al-Ḥusayn Hilāl b. Muḥassin b. Ibrāhīm al-Ṣābiʾ"
    ],
    "variations": [
      "Hilal al-Sabiʾ",
      "Hilal Sabiʾ",
      "Abu al-Husayn Hilal b. Muhassin b. Ibrahim al-Sabiʾ",
      "Abu Husayn Hilal b. Muhassin b. Ibrahim Sabiʾ"
    ]
  },
  {
    "names": [
      "الماوردي",
      "al-Māwardī",
      "أبو الحسن علي بن محمد بن حبيب البصري، البغدادي",
      "Abu Hasan Mawardi",
      "Abū al-Ḥasan ʿAlī b. Muḥammad b. Ḥabīb al-Baṣrī, al-Baġdādī"
    ],
    "variations": [
      "al-Mawardi",
      "Mawardi",
      "Abu al-Hasan ʿAli b. Muhammad b. Habib al-Basri, al-Bagdadi",
      "Abu Hasan ʿAli b. Muhammad b. Habib Basri, Bagdadi"
    ]
  },
  {
    "names": [
      "مؤلف مجهول",
      "Muʾallif maǧhūl",
      "",
      "Anonymous",
      ""
    ],
    "variations": [
      "Muʾallif maghul"
    ]
  },
  {
    "names": [
      "علي بن بلال",
      "ʿAlī b. Bilāl",
      "علي بن بلال الآملي الزيدي",
      "Cali Ibn Bilal",
      "ʿAlī b. Bilāl al-Āmulī al-Zaydī"
    ],
    "variations": [
      "ʿAli b. Bilal",
      "ʿAli b. Bilal al-Amuli al-Zaydi",
      "ʿAli b. Bilal Amuli Zaydi"
    ]
  },
  {
    "names": [
      "الفضل ابن مفرج",
      "al-Faḍl Ibn Mufarraǧ",
      "الفضل بن مفرج",
      "Fadl Ibn Mufarraj",
      "al-Faḍl b. Mufarraǧ"
    ],
    "variations": [
      "al-Fadl Ibn Mufarrag",
      "Fadl Ibn Mufarrag",
      "al-Fadl b. Mufarrag",
      "Fadl b. Mufarrag"
    ]
  },
  {
    "names": [
      "النجاشي",
      "al-Naǧāšī",
      "أبو العباس أحمد بن علي بن أحمد بن عباس الأسدي الكوفي",
      "Najashi",
      "Abū al-ʿAbbās Aḥmad b. ʿAlī b. Aḥmad b. ʿAbbās al-Asadī al-Kūfī"
    ],
    "variations": [
      "al-Nagasi",
      "Nagasi",
      "Abu al-ʿAbbas Ahmad b. ʿAli b. Ahmad b. ʿAbbas al-Asadi al-Kufi",
      "Abu ʿAbbas Ahmad b. ʿAli b. Ahmad b. ʿAbbas Asadi Kufi"
    ]
  },
  {
    "names": [
      "عبد الله ابن اللباد",
      "ʿAbd Allāh Ibn al-Labbād",
      "عبد الله بن سعيد",
      "Qadi Labbad",
      "ʿAbd Allāh b. Saʿīd"
    ],
    "variations": [
      "ʿAbd Allah Ibn al-Labbad",
      "ʿAbd Allah Ibn Labbad",
      "ʿAbd Allah b. Saʿid"
    ]
  },
  {
    "names": [
      "علي ابن رضوان",
      "Cali Ibn Ridwan",
      "Ibn Riḍwān"
    ],
    "variations": [
      "Ibn Ridwan"
    ]
  },
  {
    "names": [
      "أبو عبد الله محمد بن سلامة بن جعفر بن علي بن حكمون القضاعي المصري",
      "Qudaci",
      "أبو عبد الله محمد بن سلامة بن جعفر بن علي بن حكمون القضاعي المصري (المتوفى: 454ه)",
      "القضاعي",
      "ابن سلامة",
      "Al-Qādī Muḥammad ibn Salāmah al-Quḍāʿī",
      "القاضي محمّد بن سلامة القضاعي",
      "أبو عبد الله محمد بن سلامة بن جعفر بن علي بن حكمون القضاعي المصري (المتوفى: 454هـ)",
      "محمد بن سلامة بن جعفر أبو عبد الله القضاعي"
    ],
    "variations": [
      "Al-Qadi Muhammad ibn Salamah al-Qudaʿi",
      "Qadi Muhammad ibn Salamah Qudaʿi",
      "القاضي محمد بن سلامة القضاعي"
    ]
  },
  {
    "names": [
      "ابن حزم",
      "Ibn Ḥazm",
      "أبو محمد علي بن أحمد بن سعيد بن حزم الأندلسي، القرطبي، الظاهري",
      "Ibn Hazm",
      "Abū Muḥammad ʿAlī b. Aḥmad b. Saʿīd b. Ḥazm al-Andalusī, al-Qurṭubī, al-Ẓāhirī"
    ],
    "variations": [
      "Abu Muhammad ʿAli b. Ahmad b. Saʿid b. Hazm al-Andalusi, al-Qurtubi, al-Zahiri",
      "Abu Muhammad ʿAli b. Ahmad b. Saʿid b. Hazm Andalusi, Qurtubi, Zahiri"
    ]
  },
  {
    "names": [
      "ابن الفراء",
      "Ibn al-Farrāʾ",
      "أبو يعلى محمد بن الحسين بن محمد بن خلف بن الفراء الحنبلي",
      "Abu Yacla Ibn Farra",
      "Abū Yaʿlá Muḥammad b. al-Ḥusayn b. Muḥammad b. Ḫalaf b. al-Farrāʾ al-Ḥanbalī"
    ],
    "variations": [
      "Ibn al-Farraʾ",
      "Ibn Farraʾ",
      "Abu Yaʿla Muhammad b. al-Husayn b. Muhammad b. Halaf b. al-Farraʾ al-Hanbali",
      "Abu Yaʿla Muhammad b. Husayn b. Muhammad b. Halaf b. Farraʾ Hanbali"
    ]
  },
  {
    "names": [
      "البيهقي",
      "al-Bayhaqī",
      "أبوبكر أحمد بن الحسين بن علي بن موسى البيهقي، الخسروجردي",
      "Bayhaqi",
      "Abū-Bakr Aḥmad b. al-Ḥusayn b. ʿAlī b. Mūsá al-Bayhaqī, al-Ḫusrawǧirdī"
    ],
    "variations": [
      "al-Bayhaqi",
      "Abu-Bakr Ahmad b. al-Husayn b. ʿAli b. Musa al-Bayhaqi, al-Husrawgirdi",
      "Abu-Bakr Ahmad b. Husayn b. ʿAli b. Musa Bayhaqi, Husrawgirdi"
    ]
  },
  {
    "names": [
      "الشيخ الطوسي",
      "al-Šayḫ al-Ṭūsī",
      "أبو جعفر محمد بن الحسن بن علي الطوسي",
      "Shaykh Tusi",
      "Abū Ǧaʿfar Muḥammad b. al-Ḥasan b. ʿAlī al-Ṭūsī"
    ],
    "variations": [
      "al-Sayh al-Tusi",
      "Sayh Tusi",
      "Abu Gaʿfar Muhammad b. al-Hasan b. ʿAli al-Tusi",
      "Abu Gaʿfar Muhammad b. Hasan b. ʿAli Tusi"
    ]
  },
  {
    "names": [
      "أبو الحسين الفارسي",
      "Abū al-Ḥusayn al-Fārisī",
      "أبو الحسين نصر بن عبد العزيز الفارسي",
      "Abu Husayn Farisi",
      "Abū al-Ḥusayn Naṣr b. ʿAbd al-ʿAzīz al-Fārisī"
    ],
    "variations": [
      "Abu al-Husayn al-Farisi",
      "Abu al-Husayn Nasr b. ʿAbd al-ʿAziz al-Farisi",
      "Abu Husayn Nasr b. ʿAbd ʿAziz Farisi"
    ]
  },
  {
    "names": [
      "أبو زكريا البخاري",
      "Abū Zakariyā al-Buḫārī",
      "أبو زكريا عبد الرحيم بن أحمد بن نصر البخاري",
      "Abu Zakariya Bukhari",
      "Abū Zakariyā ʿAbd al-Raḥīm b. Aḥmad b. Naṣr al-Buḫārī"
    ],
    "variations": [
      "Abu Zakariya al-Buhari",
      "Abu Zakariya Buhari",
      "Abu Zakariya ʿAbd al-Rahim b. Ahmad b. Nasr al-Buhari",
      "Abu Zakariya ʿAbd Rahim b. Ahmad b. Nasr Buhari"
    ]
  },
  {
    "names": [
      "ابن عبد البر",
      "Ibn ʿAbd al-Barr",
      "أبو عمر يوسف بن عبد الله بن محمد بن عبد البر القرطبي النمري",
      "Ibn Cabd Barr",
      "Abū ʿUmar Yūsuf b. ʿAbd Allāh b. Muḥammad b. ʿAbd al-Barr al-Qurṭubī al-Namarī"
    ],
    "variations": [
      "Ibn ʿAbd Barr",
      "Abu ʿUmar Yusuf b. ʿAbd Allah b. Muhammad b. ʿAbd al-Barr al-Qurtubi al-Namari",
      "Abu ʿUmar Yusuf b. ʿAbd Allah b. Muhammad b. ʿAbd Barr Qurtubi Namari"
    ]
  },
  {
    "names": [
      "الخطيب البغدادي",
      "al-Ḫaṭīb al-Baġdādī",
      "أبو بكر أحمد بن علي بن ثابت بن أحمد بن مهدي الشافعي، البغدادي",
      "Khatib Baghdadi",
      "Abū Bakr Aḥmad b. ʿAlī b. Ṯābit b. Aḥmad b. Mahdī al-Šāfiʿī, al-Baġdādī"
    ],
    "variations": [
      "al-Hatib al-Bagdadi",
      "Hatib Bagdadi",
      "Abu Bakr Ahmad b. ʿAli b. Tabit b. Ahmad b. Mahdi al-Safiʿi, al-Bagdadi",
      "Abu Bakr Ahmad b. ʿAli b. Tabit b. Ahmad b. Mahdi Safiʿi, Bagdadi"
    ]
  },
  {
    "names": [
      "أبو بكر المالكي",
      "Abū Bakr al-Mālikī",
      "أبو بكر عبدالله بن محمد بن عبدالله بن أبي عبدالله محمد بن عبدالله القرشي القيرواني المالكي",
      "Abu Bakr Maliki",
      "Abū Bakr ʿAbdallāh b. Muḥammad b. ʿAbdallāh b. Abī ʿAbdallāh Muḥammad b. ʿAbdallāh al-Qurašī al-Qayrawānī al-Mālikī"
    ],
    "variations": [
      "Abu Bakr al-Maliki",
      "Abu Bakr ʿAbdallah b. Muhammad b. ʿAbdallah b. Abi ʿAbdallah Muhammad b. ʿAbdallah al-Qurasi al-Qayrawani al-Maliki",
      "Abu Bakr ʿAbdallah b. Muhammad b. ʿAbdallah b. Abi ʿAbdallah Muhammad b. ʿAbdallah Qurasi Qayrawani Maliki"
    ]
  },
  {
    "names": [
      "عبد الله الخفاجي",
      "Ibn Sinan Khafaji",
      "ابن سنان الخفاجي",
      "أبو محمد عبد الله بن محمد بن سعيد بن سنان الخفاجي الحلبي",
      "ابو محمد عبد الله بن محمد بن سعيد بن يحيى بن الحسين بن محمود بن الربيع المعروف بابن سنان الخفاجي الحلبي",
      "أبو محمد عبد الله بن محمد بن سعيد بن سنان الخفاجي الحلبي (المتوفى: 466هـ)",
      "الأمير أبي محمد عبد الله بن محمد بن سعيد بن سنان الخفاجي الحلبي",
      "أبي محمّد عبد الله بن سعيد بن سنان الخفاجي الحلبي"
    ],
    "variations": [
      "أبي محمد عبد الله بن سعيد بن سنان الخفاجي الحلبي"
    ]
  },
  {
    "names": [
      "ابن خلف الباجي",
      "Ibn Ḫalaf al-Bāǧī",
      "أبو الوليد سليمان بن خلف بن سعد بن أيوب بن وارث تجيبي القرطبي الباجي الأندلسي",
      "Ibn Khalaf Baji",
      "Abū al-Walīd Sulaymān b. Ḫalaf b. Saʿd b. Ayyūb b. Wāriṯ Taǧībī al-Qurṭubī al-Bāǧī al-Andalusī"
    ],
    "variations": [
      "Ibn Halaf al-Bagi",
      "Ibn Halaf Bagi",
      "Abu al-Walid Sulayman b. Halaf b. Saʿd b. Ayyub b. Warit Tagibi al-Qurtubi al-Bagi al-Andalusi",
      "Abu Walid Sulayman b. Halaf b. Saʿd b. Ayyub b. Warit Tagibi Qurtubi Bagi Andalusi"
    ]
  },
  {
    "names": [
      "سهل ابن فضل التستري",
      "Sahl Ibn Faḍl al-Tustarī",
      "سهل بن فضل التستري",
      "Sahl Ibn Fadl Tustari",
      "Sahl b. Faḍl al-Tustarī"
    ],
    "variations": [
      "Sahl Ibn Fadl al-Tustari",
      "Sahl b. Fadl al-Tustari",
      "Sahl b. Fadl Tustari"
    ]
  },
  {
    "names": [
      "الشيرازي",
      "al-Šīrāzī",
      "أبو اسحاق ابراهيم بن علي بن يوسف الشافعي الفيروزابادي",
      "Abu Ishaq Shirazi",
      "Abū Isḥāq Ibrāhīm b. ʿAlī b. Yūsuf al-Šāfiʿī al-Fīrūzābādī"
    ],
    "variations": [
      "al-Sirazi",
      "Sirazi",
      "Abu Ishaq Ibrahim b. ʿAli b. Yusuf al-Safiʿi al-Firuzabadi",
      "Abu Ishaq Ibrahim b. ʿAli b. Yusuf Safiʿi Firuzabadi"
    ]
  },
  {
    "names": [
      "العذري",
      "al-ʿUḏrī",
      "أبو العباس أحمد بن عمر بن أنس العذري الدلئي",
      "Cudhri",
      "Abū al-ʿAbbās Aḥmad b. ʿUmar b. Anas al-ʿUḏrī al-Dalaʾī"
    ],
    "variations": [
      "al-ʿUdri",
      "ʿUdri",
      "Abu al-ʿAbbas Ahmad b. ʿUmar b. Anas al-ʿUdri al-Dalaʾi",
      "Abu ʿAbbas Ahmad b. ʿUmar b. Anas ʿUdri Dalaʾi"
    ]
  },
  {
    "names": [
      "أبو اسماعيل الهروي",
      "Abū Ismāʿīl al-Harawī",
      "أبو اسماعيل عبد اللاه بن محمد بن علي بن محمد بن أحمد بن علي بن جعفر بن منصور الأنصاري الهروي",
      "Ansari Harawi",
      "Abū Ismāʿīl ʿAbd al-Lāh b. Muḥammad b. ʿAlī b. Muḥammad b. Aḥmad b. ʿAlī b. Ǧaʿfar b. Manṣūr al-Anṣārī al-Harawī"
    ],
    "variations": [
      "Abu Ismaʿil al-Harawi",
      "Abu Ismaʿil Harawi",
      "Abu Ismaʿil ʿAbd al-Lah b. Muhammad b. ʿAli b. Muhammad b. Ahmad b. ʿAli b. Gaʿfar b. Mansur al-Ansari al-Harawi",
      "Abu Ismaʿil ʿAbd Lah b. Muhammad b. ʿAli b. Muhammad b. Ahmad b. ʿAli b. Gaʿfar b. Mansur Ansari Harawi"
    ]
  },
  {
    "names": [
      "الهبال",
      "al-Habbāl",
      "الحافظ أبو اسحاق ابراهيم بن سعيد بن عبد الله",
      "Abu Ishaq Habbal",
      "al-Ḥāfiẓ Abū Isḥāq Ibrāhīm b. Saʿīd b. ʿAbd Al-lãh"
    ],
    "variations": [
      "al-Habbal",
      "Habbal",
      "al-Hafiz Abu Ishaq Ibrahim b. Saʿid b. ʿAbd Al-lah",
      "Hafiz Abu Ishaq Ibrahim b. Saʿid b. ʿAbd lah"
    ]
  },
  {
    "names": [
      "أبو عبيد البكري",
      "Abū ʿUbayd al-Bakrī",
      "أبو عبيد عبد الله بن عبد العزيز بن محمد بن أيوب بن عمرو البكري",
      "Abu Cubayd Bakri",
      "Abū ʿUbayd ʿAbd Allāh b. ʿAbd al-ʿAzīz b. Muḥammad b. Ayyūb b. ʿAmrů al-Bakrī"
    ],
    "variations": [
      "Abu ʿUbayd al-Bakri",
      "Abu ʿUbayd Bakri",
      "Abu ʿUbayd ʿAbd Allah b. ʿAbd al-ʿAziz b. Muhammad b. Ayyub b. ʿAmru al-Bakri",
      "Abu ʿUbayd ʿAbd Allah b. ʿAbd ʿAziz b. Muhammad b. Ayyub b. ʿAmru Bakri"
    ]
  },
  {
    "names": [
      "ظهير الدين الروذرواري",
      "Ẓahīr al-Dīn al-Rūḏrawārī",
      "ظهير الدين أبو شجاع محمد بن الحسين الروذرواري",
      "Zahir Din",
      "Ẓahīr al-dīn Abū Šuǧāʿ Muḥammad b. al-Ḥusayn al-Rūḏrawārī"
    ],
    "variations": [
      "Zahir al-Din al-Rudrawari",
      "Zahir Din Rudrawari",
      "Zahir al-din Abu Sugaʿ Muhammad b. al-Husayn al-Rudrawari",
      "Zahir din Abu Sugaʿ Muhammad b. Husayn Rudrawari"
    ]
  },
  {
    "names": [
      "ابن بصال",
      "Ibn Baṣṣāl",
      "أبو عبد الله محمد بن ابراهيم الأندلسي الطليطلي",
      "Ibn Bassal",
      "Abū ʿAbd Al-lãh Muḥammad b. Ibrāhīm al-Andalusī al-Ṭulayṭulī"
    ],
    "variations": [
      "Abu ʿAbd Al-lah Muhammad b. Ibrahim al-Andalusi al-Tulaytuli",
      "Abu ʿAbd lah Muhammad b. Ibrahim Andalusi Tulaytuli"
    ]
  },
  {
    "names": [
      "مؤلف مجهول",
      "Muʾallif maǧhūl",
      "Anonymous"
    ],
    "variations": [
      "Muʾallif maghul"
    ]
  },
  {
    "names": [
      "السنجاري، الشجري",
      "al-Sinǧārī, al-Šaǧarī",
      "أبو الحسين السنجاري، الشجري",
      "Sinjari",
      "Abū al-Ḥusayn al-Sinǧārī, al-Šaǧarī"
    ],
    "variations": [
      "al-Singari, al-Sagari",
      "Singari, Sagari",
      "Abu al-Husayn al-Singari, al-Sagari",
      "Abu Husayn Singari, Sagari"
    ]
  },
  {
    "names": [
      "الغزالي",
      "al-Ġazālī",
      "زين الدين أبو حامد محمد بن محمد بن محمد بن أحمد الغزالي الطوسي النيسابوري",
      "Ghazali",
      "Zayn al-Dīn Abū Ḥāmid Muḥammad b. Muḥammad b. Muḥammad b. Aḥmad al-Ġazālī al-Ṭūsī al-Nīsābūrī"
    ],
    "variations": [
      "al-Gazali",
      "Gazali",
      "Zayn al-Din Abu Hamid Muhammad b. Muhammad b. Muhammad b. Ahmad al-Gazali al-Tusi al-Nisaburi",
      "Zayn Din Abu Hamid Muhammad b. Muhammad b. Muhammad b. Ahmad Gazali Tusi Nisaburi"
    ]
  },
  {
    "names": [
      "الشاشي",
      "al-Šāšī",
      "فخر الإسلام أبو بكر محمد بن أحمد بن حسين بن عمر الشاشي",
      "Abu Bakr Shashi",
      "Faḫr al-ʾIslām Abū Bakr Muḥammad b. Aḥmad b. Ḥusayn b. ʿUmar al-Šāšī"
    ],
    "variations": [
      "al-Sasi",
      "Sasi",
      "Fahr al-ʾIslam Abu Bakr Muhammad b. Ahmad b. Husayn b. ʿUmar al-Sasi",
      "Fahr ʾIslam Abu Bakr Muhammad b. Ahmad b. Husayn b. ʿUmar Sasi"
    ]
  },
  {
    "names": [
      "العوتبي، الصحاري",
      "al-ʿAwtabī, al-Ṣuḥārī",
      "سلمة بن مسلم بن ابراهيم العوتبي الصحاري الأزدي",
      "Cawtabi Suhari",
      "Salamaŧ b. Muslim b. Ibrāhīm al-ʿAwtabī al-Ṣuḥārī al-Azdī"
    ],
    "variations": [
      "al-ʿAwtabi, al-Suhari",
      "ʿAwtabi, Suhari",
      "Salamat b. Muslim b. Ibrahim al-ʿAwtabi al-Suhari al-Azdi",
      "Salamat b. Muslim b. Ibrahim ʿAwtabi Suhari Azdi"
    ]
  },
  {
    "names": [
      "الطرطوشي، ابن أبي رندقة (oر رندقة)",
      "al-Ṭurṭūšī, Ibn Abī Randaqaŧ (or Rundaqaŧ)",
      "أبو بكر محمد بن الوليد بن محمد بن خلف بن سليمان بن أيوب القرشي، الفهري، المالكي، الطرطوشي، الأندلوسي",
      "Ibn Walid Turtushi",
      "Abū Bakr Muḥammad b. al-Walīd b. Muḥammad b. Ḫalaf b. Sulaymān b. Ayyūb al-Qurašī, al-Fihrī, al-Mālikī, al-Ṭurṭūšī, al-Andalūsī"
    ],
    "variations": [
      "al-Turtusi, Ibn Abi Randaqat (or Rundaqat)",
      "Turtusi, Ibn Abi Randaqat (or Rundaqat)",
      "Abu Bakr Muhammad b. al-Walid b. Muhammad b. Halaf b. Sulayman b. Ayyub al-Qurasi, al-Fihri, al-Maliki, al-Turtusi, al-Andalusi",
      "Abu Bakr Muhammad b. Walid b. Muhammad b. Halaf b. Sulayman b. Ayyub Qurasi, Fihri, Maliki, Turtusi, Andalusi"
    ]
  },
  {
    "names": [
      "ابن الأكفاني",
      "Ibn al-Akfānī",
      "أبو محمد هبة الله بن أحمد بن محمد بن هبة الله بن علي الأنصاري الدمشقي",
      "Ibn Akfani",
      "Abū Muḥammad Hibaŧ Al-lãh b. Aḥmad b. Muḥammad b. Hibaŧ Al-lãh b. ʿAlī al-Anṣārī al-Dimašqī"
    ],
    "variations": [
      "Ibn al-Akfani",
      "Abu Muhammad Hibat Al-lah b. Ahmad b. Muhammad b. Hibat Al-lah b. ʿAli al-Ansari al-Dimasqi",
      "Abu Muhammad Hibat lah b. Ahmad b. Muhammad b. Hibat lah b. ʿAli Ansari Dimasqi"
    ]
  },
  {
    "names": [
      "ابن أبي يعلى",
      "Ibn Abī Yaʿlá",
      "أبو الحسين محمد بن محمد بن الحسين بن محمد بن خلف بن أحمد بن الفراء الفراء البغدادي الحنبلي",
      "Ibn Abi Yacla",
      "Abū al-Ḥusayn Muḥammad b. Muḥammad b. al-Ḥusayn b. Muḥammad b. Ḫalaf b. Aḥmad b. al-Farrāʾ al-Farrāʾ al-Baġdādī al-Ḥanbalī"
    ],
    "variations": [
      "Ibn Abi Yaʿla",
      "Abu al-Husayn Muhammad b. Muhammad b. al-Husayn b. Muhammad b. Halaf b. Ahmad b. al-Farraʾ al-Farraʾ al-Bagdadi al-Hanbali",
      "Abu Husayn Muhammad b. Muhammad b. Husayn b. Muhammad b. Halaf b. Ahmad b. Farraʾ Farraʾ Bagdadi Hanbali"
    ]
  },
  {
    "names": [
      "الخرقي",
      "al-Ḫaraqī",
      "أبو محمد عبد الجبار بن عبد الجبار بن محمد الثابتي الحسيني المروزي الخرقي",
      "Kharaqi",
      "Abū Muḥammad ʿAbd al-Ǧabbār b. ʿAbd al-Ǧabbār b. Muḥammad al-Ṯābitī al-Ḥusaynī al-Marwazī al-Ḫaraqī"
    ],
    "variations": [
      "al-Haraqi",
      "Haraqi",
      "Abu Muhammad ʿAbd al-Gabbar b. ʿAbd al-Gabbar b. Muhammad al-Tabiti al-Husayni al-Marwazi al-Haraqi",
      "Abu Muhammad ʿAbd Gabbar b. ʿAbd Gabbar b. Muhammad Tabiti Husayni Marwazi Haraqi"
    ]
  },
  {
    "names": [
      "قاضي المارستان",
      "Qāḍī al-Māristān",
      "أبو بكر محمد بن عبد الباقي بن محمد الأنصاري الكعبي",
      "Qadi Maristan",
      "Abū Bakr Muḥammad b. ʿAbd al-Bāqī b. Muḥammad al-Anṣārī al-Kaʿbī"
    ],
    "variations": [
      "Qadi al-Maristan",
      "Abu Bakr Muhammad b. ʿAbd al-Baqi b. Muhammad al-Ansari al-Kaʿbi",
      "Abu Bakr Muhammad b. ʿAbd Baqi b. Muhammad Ansari Kaʿbi"
    ]
  },
  {
    "names": [
      "قوام السنة",
      "Qawwām al-Sunnaŧ",
      "قوام السنة أبو القاسم اسماعيل بن محمد بن الفضل بن علي بن طاهر بن أحمد القرشي التيمي تهم ال الاصبهاني الطلحي",
      "Qawwam Sunna",
      "Qawwām al-Sunnaŧ Abū al-Qāsim Ismāʿīl b. Muḥammad b. al-Faḍl b. ʿAlī b. Ṭāhir b. Aḥmad al-Qurašī al-Tayyamī thumma al- al-Iṣbahānī al-Ṭalḥī"
    ],
    "variations": [
      "Qawwam al-Sunnat",
      "Qawwam Sunnat",
      "Qawwam al-Sunnat Abu al-Qasim Ismaʿil b. Muhammad b. al-Fadl b. ʿAli b. Tahir b. Ahmad al-Qurasi al-Tayyami thumma al- al-Isbahani al-Talhi",
      "Qawwam Sunnat Abu Qasim Ismaʿil b. Muhammad b. Fadl b. ʿAli b. Tahir b. Ahmad Qurasi Tayyami thumma  Isbahani Talhi"
    ]
  },
  {
    "names": [
      "القاضي عياض",
      "al-Qāḍī ʿIyāḍ",
      "أبو الفضل عياض بن موسى بن عياض اليحصبي السبتي",
      "Qadi Ciyad",
      "Abū al-Faḍl ʿIyāḍ b. Mūsá b. ʿIyāḍ al-Yaḥṣubī al-Sabtī"
    ],
    "variations": [
      "al-Qadi ʿIyad",
      "Qadi ʿIyad",
      "Abu al-Fadl ʿIyad b. Musa b. ʿIyad al-Yahsubi al-Sabti",
      "Abu Fadl ʿIyad b. Musa b. ʿIyad Yahsubi Sabti"
    ]
  },
  {
    "names": [
      "الشهرستاني",
      "al-Šahrastānī",
      "تاج الدين أبو الفتح محمد بن عبد الكريم بن أبي بكر أحمد الشهرستاني",
      "Shahrastani",
      "Tāǧ al-dīn Abū al-Fatḥ Muḥammad b. ʿAbd al-Karīm b. Abī Bakr Aḥmad al-Šahrastānī"
    ],
    "variations": [
      "al-Sahrastani",
      "Sahrastani",
      "Tag al-din Abu al-Fath Muhammad b. ʿAbd al-Karim b. Abi Bakr Ahmad al-Sahrastani",
      "Tag din Abu Fath Muhammad b. ʿAbd Karim b. Abi Bakr Ahmad Sahrastani"
    ]
  },
  {
    "names": [
      "أبو عبد الله الزهري",
      "Abū ʿAbd Allāh al-Zuhrī",
      "أبو عبد الله محمد بن أبي بكر الزهري",
      "Abu Cabd Allah Zuhri",
      "Abū ʿAbd Allāh Muḥammad b. Abī Bakr al-Zuhrī"
    ],
    "variations": [
      "Abu ʿAbd Allah al-Zuhri",
      "Abu ʿAbd Allah Zuhri",
      "Abu ʿAbd Allah Muhammad b. Abi Bakr al-Zuhri",
      "Abu ʿAbd Allah Muhammad b. Abi Bakr Zuhri"
    ]
  },
  {
    "names": [
      "بيان الحقق النيسابوري",
      "Bayān al-Ḥaqq al-Naysābūrī",
      "أبو القاسم محمود بن أبي الحسن النيسابوري",
      "Bayan Haqq Naysaburi",
      "Abū al-Qāsim Maḥmūd b. Abī al-Ḥasan al-Naysābūrī"
    ],
    "variations": [
      "Bayan al-Haqq al-Naysaburi",
      "Abu al-Qasim Mahmud b. Abi al-Hasan al-Naysaburi",
      "Abu Qasim Mahmud b. Abi Hasan Naysaburi"
    ]
  },
  {
    "names": [
      "ابن القلانسي",
      "Ibn al-Qalānisī",
      "مجد الرؤساء أبو يعلى حمزة بن أسد بن علي بن محمد التميمي",
      "Ibn Qalanisi",
      "Maǧd al-Ruʾasāʾ Abū Yaʿlá Ḥamzaŧ b. Asad b. ʿAlī b. Muḥammad al-Tamīmī"
    ],
    "variations": [
      "Ibn al-Qalanisi",
      "Magd al-Ruʾasaʾ Abu Yaʿla Hamzat b. Asad b. ʿAli b. Muhammad al-Tamimi",
      "Magd Ruʾasaʾ Abu Yaʿla Hamzat b. Asad b. ʿAli b. Muhammad Tamimi"
    ]
  },
  {
    "names": [
      "الشريف الادريسي",
      "al-Šarīf al-Idrīsī",
      "أبو عبد الله محمد بن محمد بن عبد الله بن ادريس الحمودي الحسيني",
      "Sharif Idrisi",
      "Abū ʿAbd Allāh Muḥammad b. Muḥammad b. ʿAbd Allāh b. Idrīs al-Ḥammūdī al-Ḥusaynī"
    ],
    "variations": [
      "al-Sarif al-Idrisi",
      "Sarif Idrisi",
      "Abu ʿAbd Allah Muhammad b. Muhammad b. ʿAbd Allah b. Idris al-Hammudi al-Husayni",
      "Abu ʿAbd Allah Muhammad b. Muhammad b. ʿAbd Allah b. Idris Hammudi Husayni"
    ]
  },
  {
    "names": [
      "السمعاني",
      "al-Samʿānī",
      "تاج الإسلام قوام الدين أبو سعد عبد الكريم بن أبي بكر محمد بن أبي المظفر منصور التميمي السمعاني المروزي الشافعي",
      "Samcani",
      "Tāǧ al-ʾIslām Ḳawām al-dīn Abū Saʿd ʿAbd al-Karīm b. Abī Bakr Muḥammad b. Abī al-Muẓaffar Manṣūr al-Tamīmī al-Samʿānī al-Marwazī al-Šāfiʿī"
    ],
    "variations": [
      "al-Samʿani",
      "Samʿani",
      "Tag al-ʾIslam Kawam al-din Abu Saʿd ʿAbd al-Karim b. Abi Bakr Muhammad b. Abi al-Muzaffar Mansur al-Tamimi al-Samʿani al-Marwazi al-Safiʿi",
      "Tag ʾIslam Kawam din Abu Saʿd ʿAbd Karim b. Abi Bakr Muhammad b. Abi Muzaffar Mansur Tamimi Samʿani Marwazi Safiʿi"
    ]
  },
  {
    "names": [
      "ابن فندق/فندق (تهe فoرمeر اس رecoردeد ان eر أند تهe لتeر اس رecoردeد ان تهe eدتoرءس انترoدcتoن تo تركه بيهق)",
      "Ibn Funduq/Fanduq (the former is recorded in EIr and the latter is recorded in the editor's introduction to Tarikh Bayhaq)",
      "ظهير الدين أبو الحسن علي بن زيد بن محمد بن الحسين بن فندق البيهقي",
      "Ibn Funduq Bayhaqi",
      "Ẓahīr al-dīn Abū al-Ḥasan ʿAlī b. Zayd b. Muḥammad b. al-Ḥusayn b. Funduq al-Bayhaqī"
    ],
    "variations": [
      "Zahir al-din Abu al-Hasan ʿAli b. Zayd b. Muhammad b. al-Husayn b. Funduq al-Bayhaqi",
      "Zahir din Abu Hasan ʿAli b. Zayd b. Muhammad b. Husayn b. Funduq Bayhaqi"
    ]
  },
  {
    "names": [
      "الموفق الخوارزمي",
      "Muwaffaq Khwarazmi",
      "أبي المؤيّد بن أحمد المكّي أخطب خوارزم [ خوارزمي ]"
    ],
    "variations": [
      "أبي المؤيد بن أحمد المكي أخطب خوارزم [ خوارزمي ]"
    ]
  },
  {
    "names": [
      "عمارة اليمني",
      "ʿUmāraŧ al-Yamanī",
      "نجم الدين أبو حمزة عمارة بن علي الحكمي اليمني",
      "Cumara Yamani",
      "Najm al-Dīn Abū Ḥamzaŧ ʿUmāraŧ b. ʿAlī al-Ḥakamī al-Yamanī"
    ],
    "variations": [
      "ʿUmarat al-Yamani",
      "ʿUmarat Yamani",
      "Najm al-Din Abu Hamzat ʿUmarat b. ʿAli al-Hakami al-Yamani",
      "Najm Din Abu Hamzat ʿUmarat b. ʿAli Hakami Yamani"
    ]
  },
  {
    "names": [
      "ابن عساكر",
      "Ibn ʿAsākir",
      "أبو القاسم علي بن الحسن بن هبة الله بن عبد الله الشافعي",
      "Ibn Casakir",
      "Abū al-Qāsim ʿAlī b. al-Ḥasan b. Hibaŧ Allāh b. ʿAbd Allāh al-Šāfiʿī"
    ],
    "variations": [
      "Ibn ʿAsakir",
      "Abu al-Qasim ʿAli b. al-Hasan b. Hibat Allah b. ʿAbd Allah al-Safiʿi",
      "Abu Qasim ʿAli b. Hasan b. Hibat Allah b. ʿAbd Allah Safiʿi"
    ]
  },
  {
    "names": [
      "ابن خير الاشبيلي",
      "Ibn Ḫayr al-Išbīlī",
      "أبو بكر محمد بن خير بن عمر بن خليفة اللمتوني الأموي الاشبيلي",
      "Ibn Khayr Ishbili",
      "Abū Bakr Muḥammad b. Ḫayr b. ʿUmar b. Ḫalīfaŧ al-Lamtūnī al-Amawī al-Išbīlī"
    ],
    "variations": [
      "Ibn Hayr al-Isbili",
      "Ibn Hayr Isbili",
      "Abu Bakr Muhammad b. Hayr b. ʿUmar b. Halifat al-Lamtuni al-Amawi al-Isbili",
      "Abu Bakr Muhammad b. Hayr b. ʿUmar b. Halifat Lamtuni Amawi Isbili"
    ]
  },
  {
    "names": [
      "ابن الأنباري",
      "Ibn al-Anbārī",
      "أبو البركات كمال الدين عبد الرحمان بن محمد بن عبيد الله بن أبي سعيد الأنباري",
      "Abu Barakat Anbari",
      "Abū al-barakāt Kamāl al-dīn ʿAbd al-Raḥmān b. Muḥammad b. ʿUbayd Al-lãh b. Abī Saʿīd al-Anbārī"
    ],
    "variations": [
      "Ibn al-Anbari",
      "Ibn Anbari",
      "Abu al-barakat Kamal al-din ʿAbd al-Rahman b. Muhammad b. ʿUbayd Al-lah b. Abi Saʿid al-Anbari",
      "Abu barakat Kamal din ʿAbd Rahman b. Muhammad b. ʿUbayd lah b. Abi Saʿid Anbari"
    ]
  },
  {
    "names": [
      "أحمد الرفاعي",
      "Aḥmad al-Rifāʿī",
      "قطب الغوث، أبو العلمين، سيد الأولياء أبو العباس أحمد بن علي بن يحيى بن ثابت الرفاعي، الحسيني، الهاشمي",
      "Ahmad Rifaci",
      "Quṭb al-Ġawṯ, Abū al-ʿalamayn, Sayyid al-Awliyāʾ Abū al-ʿAbbās Aḥmad b. ʿAlī b. Yaḥyá b. Ṯābit al-Rifāʿī, al-Ḥusaynī, al-Hāšimī"
    ],
    "variations": [
      "Ahmad al-Rifaʿi",
      "Ahmad Rifaʿi",
      "Qutb al-Gawt, Abu al-ʿalamayn, Sayyid al-Awliyaʾ Abu al-ʿAbbas Ahmad b. ʿAli b. Yahya b. Tabit al-Rifaʿi, al-Husayni, al-Hasimi",
      "Qutb Gawt, Abu ʿalamayn, Sayyid Awliyaʾ Abu ʿAbbas Ahmad b. ʿAli b. Yahya b. Tabit Rifaʿi, Husayni, Hasimi"
    ]
  },
  {
    "names": [
      "ابن بشكوال",
      "Ibn Baškuwāl",
      "أبو القاسم خلف بن عبد الملك بن مسعود بن موسى بن بشكوال بن يوسف الأنصاري الخزرجي الأندلسي القرطبي",
      "Ibn Bashkuwal",
      "Abū al-Qāsim Ḫalaf b. ʿAbd al-malik b. Masʿūd b. Mūsá b. Baškuwāl b. Yūsuf al-Anṣārī al-Ḫazraǧī al-Andalusī al-Qurṭubī"
    ],
    "variations": [
      "Ibn Baskuwal",
      "Abu al-Qasim Halaf b. ʿAbd al-malik b. Masʿud b. Musa b. Baskuwal b. Yusuf al-Ansari al-Hazragi al-Andalusi al-Qurtubi",
      "Abu Qasim Halaf b. ʿAbd malik b. Masʿud b. Musa b. Baskuwal b. Yusuf Ansari Hazragi Andalusi Qurtubi"
    ]
  },
  {
    "names": [
      "ابن العمراني",
      "Ibn al-ʿImrānī",
      "محمد بن علي بن محمد",
      "Ibn Cimrani",
      "Muḥammad b. ʿAlī b. Muḥammad"
    ],
    "variations": [
      "Ibn al-ʿImrani",
      "Ibn ʿImrani",
      "Muhammad b. ʿAli b. Muhammad"
    ]
  },
  {
    "names": [
      "أبو القاسم السهيلي",
      "Abū al-Qāsim al-Suhaylī",
      "أبو القاسم عبد الرحمن بن عبد الله بن أحمد السهيلي",
      "Abu Qasim Suhayli",
      "Abū al-Qāsim ʿAbd al-Raḥmãn b. ʿAbd Allāh b. Aḥmad al-Suhaylī"
    ],
    "variations": [
      "Abu al-Qasim al-Suhayli",
      "Abu al-Qasim ʿAbd al-Rahman b. ʿAbd Allah b. Ahmad al-Suhayli",
      "Abu Qasim ʿAbd Rahman b. ʿAbd Allah b. Ahmad Suhayli"
    ]
  },
  {
    "names": [
      "أسامة بن منقذ",
      "Usāmaŧ b. Munqiḏ",
      "مؤيد الدولة مجد الدين أبو المظفر أسامة بن مرشد بن علي بن مقلد بن نصر بن منقذ الكناني الكلبي الشيزري",
      "Ibn Munqidh Shayzari",
      "Muʾayyad al-Dawlaŧ Maǧd al-Dīn Abū al-Muẓaffar Usāmaŧ b. Muršid b. ʿAlī b. Muqlid b. Naṣr b. Munqiḏ al-Kinānī al-Kalbī al-Šayzarī"
    ],
    "variations": [
      "Usamat b. Munqid",
      "Muʾayyad al-Dawlat Magd al-Din Abu al-Muzaffar Usamat b. Mursid b. ʿAli b. Muqlid b. Nasr b. Munqid al-Kinani al-Kalbi al-Sayzari",
      "Muʾayyad Dawlat Magd Din Abu Muzaffar Usamat b. Mursid b. ʿAli b. Muqlid b. Nasr b. Munqid Kinani Kalbi Sayzari"
    ]
  },
  {
    "names": [
      "أبو الوليد محمد بن أحمد بن محمد بن أحمد بن رشد القرطبي الشهير بابن رشد الحفيد (المتوفى: 595هـ)",
      "Ibn Rushd Hafid",
      "أبو الوليد محمد بن أحمد بن محمد بن أحمد بن رشد القرطبي الشهير بابن رشد الحفيد (المتوفى: 595ه)",
      "ابن رشد الحفيد",
      "أبو الوليد محمد بن أحمد بن محمد بن أحمد بن رشد القرطبي الشهير بابن رشد الحفيد",
      "ابن رشد",
      "محمد بن أحمد بن محمد بن رشد القرطبي أبو الوليد",
      "أبو الوليد محمد بن أحمد بن محمد بن أحمد بن رشد القرطبي الشهير بابن رشد الحفيد (المتوفى : 595هـ)",
      "Ibn Rušd",
      "أبي الوليد محمد بن رشد الحفيد",
      "أبو الوليد محمد بن أحمد بن رشد القرطبي الشهير بابن رشد الحفيد (المتوفى: 595ه)"
    ],
    "variations": [
      "Ibn Rusd"
    ]
  },
  {
    "names": [
      "عماد الدين الكاتب الاصفهاني",
      "ʿImād al-Dīn al-kātib al-Iṣfahānī",
      "عماد الدين أبو عبد الله بن صفي الدين أبو لفرج بن نفيس ال دين أبو الرجاء محمد بن محمد بن حامد بن محمد بن عبد الله بن علي بن محمود بن هبت الله الاصفهاني",
      "Cimad Din Katib Isfahani",
      "ʿImād al-Dīn Abū ʿAbd Allāh b. Ṣafī al-Dīn Abū l-Faraǧ b. Nafīs al- Dīn Abū al-Raǧāʾ Muḥammad b. Muḥammad b. Ḥāmid b. Muḥammad b. ʿAbd Allāh b. ʿAlī b. Maḥmūd b. Hibat Allāh al-Iṣfahānī"
    ],
    "variations": [
      "ʿImad al-Din al-katib al-Isfahani",
      "ʿImad Din katib Isfahani",
      "ʿImad al-Din Abu ʿAbd Allah b. Safi al-Din Abu l-Farag b. Nafis al- Din Abu al-Ragaʾ Muhammad b. Muhammad b. Hamid b. Muhammad b. ʿAbd Allah b. ʿAli b. Mahmud b. Hibat Allah al-Isfahani",
      "ʿImad Din Abu ʿAbd Allah b. Safi Din Abu l-Farag b. Nafis  Din Abu Ragaʾ Muhammad b. Muhammad b. Hamid b. Muhammad b. ʿAbd Allah b. ʿAli b. Mahmud b. Hibat Allah Isfahani"
    ]
  },
  {
    "names": [
      "ابن الجوزي",
      "Ibn al-Ǧawzī",
      "أبو الفرج عبد الرحمن بن علي بن الجوزي",
      "Ibn Jawzi",
      "Abū al-Faraǧ ʿAbd al-Raḥmãn b. ʿAlī b. al-Ǧawzī"
    ],
    "variations": [
      "Ibn al-Gawzi",
      "Ibn Gawzi",
      "Abu al-Farag ʿAbd al-Rahman b. ʿAli b. al-Gawzi",
      "Abu Farag ʿAbd Rahman b. ʿAli b. Gawzi"
    ]
  },
  {
    "names": [
      "عبد الغافر بن إسماعيل بن عبد الغافر ابن محمد الفارسيّ",
      "Anonymous"
    ],
    "variations": [
      "عبد الغافر بن إسماعيل بن عبد الغافر ابن محمد الفارسي"
    ]
  },
  {
    "names": [
      "تقي الدين أبو محمد عبد الغني بن عبد الواحد بن علي بن سرور المقدسي الجماعلي الدمشقي الحنبلي",
      "Cabd Ghani Maqdisi",
      "Taqī al-dīn Abū Muḥammad ʿAbd al-Ġanī b. ʿAbd al-Wāḥid b. ʿAlī b. Surūr al-Maqdisī al-Ǧamāʿilī al-Dimašqī al-Ḥanbalī"
    ],
    "variations": [
      "Taqi al-din Abu Muhammad ʿAbd al-Gani b. ʿAbd al-Wahid b. ʿAli b. Surur al-Maqdisi al-Gamaʿili al-Dimasqi al-Hanbali",
      "Taqi din Abu Muhammad ʿAbd Gani b. ʿAbd Wahid b. ʿAli b. Surur Maqdisi Gamaʿili Dimasqi Hanbali"
    ]
  },
  {
    "names": [
      "محمّد بن عمر بن الحسن بن الحسين التيمي البكري [ فخر الدين الرازي ]",
      "Fakhr Din Razi",
      "الإمام فخر الدين أبي عبد الله محمد بن عمر بن الحسين الرازي",
      "الرازي",
      "الفخر الرازي",
      "أبو عبد الله محمد بن عمر بن الحسن بن الحسين التيمي الرازي الملقب بفخر الدين الرازي خطيب الري (المتوفى: 606هـ)",
      "فخر الدين الرازي",
      "محمد بن عمر بن الحسين الرازي أبو عبد الله",
      "فخر الدين محمد بن عمر الخطيب الرازي",
      "الرازي، فخر الدين",
      "أبو عبد الله محمد بن عمر بن الحسن بن الحسين التيمي الرازي الملقب بفخر الدين الرازي خطيب الري",
      "الفخر الرازي‏",
      "فخر الدين محمد بن عمر التميمي الرازي الشافعي",
      "محمد بن عمر بن الحسين الرازي",
      "الإمام فخر الدين محمد بن عمر بن الحسين الرازى المتوفى سنة 606 ه"
    ],
    "variations": [
      "محمد بن عمر بن الحسن بن الحسين التيمي البكري [ فخر الدين الرازي ]"
    ]
  },
  {
    "names": [
      "أبي محمّد صدر الدين روزبهان بن أبي نصر البقلي",
      "Ruzbihan Baqli",
      "البقلي"
    ],
    "variations": [
      "أبي محمد صدر الدين روزبهان بن أبي نصر البقلي"
    ]
  },
  {
    "names": [
      "ابن طبرزد",
      "Ibn Ṭabarzad",
      "أبو حفص عمر بن أحمد بن معمر بن طبرزد",
      "Ibn Tabarzad",
      "Abū Ḥafṣ ʿUmar b. Aḥmad b. Muʿammar b. Ṭabarzad"
    ],
    "variations": [
      "Abu Hafs ʿUmar b. Ahmad b. Muʿammar b. Tabarzad"
    ]
  },
  {
    "names": [
      "ابن سناء الملك",
      "Ibn Sanāʾ al-Mulk",
      "القاضي السعيد هبة الله أبو القاسم جعفر بن الرشيد أبي الفضل جعفر بن المعتمد سناء الملك أبي عبد الله محمد بن هبة الله بن محمد السعدي",
      "Ibn Sana Mulk",
      "al-Qāḍī al-Saʿīd Hibbaŧ Allāh Abū al-Qāsim Ǧaʿfar b. al-Rašīd Abī al-Faḍl Ǧaʿfar b. al-Muʿtamid Sanāʾ al-Mulk Abī ʿAbd Allāh Muḥammad b. Hibaŧ Allāh b. Muḥammad al-Saʿdī"
    ],
    "variations": [
      "Ibn Sanaʾ al-Mulk",
      "Ibn Sanaʾ Mulk",
      "al-Qadi al-Saʿid Hibbat Allah Abu al-Qasim Gaʿfar b. al-Rasid Abi al-Fadl Gaʿfar b. al-Muʿtamid Sanaʾ al-Mulk Abi ʿAbd Allah Muhammad b. Hibat Allah b. Muhammad al-Saʿdi",
      "Qadi Saʿid Hibbat Allah Abu Qasim Gaʿfar b. Rasid Abi Fadl Gaʿfar b. Muʿtamid Sanaʾ Mulk Abi ʿAbd Allah Muhammad b. Hibat Allah b. Muhammad Saʿdi"
    ]
  },
  {
    "names": [
      "محمّد بن أحمد بن جبير الأندلسي",
      "Ibn Jubayr",
      "محمد بن أحمد ابن جبير",
      "أبي الحسين محمد بن أحمد بن جبر الكناني الأندلسي",
      "ابن جبير",
      "ابن جبير، محمد بن أحمد بن جبير الكناني الأندلسي، أبو الحسين (المتوفى: 614هـ)"
    ],
    "variations": [
      "محمد بن أحمد بن جبير الأندلسي"
    ]
  },
  {
    "names": [
      "ناصر الدين، أبو المعالي المنصور محمد بن تقي الدين عمر بن شاهنشاه بن أيوب الأيوبي",
      "Mansur Ibn Shahanshah",
      "Nāṣir al-dīn, Abū al-maʿālī al-Manṣūr Muḥammad b. Taqī al-dīn ʿUmar b. Šāhanšāh b. Ayyūb al-Ayyūbī"
    ],
    "variations": [
      "Nasir al-din, Abu al-maʿali al-Mansur Muhammad b. Taqi al-din ʿUmar b. Sahansah b. Ayyub al-Ayyubi",
      "Nasir din, Abu maʿali Mansur Muhammad b. Taqi din ʿUmar b. Sahansah b. Ayyub Ayyubi"
    ]
  },
  {
    "names": [
      "ابن قدامة المقدسي",
      "Ibn Qudāmaŧ al-Maqdisī",
      "موفق الدين أبو محمد عبد الله بن أحمد بن محمد المقدسي",
      "Ibn Qudama Maqdisi",
      "Muwaffaq al-dīn Abū Muḥammad ʿAbd Allãh b. ʾAḥmad b. Muḥammad al-Maqdisī"
    ],
    "variations": [
      "Ibn Qudamat al-Maqdisi",
      "Ibn Qudamat Maqdisi",
      "Muwaffaq al-din Abu Muhammad ʿAbd Allah b. ʾAhmad b. Muhammad al-Maqdisi",
      "Muwaffaq din Abu Muhammad ʿAbd Allah b. ʾAhmad b. Muhammad Maqdisi"
    ]
  },
  {
    "names": [
      "أبو القاسم الرافعي",
      "Abū al-Qāsim al-Rāfiʿī",
      "أبو القاسم عبد الكريم بن محمد الرافعي",
      "Abu Qasim Rafici",
      "Abū al-Qāsim ʿAbd al-Karīm b. Muḥammad al-Rāfiʿī"
    ],
    "variations": [
      "Abu al-Qasim al-Rafiʿi",
      "Abu Qasim Rafiʿi",
      "Abu al-Qasim ʿAbd al-Karim b. Muhammad al-Rafiʿi",
      "Abu Qasim ʿAbd Karim b. Muhammad Rafiʿi"
    ]
  },
  {
    "names": [
      "صفيّ الدين، أبو الفتح عيسى بن البحتري الحلبي (المتوفى: بعد 625هـ)",
      "Safi Din Halabi",
      "صفيّ الدين، أبو الفتح عيسى بن البحتري الحلبي",
      "صفي الدين الحلبي"
    ],
    "variations": [
      "صفي الدين، أبو الفتح عيسى بن البحتري الحلبي (المتوفى: بعد 625هـ)",
      "صفي الدين، أبو الفتح عيسى بن البحتري الحلبي"
    ]
  },
  {
    "names": [
      "ياقوت الحلبي",
      "Yāqūt al-Ḥalabī",
      "شهاب الدين أبو عبد الله ياقوت بن عبد الله الرومي، الحلبي",
      "Yaqut Hamawi",
      "Šihāb al-Dīn Abū ʿAbd Allāh Yāqūt b. ʿAbd Allāh al-Rūmī, al-Ḥalabī"
    ],
    "variations": [
      "Yaqut al-Halabi",
      "Yaqut Halabi",
      "Sihab al-Din Abu ʿAbd Allah Yaqut b. ʿAbd Allah al-Rumi, al-Halabi",
      "Sihab Din Abu ʿAbd Allah Yaqut b. ʿAbd Allah Rumi, Halabi"
    ]
  },
  {
    "names": [
      "زين الأمناء ابن عساكر",
      "Zayn al-Umanāʾ Ibn ʿAsākir",
      "زين الأمناء أبو البركات الحسن بن محمد بن الحسن بن هبة الله ابن عساكر الدمشقي",
      "Zayn Umana Ibn Casakir",
      "Zayn al-Umanāʾ Abū al-Barakāt al-Ḥasan b. Muḥammad b. al-Ḥasan b. Hibaŧ Allāh Ibn ʿAsākir al-Dimašqī"
    ],
    "variations": [
      "Zayn al-Umanaʾ Ibn ʿAsakir",
      "Zayn Umanaʾ Ibn ʿAsakir",
      "Zayn al-Umanaʾ Abu al-Barakat al-Hasan b. Muhammad b. al-Hasan b. Hibat Allah Ibn ʿAsakir al-Dimasqi",
      "Zayn Umanaʾ Abu Barakat Hasan b. Muhammad b. Hasan b. Hibat Allah Ibn ʿAsakir Dimasqi"
    ]
  },
  {
    "names": [
      "عبد اللطيف بن يوسف بن محمد بن علي البغدادي، موفق الدين، ويعرف بابن اللباد، وبابن نقطة (المتوفى: 629هـ)",
      "Cabd Latif Baghdadi",
      "عبد اللطيف البغداديّ",
      "ʿAbd al-Laṭīf al-Baghdādī",
      "عبد اللطيف البغدادي"
    ],
    "variations": [
      "ʿAbd al-Latif al-Baghdadi",
      "ʿAbd Latif Baghdadi"
    ]
  },
  {
    "names": [
      "ابن الأثير",
      "Ibn al-Aṯīr",
      "عزالدين أبوالحسن علي بن أبيالكرم محمد بن محمد بن عبدالكريم بن عبدالواحد الشيباني، الجزري",
      "Ibn Athir Cizz Din",
      "ʿIzz-al-dīn Abū-al-Ḥasan ʿAlī b. Abī-al-Karam Muḥammad b. Muḥammad b. ʿAbd-al-Karīm b. ʿAbd-al-wāḥid al-Šaybānī, al-Ǧazarī"
    ],
    "variations": [
      "Ibn al-Atir",
      "Ibn Atir",
      "ʿIzz-al-din Abu-al-Hasan ʿAli b. Abi-al-Karam Muhammad b. Muhammad b. ʿAbd-al-Karim b. ʿAbd-al-wahid al-Saybani, al-Gazari",
      "ʿIzz-din Abu-Hasan ʿAli b. Abi-Karam Muhammad b. Muhammad b. ʿAbd-Karim b. ʿAbd-wahid Saybani, Gazari"
    ]
  },
  {
    "names": [
      "ابن عنين",
      "Ibn ʿUnayn",
      "شرف الدين، أبو المحاسن محمد بن نصر بن علي بن محمد بن غالب الأنصاري الدمشقي",
      "Ibn Cunayn",
      "Šaraf al-dīn, Abū al-maḥāsin Muḥammad b. Naṣr b. ʿAlī b. Muḥammad b. Ġālib al-Anṣārī al-Dimašqī"
    ],
    "variations": [
      "Saraf al-din, Abu al-mahasin Muhammad b. Nasr b. ʿAli b. Muhammad b. Galib al-Ansari al-Dimasqi",
      "Saraf din, Abu mahasin Muhammad b. Nasr b. ʿAli b. Muhammad b. Galib Ansari Dimasqi"
    ]
  },
  {
    "names": [
      "بهاء الدين ابن شداد",
      "Bahāʾ al-dīn Ibn Šaddād",
      "بهاء الدين، أبو المحاسن يوسف بن رافع بن تميم",
      "Baha Din Ibn Shaddad",
      "Bahāʾ al-dīn, Abū al-maḥāsin Yūsuf b. Rāfiʿ b. Tamīm"
    ],
    "variations": [
      "Bahaʾ al-din Ibn Saddad",
      "Bahaʾ din Ibn Saddad",
      "Bahaʾ al-din, Abu al-mahasin Yusuf b. Rafiʿ b. Tamim",
      "Bahaʾ din, Abu mahasin Yusuf b. Rafiʿ b. Tamim"
    ]
  },
  {
    "names": [
      "ابن العسكر",
      "Ibn al-ʿAskar",
      "محمد بن علي بن الخضر بن العسكر",
      "Ibn Caskar",
      "Muḥammad b. ʿAlī b. al-Ḫiḍr b. al-ʿAskar"
    ],
    "variations": [
      "Ibn ʿAskar",
      "Muhammad b. ʿAli b. al-Hidr b. al-ʿAskar",
      "Muhammad b. ʿAli b. Hidr b. ʿAskar"
    ]
  },
  {
    "names": [
      "ضياء الدين ابن الأثير",
      "Ḍiyāʾ al-dīn Ibn al-Aṯīr",
      "ضياء الدين أبو الفتح نصر الله بن محمد بن الأثير",
      "Ibn Athir Diya Din",
      "Ḍiyāʾ al-dīn Abū al-Fatḥ Naṣr Allāh b. Muḥammad b. al-Aṯīr"
    ],
    "variations": [
      "Diyaʾ al-din Ibn al-Atir",
      "Diyaʾ din Ibn Atir",
      "Diyaʾ al-din Abu al-Fath Nasr Allah b. Muhammad b. al-Atir",
      "Diyaʾ din Abu Fath Nasr Allah b. Muhammad b. Atir"
    ]
  },
  {
    "names": [
      "أبي عبد الله محمّد بن سعيد بن الدبيثي",
      "Ibn Dubaythi",
      "محمد بن سعيد ابن الدبيثي",
      "NA",
      "ابن الدبيثي",
      "ابن الدبيثي (637 ه)"
    ],
    "variations": [
      "أبي عبد الله محمد بن سعيد بن الدبيثي"
    ]
  },
  {
    "names": [
      "ابن المستوفي",
      "Ibn al-Mustawfī",
      "شرف الدين، أبو البركات المبارك بن أحمد بن المبارك بن موهوب اللخمي، الاربلي",
      "Ibn Mustawfi",
      "Šaraf al-dīn, Abū al-barakāt al-Mubārak b. Aḥmad b. al-Mubārak b. Mawhūb al-Laḫmī, al-irbilī"
    ],
    "variations": [
      "Ibn al-Mustawfi",
      "Saraf al-din, Abu al-barakat al-Mubarak b. Ahmad b. al-Mubarak b. Mawhub al-Lahmi, al-irbili",
      "Saraf din, Abu barakat Mubarak b. Ahmad b. Mubarak b. Mawhub Lahmi, irbili"
    ]
  },
  {
    "names": [
      "ابن عربي الشيخ الأكبر",
      "Ibn ʿArabī al-Šayḫ al-akbar",
      "محي الدين أبو عبد الله محمد بن علي بن محمد بن عربي الحاتمي الطائي",
      "Ibn Carabi",
      "Muḥyi al-dīn Abū ʿAbd Al-lãh Muḥammad b. ʿAlī b. Muḥammad b. ʿArabī al-Ḥātimī al-Ṭāʾī"
    ],
    "variations": [
      "Ibn ʿArabi al-Sayh al-akbar",
      "Ibn ʿArabi Sayh akbar",
      "Muhyi al-din Abu ʿAbd Al-lah Muhammad b. ʿAli b. Muhammad b. ʿArabi al-Hatimi al-Taʾi",
      "Muhyi din Abu ʿAbd lah Muhammad b. ʿAli b. Muhammad b. ʿArabi Hatimi Taʾi"
    ]
  },
  {
    "names": [
      "دنيسري",
      "Dunaysirī",
      "أبو حفص عمر بن خضر التركي دنيسري",
      "Abu Hafs Dunaysiri",
      "Abū Ḥafṣ ʿUmar b. Ḫiḍr al-Turkī Dunaysirī"
    ],
    "variations": [
      "Dunaysiri",
      "Abu Hafs ʿUmar b. Hidr al-Turki Dunaysiri",
      "Abu Hafs ʿUmar b. Hidr Turki Dunaysiri"
    ]
  },
  {
    "names": [
      "ابن نجار",
      "Ibn Naǧǧār",
      "حافظ محب الدين أبو عبد الله محمد بن محمود بن الحسن البغدادي",
      "Ibn Najjar",
      "Ḥāfiẓ Muḥib al-dīn Abū ʿAbd Al-lãh Muḥammad b. Maḥmūd b. al-Ḥasan al-Baġdādī"
    ],
    "variations": [
      "Ibn Naggar",
      "Hafiz Muhib al-din Abu ʿAbd Al-lah Muhammad b. Mahmud b. al-Hasan al-Bagdadi",
      "Hafiz Muhib din Abu ʿAbd lah Muhammad b. Mahmud b. Hasan Bagdadi"
    ]
  },
  {
    "names": [
      "ابن صلاح",
      "Ibn Ṣalāḥ",
      "تقي الدين أبو عمرو عثمان بن عبد الرحمن الشهرزوري الكوردي",
      "Ibn Salah Shahrazuri",
      "Taqī al-dīn Abū ʿAmrů ʿUṯmān b. ʿAbd al-Raḥmãn al-Šahrazūrī al-Kūrdī"
    ],
    "variations": [
      "Ibn Salah",
      "Taqi al-din Abu ʿAmru ʿUtman b. ʿAbd al-Rahman al-Sahrazuri al-Kurdi",
      "Taqi din Abu ʿAmru ʿUtman b. ʿAbd Rahman Sahrazuri Kurdi"
    ]
  },
  {
    "names": [
      "ابن القفطي",
      "Ibn al-Qifṭī",
      "جمال الدين أبو الحسن علي بن يوسف بن ابراهيم بن عبد الواحد القفطي، الشيباني",
      "Ibn Qifti",
      "Ǧamāl al-dīn Abū al-Ḥasan ʿAlī b. Yūsuf b. Ibrāhīm b. ʿAbd al-wāḥid al-Qifṭī, al-Šaybānī"
    ],
    "variations": [
      "Ibn al-Qifti",
      "Gamal al-din Abu al-Hasan ʿAli b. Yusuf b. Ibrahim b. ʿAbd al-wahid al-Qifti, al-Saybani",
      "Gamal din Abu Hasan ʿAli b. Yusuf b. Ibrahim b. ʿAbd wahid Qifti, Saybani"
    ]
  },
  {
    "names": [
      "Jamāl al-Dīn ʿAbd al-Raḥīm al-Jawbarī",
      "Jamal Din Jawbari",
      "جمال الدين عبد الرحيم الجوبريّ"
    ],
    "variations": [
      "Jamal al-Din ʿAbd al-Rahim al-Jawbari",
      "Jamal Din ʿAbd Rahim Jawbari",
      "جمال الدين عبد الرحيم الجوبري"
    ]
  },
  {
    "names": [
      "سبط ابن الجوزي",
      "Sibt Ibn Jawzi",
      "يوسف بن قزأوغلي - أو قزغلي - ابن عبد الله، أبو المظفر، شمس الدين، سبط أبي الفرج ابن الجوزي (المتوفى: 654هـ)",
      "شمس الدين أبو المظفر يوسف بن قِزْأُوغلي بن عبد الله المعروف بـ «سبط ابن الجوزي» (581 - 654 هـ)",
      "سبط بن الجوزي‏",
      "يوسف بن قزأوغلي - أو قزغلي - ابن عبد الله، أبو المظفر، شمس الدين، سبط أبي الفرج ابن الجوزي",
      "سبط ابن الجوزي (654 ه)"
    ],
    "variations": [
      "شمس الدين أبو المظفر يوسف بن قزأوغلي بن عبد الله المعروف بـ «سبط ابن الجوزي» (581 - 654 هـ)"
    ]
  },
  {
    "names": [
      "ابن الأبار",
      "Ibn al-Abbār",
      "أبو عبد الله محمد بن عبد الله بن أبي بكر بن عبد الله بن عبد الرحمن بن أحمد بن أبي بكر القضاعي البلنسي",
      "Ibn Abbar",
      "Abū ʿAbd Al-lãh Muḥammad b. ʿAbd Al-lãh b. Abī Bakr b. ʿAbd Al-lãh b. ʿAbd al-Raḥmãn b. Aḥmad b. Abī Bakr al-Quḍāʿī al-Balansī"
    ],
    "variations": [
      "Ibn al-Abbar",
      "Abu ʿAbd Al-lah Muhammad b. ʿAbd Al-lah b. Abi Bakr b. ʿAbd Al-lah b. ʿAbd al-Rahman b. Ahmad b. Abi Bakr al-Qudaʿi al-Balansi",
      "Abu ʿAbd lah Muhammad b. ʿAbd lah b. Abi Bakr b. ʿAbd lah b. ʿAbd Rahman b. Ahmad b. Abi Bakr Qudaʿi Balansi"
    ]
  },
  {
    "names": [
      "النعال",
      "al-Naʿʿāl",
      "صائن الدين أبو الحسن محمد بن الأنجب البغدادي",
      "Sain Din Naccal",
      "Ṣāʾin al-dīn Abū al-Ḥasan Muḥammad b. al-Anǧab al-Baġdādī"
    ],
    "variations": [
      "al-Naʿʿal",
      "Naʿʿal",
      "Saʾin al-din Abu al-Hasan Muhammad b. al-Angab al-Bagdadi",
      "Saʾin din Abu Hasan Muhammad b. Angab Bagdadi"
    ]
  },
  {
    "names": [
      "عثمان النابلسي",
      "ʿUṯmān al-Nābulusī",
      "علاء الدين أبو عمرو عثمان بن ابراهيم بن خالد القرشي، النابلسي",
      "Cuthman Nabulusi",
      "ʿAlāʾ al-dīn Abū ʿAmrů ʿUṯmān b. Ibrāhīm b. Ḫālid al-Qurašī, al-Nābulusī"
    ],
    "variations": [
      "ʿUtman al-Nabulusi",
      "ʿUtman Nabulusi",
      "ʿAlaʾ al-din Abu ʿAmru ʿUtman b. Ibrahim b. Halid al-Qurasi, al-Nabulusi",
      "ʿAlaʾ din Abu ʿAmru ʿUtman b. Ibrahim b. Halid Qurasi, Nabulusi"
    ]
  },
  {
    "names": [
      "ابن العديم",
      "Ibn al-ʿAdīm",
      "كمال الدين أبو القاسم عمر بن أحمد بن هبة الله",
      "Ibn Cadim",
      "Kamāl al-dīn Abū al-Qāsim ʿUmar b. Aḥmad b. Hibaŧ Al-lãh"
    ],
    "variations": [
      "Ibn al-ʿAdim",
      "Ibn ʿAdim",
      "Kamal al-din Abu al-Qasim ʿUmar b. Ahmad b. Hibat Al-lah",
      "Kamal din Abu Qasim ʿUmar b. Ahmad b. Hibat lah"
    ]
  },
  {
    "names": [
      "أبو شامة",
      "Abū Šāmaŧ",
      "شهاب الدين أبو القاسم عبد الرحمن بن اسماعيل بن ابراهيم المقدسي الدمشقي",
      "Abu Shama",
      "Šahāb al-dīn Abū al-Qāsim ʿAbd al-Raḥmãn b. Ismāʿīl b. Ibrāhīm al-Maqdisī al-Dimašqī"
    ],
    "variations": [
      "Abu Samat",
      "Sahab al-din Abu al-Qasim ʿAbd al-Rahman b. Ismaʿil b. Ibrahim al-Maqdisi al-Dimasqi",
      "Sahab din Abu Qasim ʿAbd Rahman b. Ismaʿil b. Ibrahim Maqdisi Dimasqi"
    ]
  },
  {
    "names": [
      "أحمد الدرجيني",
      "Aḥmad al-Darjīnī",
      "أبو العباس أحمد بن سعيد بن سليمان بن علي بن اخلاف الدرجيني",
      "Ahmad Darjini",
      "Abū al-ʿAbbās Aḥmad b. Saʿīd b. Sulaymān b. ʿAlī b. Iḫlāf al-Darjīnī"
    ],
    "variations": [
      "Ahmad al-Darjini",
      "Abu al-ʿAbbas Ahmad b. Saʿid b. Sulayman b. ʿAli b. Ihlaf al-Darjini",
      "Abu ʿAbbas Ahmad b. Saʿid b. Sulayman b. ʿAli b. Ihlaf Darjini"
    ]
  },
  {
    "names": [
      "الصياد",
      "al-Ṣayyād",
      "أحمد بن عبد الرحيم الصيادي",
      "Sayyad",
      "Aḥmad b. ʿAbd al-Raḥīm al-Ṣayyādī"
    ],
    "variations": [
      "al-Sayyad",
      "Ahmad b. ʿAbd al-Rahim al-Sayyadi",
      "Ahmad b. ʿAbd Rahim Sayyadi"
    ]
  },
  {
    "names": [
      "جمال الدين أبي عبد الله محمد بن عبد الله بن محمد بن عبد الله بن مالك الطاعي الجياني",
      "Ibn Malik",
      "Ǧamāl al-Dīn Abī ʿAbd Allāh Muḥammad b. ʿAbd Allāh b. Muḥammad b. ʿAbd Allāh b. Mālik al-Ṭāʿī al-Ǧayyānī"
    ],
    "variations": [
      "Gamal al-Din Abi ʿAbd Allah Muhammad b. ʿAbd Allah b. Muhammad b. ʿAbd Allah b. Malik al-Taʿi al-Gayyani",
      "Gamal Din Abi ʿAbd Allah Muhammad b. ʿAbd Allah b. Muhammad b. ʿAbd Allah b. Malik Taʿi Gayyani"
    ]
  },
  {
    "names": [
      "الخواجة نصير الدين الطوسي",
      "Nasir Din Tusi",
      "الحسين بن عبد الله بن سينا، أبو علي، شرف الملك: الفيلسوف الرئيس (المتوفى: 428هـ)",
      "أبو علي بن سينا",
      "ابن سينا",
      "Naṣīr al-Dīn al-Ṭūsī",
      "نصير الدين محمد بن الحسن الطوسي الشيعي",
      "نصير الدين الطوسي",
      "الطوسي، نصير الدين",
      "نصير الدين محمد بن الحسن الطوسي (المتوفى : 460هـ)"
    ],
    "variations": [
      "Nasir al-Din al-Tusi"
    ]
  },
  {
    "names": [
      "المحقق الحلي",
      "Ibn Hasan Muhaqqiq Hilli",
      "الشيخ نجم الدين أبي القاسم جعفر بن الحسن بن يحيى بن سعيد الهذلي [ المحقق الحلّي ]",
      "الشهيد الثاني"
    ],
    "variations": [
      "الشيخ نجم الدين أبي القاسم جعفر بن الحسن بن يحيى بن سعيد الهذلي [ المحقق الحلي ]"
    ]
  },
  {
    "names": [
      "النووي",
      "al-Nawawī",
      "محيي الدين أبو زكريا يحيى بن شرف بن مري بن حسن بن حسين بن محمد بن جمعة بن حزام الحزامي، الدمشقي",
      "Nawawi",
      "Muḥyī al-dīn Abū Zakariyyā Yaḥyá b. Šaraf b. Murī b. Ḥasan b. Ḥusayn b. Muḥammad b. Ǧumʿaŧ b. Ḥizām al-Ḥizāmī, al-Dimašqī"
    ],
    "variations": [
      "al-Nawawi",
      "Muhyi al-din Abu Zakariyya Yahya b. Saraf b. Muri b. Hasan b. Husayn b. Muhammad b. Gumʿat b. Hizam al-Hizami, al-Dimasqi",
      "Muhyi din Abu Zakariyya Yahya b. Saraf b. Muri b. Hasan b. Husayn b. Muhammad b. Gumʿat b. Hizam Hizami, Dimasqi"
    ]
  },
  {
    "names": [
      "ابن ميسر",
      "Ibn Muyassar",
      "تاج الدين محمد بن علي بن يوسف",
      "Tāǧ al-Dīn Muḥammad b. ʿAlī b. Yūsuf"
    ],
    "variations": [
      "Tag al-Din Muhammad b. ʿAli b. Yusuf",
      "Tag Din Muhammad b. ʿAli b. Yusuf"
    ]
  },
  {
    "names": [
      "الصابوني",
      "al-Ṣābūnī",
      "جمال الدين أبو حامد محمد بن علي الصابوني",
      "Ibn Sabuni",
      "Ǧamāl al-dīn Abū Ḥāmid Muḥammad b. ʿAlī al-Ṣābūnī"
    ],
    "variations": [
      "al-Sabuni",
      "Sabuni",
      "Gamal al-din Abu Hamid Muhammad b. ʿAli al-Sabuni",
      "Gamal din Abu Hamid Muhammad b. ʿAli Sabuni"
    ]
  },
  {
    "names": [
      "ابن خلكان",
      "Ibn Ḫallikān",
      "شمس الدين أبو العباس أحمد بن محمد بن ابراهيم بن أبي بكر بن خلكان البرمكي الاربيلي الشافعي",
      "Ibn Khallikan",
      "Šams al-dīn Abū al-ʿAbbās Aḥmad b. Muḥammad b. Ibrāhīm b. Abī Bakr b. Ḫallikān al-Barmakī al-Irbīlī al-Šāfiʿī"
    ],
    "variations": [
      "Ibn Hallikan",
      "Sams al-din Abu al-ʿAbbas Ahmad b. Muhammad b. Ibrahim b. Abi Bakr b. Hallikan al-Barmaki al-Irbili al-Safiʿi",
      "Sams din Abu ʿAbbas Ahmad b. Muhammad b. Ibrahim b. Abi Bakr b. Hallikan Barmaki Irbili Safiʿi"
    ]
  },
  {
    "names": [
      "زكريا بن محمد بن محمود القزويني (المتوفى : 682هـ)",
      "Zakariya Qazwini",
      "القزويني",
      "زكريّا بن محمّد بن محمود القزويني",
      "زكريا بن محمد القزويني",
      "زكريا بن محمد بن محمود القزويني (المتوفى: 682هـ)"
    ],
    "variations": [
      "زكريا بن محمد بن محمود القزويني"
    ]
  },
  {
    "names": [
      "ابن شداد",
      "Ibn Šaddād",
      "عز الدين أبو عبد الله محمد بن علي بن ابراهيم الأنصاري، الحلبي",
      "Ibn Shaddad",
      "ʿIzz al-dīn Abū ʿAbd Allāh Muḥammad b. ʿAlī b. Ibrāhīm al-Anṣārī, al-Ḥalabī"
    ],
    "variations": [
      "Ibn Saddad",
      "ʿIzz al-din Abu ʿAbd Allah Muhammad b. ʿAli b. Ibrahim al-Ansari, al-Halabi",
      "ʿIzz din Abu ʿAbd Allah Muhammad b. ʿAli b. Ibrahim Ansari, Halabi"
    ]
  },
  {
    "names": [
      "ابن العبري",
      "Ibn al-ʿIbrī",
      "أبو الفرج يوحنان/غريغوريوس بن أهرون الملطي",
      "Ibn Cibri",
      "Abū al-Faraǧ Yūḥannān/Ġirīġūriyūs b. Ahrūn al-Malaṭī"
    ],
    "variations": [
      "Ibn al-ʿIbri",
      "Ibn ʿIbri",
      "Abu al-Farag Yuhannan/Giriguriyus b. Ahrun al-Malati",
      "Abu Farag Yuhannan/Giriguriyus b. Ahrun Malati"
    ]
  },
  {
    "names": [
      "ابن سعيد المغربي",
      "Ibn Saʿīd al-Maġribī",
      "أبو الحسن علي بن موسى بن محمد بن عبد الملك بن سعيد المغربي",
      "Ibn Sacid Maghribi",
      "Abū al-Ḥasan ʿAlī b. Mūsá b. Muḥammad b. ʿAbd al-Malik b. Saʿīd al-Maġribī"
    ],
    "variations": [
      "Ibn Saʿid al-Magribi",
      "Ibn Saʿid Magribi",
      "Abu al-Hasan ʿAli b. Musa b. Muhammad b. ʿAbd al-Malik b. Saʿid al-Magribi",
      "Abu Hasan ʿAli b. Musa b. Muhammad b. ʿAbd Malik b. Saʿid Magribi"
    ]
  },
  {
    "names": [
      "محيي الدين ابن عبد الظاهر",
      "Muḥyī al-Dīn Ibn ʿAbd al-Ẓāhir",
      "محيي الدين أبو الفضل عبدالله بن رشيد الدين بن عبد الظاهر بن نشوان بن عبد الظاهر بن نجدة السعدي، الروحي، الجذامي",
      "Ibn Cabd Zahir",
      "Muḥyī al-Dīn Abū al-Faḍl ʿAbdallāh b. Rašīd al-Dīn b. ʿAbd al-Ẓāhir b. Našwān b. ʿAbd al-Ẓāhir b. Naǧdaŧ al-Saʿdī, al-Rawḥī, al-Ǧuḏāmī"
    ],
    "variations": [
      "Muhyi al-Din Ibn ʿAbd al-Zahir",
      "Muhyi Din Ibn ʿAbd Zahir",
      "Muhyi al-Din Abu al-Fadl ʿAbdallah b. Rasid al-Din b. ʿAbd al-Zahir b. Naswan b. ʿAbd al-Zahir b. Nagdat al-Saʿdi, al-Rawhi, al-Gudami",
      "Muhyi Din Abu Fadl ʿAbdallah b. Rasid Din b. ʿAbd Zahir b. Naswan b. ʿAbd Zahir b. Nagdat Saʿdi, Rawhi, Gudami"
    ]
  },
  {
    "names": [
      "عز الدين الفاروثي",
      "ʿIzz al-Dīn al-Fārūṯī",
      "عز الدين أحمد الفاروثي",
      "Cizz Din Faruthi",
      "ʿIzz al-dīn Aḥmad al-Fārūṯī"
    ],
    "variations": [
      "ʿIzz al-Din al-Faruti",
      "ʿIzz Din Faruti",
      "ʿIzz al-din Ahmad al-Faruti",
      "ʿIzz din Ahmad Faruti"
    ]
  },
  {
    "names": [
      "محب الدين الطبري",
      "Muḥibb al-Dīn al-Ṭabarī",
      "محب الدين أحمد بن عبد الله بن محمد الطبري",
      "Muhibb Din Tabari",
      "Muḥibb al-Dīn Aḥmad b. ʿAbd Allāh b. Muḥammad al-Ṭabarī"
    ],
    "variations": [
      "Muhibb al-Din al-Tabari",
      "Muhibb al-Din Ahmad b. ʿAbd Allah b. Muhammad al-Tabari",
      "Muhibb Din Ahmad b. ʿAbd Allah b. Muhammad Tabari"
    ]
  },
  {
    "names": [
      "ابن الحلبي",
      "Ibn al-Ḥalabī",
      "عز الدين أبو القاسم أحمد بن أبي عبد الله محمد بن أبي القاسم عبد الرحمن بن أبي الحسن علي بن محمد بن محمد بن قاسم بن محمد بن ابراهيم بن محمد بن علي بن عبيد الله بن علي بن عبيد الله بن الحسين بن علي بن الحسين بن علي بن أبي طالب العلوي الحسيني المصري",
      "Ibn Muhammad Husayni",
      "ʿIzz al-Dīn Abū al-Qāsim Aḥmad b. Abī ʿAbd Allāh Muḥammad b. Abī al-Qāsim ʿAbd al-Raḥman b. Abī al-Ḥasan ʿAlī b. Muḥammad b. Muḥammad b. Qāsim b. Muḥammad b. Ibrāhīm b. Muḥammad b. ʿAlī b. ʿUbayd Allāh b. ʿAlī b. ʿUbayd Allāh b. al-Ḥusayn b. ʿAlī b. al-Ḥusayn b. ʿAlī b. Abī Ṭālib al-ʿAlawī al-Ḥusaynī al-Miṣrī"
    ],
    "variations": [
      "Ibn al-Halabi",
      "Ibn Halabi",
      "ʿIzz al-Din Abu al-Qasim Ahmad b. Abi ʿAbd Allah Muhammad b. Abi al-Qasim ʿAbd al-Rahman b. Abi al-Hasan ʿAli b. Muhammad b. Muhammad b. Qasim b. Muhammad b. Ibrahim b. Muhammad b. ʿAli b. ʿUbayd Allah b. ʿAli b. ʿUbayd Allah b. al-Husayn b. ʿAli b. al-Husayn b. ʿAli b. Abi Talib al-ʿAlawi al-Husayni al-Misri",
      "ʿIzz Din Abu Qasim Ahmad b. Abi ʿAbd Allah Muhammad b. Abi Qasim ʿAbd Rahman b. Abi Hasan ʿAli b. Muhammad b. Muhammad b. Qasim b. Muhammad b. Ibrahim b. Muhammad b. ʿAli b. ʿUbayd Allah b. ʿAli b. ʿUbayd Allah b. Husayn b. ʿAli b. Husayn b. ʿAli b. Abi Talib ʿAlawi Husayni Misri"
    ]
  },
  {
    "names": [
      "جمال الدين محمد ابن واصل",
      "Ǧamāl al-Dīn Muḥammad Ibn Wāṣil",
      "جمال الدين أبو عبدالله محمد بن سالم بن نصرالله بن سالم بن واصل المازني التميمي الحموي الشافعي",
      "Ibn Wasil",
      "Ǧamāl al-Dīn Abū ʿAbdallāh Muḥammad b. Sālim b. Naṣrallāh b. Sālim b. Wāṣil al-Māzinī al-Tamīmī al-Ḥamawī al-Šāfiʿī"
    ],
    "variations": [
      "Gamal al-Din Muhammad Ibn Wasil",
      "Gamal Din Muhammad Ibn Wasil",
      "Gamal al-Din Abu ʿAbdallah Muhammad b. Salim b. Nasrallah b. Salim b. Wasil al-Mazini al-Tamimi al-Hamawi al-Safiʿi",
      "Gamal Din Abu ʿAbdallah Muhammad b. Salim b. Nasrallah b. Salim b. Wasil Mazini Tamimi Hamawi Safiʿi"
    ]
  },
  {
    "names": [
      "ابن الرفعة",
      "Ibn al-Rifʿaŧ",
      "نجم الدين أبو العباس أحمد بن محمد بن علي بن حازم بن ابراهيم بن العباس",
      "Ibn Rifca",
      "Naǧm al-dīn Abū al-ʿAbbās Aḥmad b. Muḥammad b. ʿAlī b. Ḥāzim b. Ibrāhīm b. al-ʿAbbās"
    ],
    "variations": [
      "Ibn al-Rifʿat",
      "Ibn Rifʿat",
      "Nagm al-din Abu al-ʿAbbas Ahmad b. Muhammad b. ʿAli b. Hazim b. Ibrahim b. al-ʿAbbas",
      "Nagm din Abu ʿAbbas Ahmad b. Muhammad b. ʿAli b. Hazim b. Ibrahim b. ʿAbbas"
    ]
  },
  {
    "names": [
      "الواسطي، ابن شيخ الحزامية، ابن شيخ الحزامين",
      "al-Wāsiṭī, Ibn Šayḫ al-Ḥazzāmiyyaŧ, Ibn Šayḫ al-Ḥazzāmīn",
      "عماد الدين أبو العباس أحمد بن ابراهيم بن عبد الرحمان بن مسعود بن عمر الواسطي الحزامي",
      "Ibn Ibrahim Cimad Din Wasiti",
      "ʿImād al-dīn Abū al-ʿAbbās Aḥmad b. Ibrāhīm b. ʿAbd al-Raḥmān b. Masʿūd b. ʿUmar al-Wāsiṭī al-Ḥazzāmī"
    ],
    "variations": [
      "al-Wasiti, Ibn Sayh al-Hazzamiyyat, Ibn Sayh al-Hazzamin",
      "Wasiti, Ibn Sayh Hazzamiyyat, Ibn Sayh Hazzamin",
      "ʿImad al-din Abu al-ʿAbbas Ahmad b. Ibrahim b. ʿAbd al-Rahman b. Masʿud b. ʿUmar al-Wasiti al-Hazzami",
      "ʿImad din Abu ʿAbbas Ahmad b. Ibrahim b. ʿAbd Rahman b. Masʿud b. ʿUmar Wasiti Hazzami"
    ]
  },
  {
    "names": [
      "ابن منظور",
      "Ibn Manẓūr",
      "جمال الدين أبو الفضل محمد بن مكرم بن علي بن أحمد الأنصاري الافريقي المصري",
      "Ibn Manzur Ifriqi",
      "Ǧamāl al-dīn Abū al-Faḍl Muḥammad b. Mukarram b. ʿAlī b. Aḥmad al-Anṣārī al-Ifrīqī al-Miṣrī"
    ],
    "variations": [
      "Ibn Manzur",
      "Gamal al-din Abu al-Fadl Muhammad b. Mukarram b. ʿAli b. Ahmad al-Ansari al-Ifriqi al-Misri",
      "Gamal din Abu Fadl Muhammad b. Mukarram b. ʿAli b. Ahmad Ansari Ifriqi Misri"
    ]
  },
  {
    "names": [
      "أبو العباس أحمد بن أحمد بن عبد الله الغبريني",
      "Ahmad Ghibrini",
      "Abū al-ʿAbbās Aḥmad b. Aḥmad b. ʿAbd Al-lãh al-Ġibrīnī"
    ],
    "variations": [
      "Abu al-ʿAbbas Ahmad b. Ahmad b. ʿAbd Al-lah al-Gibrini",
      "Abu ʿAbbas Ahmad b. Ahmad b. ʿAbd lah Gibrini"
    ]
  },
  {
    "names": [
      "علاء الدين ابن عبد الظاهر",
      "ʿAlāʾ al-dīn Ibn ʿAbd al-Ẓāhir",
      "علاء الدين علي بن محمد بن عبد الله بن عبد الظاهر بن نجوان الجذامي، المصري",
      "Cala Din Ibn Cabd Zahir",
      "ʿAlāʾ al-dīn ʿAlī b. Muḥammad b. ʿAbd Allāh b. ʿAbd al-Ẓāhir b. Naǧwān al-Ǧuḏāmī, al-Miṣrī"
    ],
    "variations": [
      "ʿAlaʾ al-din Ibn ʿAbd al-Zahir",
      "ʿAlaʾ din Ibn ʿAbd Zahir",
      "ʿAlaʾ al-din ʿAli b. Muhammad b. ʿAbd Allah b. ʿAbd al-Zahir b. Nagwan al-Gudami, al-Misri",
      "ʿAlaʾ din ʿAli b. Muhammad b. ʿAbd Allah b. ʿAbd Zahir b. Nagwan Gudami, Misri"
    ]
  },
  {
    "names": [
      "الوطواط",
      "al-Waṭwāṭ",
      "برهان الدين، جمال الدين أبو اسحاق محمد بن ابراهيم بن يحيى بن علي الكتبي",
      "Abu Ishaq Watwat",
      "Burhān al-dīn, Ǧamāl al-dīn Abū Isḥāq Muḥammad b. Ibrāhīm b. Yaḥyá b. ʿAlī al-Kutubī"
    ],
    "variations": [
      "al-Watwat",
      "Watwat",
      "Burhan al-din, Gamal al-din Abu Ishaq Muhammad b. Ibrahim b. Yahya b. ʿAli al-Kutubi",
      "Burhan din, Gamal din Abu Ishaq Muhammad b. Ibrahim b. Yahya b. ʿAli Kutubi"
    ]
  },
  {
    "names": [
      "ابن الفوطي",
      "Ibn al-Fuwaṭī",
      "كمال الدين أبو الفضل عبد الرزاق بن أحمد الصابوني، الشيباني",
      "Ibn Fuwati",
      "Kamāl al-dīn Abū al-Faḍl ʿAbd al-Razzāq b. Aḥmad al-Ṣābūnī, al-Šaybānī"
    ],
    "variations": [
      "Ibn al-Fuwati",
      "Kamal al-din Abu al-Fadl ʿAbd al-Razzaq b. Ahmad al-Sabuni, al-Saybani",
      "Kamal din Abu Fadl ʿAbd Razzaq b. Ahmad Sabuni, Saybani"
    ]
  },
  {
    "names": [
      "بيبرس المنصوري الأمير الدوادار",
      "Baybars al-Manṣūrī al-amīr al-dawādār",
      "ركن الدين بيبرس المنصوري",
      "Baybars Mansuri",
      "Rukn al-Dīn Baybars al-Manṣūrī"
    ],
    "variations": [
      "Baybars al-Mansuri al-amir al-dawadar",
      "Baybars Mansuri amir dawadar",
      "Rukn al-Din Baybars al-Mansuri",
      "Rukn Din Baybars Mansuri"
    ]
  },
  {
    "names": [
      "السيواسي",
      "al-Sīwāsī",
      "عبد الله بن عبد العزيز بن موسى السيواسي",
      "Cabd Allah Siwasi",
      "ʿAbd Allāh b. ʿAbd al-ʿAzīz b. Mūsá al-Sīwāsī"
    ],
    "variations": [
      "al-Siwasi",
      "Siwasi",
      "ʿAbd Allah b. ʿAbd al-ʿAziz b. Musa al-Siwasi",
      "ʿAbd Allah b. ʿAbd ʿAziz b. Musa Siwasi"
    ]
  },
  {
    "names": [
      "الحسن العباسي",
      "al-Ḥasan al-ʿAbbāsī",
      "الحسن بن عبد الله العباسي",
      "Hasan Cabbasi",
      "al-Ḥasan b. ʿAbd Allāh al-ʿAbbāsī"
    ],
    "variations": [
      "al-Hasan al-ʿAbbasi",
      "Hasan ʿAbbasi",
      "al-Hasan b. ʿAbd Allah al-ʿAbbasi",
      "Hasan b. ʿAbd Allah ʿAbbasi"
    ]
  },
  {
    "names": [
      "العلامة الحلي",
      "al-ʿAllāmaŧ al-Ḥillī",
      "أبو منصور الحسن بن يونس بن المطهر الأسدي، الحلي",
      "Callama Hilli",
      "Abū Manṣūr al-Ḥasan b. Yūnus b. al-Muṭahhar al-Asadī, al-Ḥillī"
    ],
    "variations": [
      "al-ʿAllamat al-Hilli",
      "ʿAllamat Hilli",
      "Abu Mansur al-Hasan b. Yunus b. al-Mutahhar al-Asadi, al-Hilli",
      "Abu Mansur Hasan b. Yunus b. Mutahhar Asadi, Hilli"
    ]
  },
  {
    "names": [
      "ابن تيمية",
      "Ibn Taymiyyaŧ",
      "تقي الدين أبو العباس أحمد بن عبد الحليم بن عبد السلام بن عبد الله بن الخضر بن محمد بن الخضر بن ابراهيم بن علي بن عبد الله النميري، الحراني",
      "Ibn Taymiyya",
      "Taqī al-dīn Abū al-ʿAbbās Aḥmad b. ʿAbd al-Ḥalīm b. ʿAbd al-Salām b. ʿAbd Allãh b. al-Ḫiḍr b. Muḥammad b. al-Ḫiḍr b. Ibrāhīm b. ʿAlī b. ʿAbd Allãh al-Numayrī, al-Ḥarrānī"
    ],
    "variations": [
      "Ibn Taymiyyat",
      "Taqi al-din Abu al-ʿAbbas Ahmad b. ʿAbd al-Halim b. ʿAbd al-Salam b. ʿAbd Allah b. al-Hidr b. Muhammad b. al-Hidr b. Ibrahim b. ʿAli b. ʿAbd Allah al-Numayri, al-Harrani",
      "Taqi din Abu ʿAbbas Ahmad b. ʿAbd Halim b. ʿAbd Salam b. ʿAbd Allah b. Hidr b. Muhammad b. Hidr b. Ibrahim b. ʿAli b. ʿAbd Allah Numayri, Harrani"
    ]
  },
  {
    "names": [
      "التجيبي",
      "al-Tuǧībī",
      "القاسم بن يوسف بن محمد بن علي التجيبي السبتي البلنسي",
      "Qasim Tujibi",
      "al-Qāsim b. Yūsuf b. Muḥammad b. ʿAlī al-Tuǧībī al-Sabtī al-Balansī"
    ],
    "variations": [
      "al-Tugibi",
      "Tugibi",
      "al-Qasim b. Yusuf b. Muhammad b. ʿAli al-Tugibi al-Sabti al-Balansi",
      "Qasim b. Yusuf b. Muhammad b. ʿAli Tugibi Sabti Balansi"
    ]
  },
  {
    "names": [
      "شافع بن علي",
      "Šāfiʿ b. ʿAlī",
      "ناصر الدين شافع بن علي بن عباس بن اسماعيل بن عساكر الكناني العسقلاني المصري",
      "Shafic Ibn Cali",
      "Nāṣir al-Dīn Šāfiʿ b. ʿAlī b. ʿAbbās b. Ismāʿīl b. ʿAsākir al-Kinānī al-ʿAsqalānī al-Miṣrī"
    ],
    "variations": [
      "Safiʿ b. ʿAli",
      "Nasir al-Din Safiʿ b. ʿAli b. ʿAbbas b. Ismaʿil b. ʿAsakir al-Kinani al-ʿAsqalani al-Misri",
      "Nasir Din Safiʿ b. ʿAli b. ʿAbbas b. Ismaʿil b. ʿAsakir Kinani ʿAsqalani Misri"
    ]
  },
  {
    "names": [
      "أبو لفداء",
      "Abū l-Fidāʾ",
      "الملك المؤيد عماد الدين أبو لفداء اسماعيل بن الملك الأفضل نور الدين أبي لحسن علي بن السلطان الملك المظفر تقي الدين أبو الفتح محمود بن السلطان الملك المنصور ناصر الدين أبو المعلا محمد بن السلطان الملك المظفر تقي الدين أبو الخطاب عمر بن شاهنشاه بن أيوب",
      "Abu Fida",
      "al-Malik al-Muʾayyad ʿImād al-Dīn Abū l-Fidāʾ Ismāʿīl b. al-Malik al-Afḍal Nūr al-Dīn Abī l-Ḥasan ʿAlī b. al-Sulṭān al-Malik al-Muẓaffar Taqī al-Dīn Abū al-Fatḥ Maḥmūd b. al-sulṭān al-Malik al-Manṣūr Nāṣir al-Dīn Abū al-Maʿallā Muḥammad b. al-sulṭān al-Malik al-Muẓaffar Taqī al-Dīn Abū al-Ḫaṭṭāb ʿUmar b. Šāhanšāh b. Ayyūb"
    ],
    "variations": [
      "Abu l-Fidaʾ",
      "al-Malik al-Muʾayyad ʿImad al-Din Abu l-Fidaʾ Ismaʿil b. al-Malik al-Afdal Nur al-Din Abi l-Hasan ʿAli b. al-Sultan al-Malik al-Muzaffar Taqi al-Din Abu al-Fath Mahmud b. al-sultan al-Malik al-Mansur Nasir al-Din Abu al-Maʿalla Muhammad b. al-sultan al-Malik al-Muzaffar Taqi al-Din Abu al-Hattab ʿUmar b. Sahansah b. Ayyub",
      "Malik Muʾayyad ʿImad Din Abu l-Fidaʾ Ismaʿil b. Malik Afdal Nur Din Abi l-Hasan ʿAli b. Sultan Malik Muzaffar Taqi Din Abu Fath Mahmud b. sultan Malik Mansur Nasir Din Abu Maʿalla Muhammad b. sultan Malik Muzaffar Taqi Din Abu Hattab ʿUmar b. Sahansah b. Ayyub"
    ]
  },
  {
    "names": [
      "الجندي",
      "al-Ǧanadī",
      "بهاء الدين أبو عبد الله محمد بن يعقوب بن يوسف الجندي السكسكي الكندي",
      "Ibn Yacqub Janadi",
      "Bahāʾ al-dīn Abū ʿAbd al-lãh Muḥammad b. Yaʿqūb b. Yūsuf al-Ǧanadī al-Saksakī al-Kindī"
    ],
    "variations": [
      "al-Ganadi",
      "Ganadi",
      "Bahaʾ al-din Abu ʿAbd al-lah Muhammad b. Yaʿqub b. Yusuf al-Ganadi al-Saksaki al-Kindi",
      "Bahaʾ din Abu ʿAbd lah Muhammad b. Yaʿqub b. Yusuf Ganadi Saksaki Kindi"
    ]
  },
  {
    "names": [
      "شهاب الدين النويري",
      "Šihāb al-Dīn al-Nuwayrī",
      "شهاب الدين أحمد بن عبد الوهاب بن محمد بن عبد الدائم القرشي التيمي البكري النويري",
      "Nuwayri",
      "Šihāb al-Dīn Aḥmad b. ʿAbd al-Wahhāb b. Muḥammad b. ʿAbd al-Dāʾim al-Qurašī al-Tīmī al-Bakrī al-Nuwayrī"
    ],
    "variations": [
      "Sihab al-Din al-Nuwayri",
      "Sihab Din Nuwayri",
      "Sihab al-Din Ahmad b. ʿAbd al-Wahhab b. Muhammad b. ʿAbd al-Daʾim al-Qurasi al-Timi al-Bakri al-Nuwayri",
      "Sihab Din Ahmad b. ʿAbd Wahhab b. Muhammad b. ʿAbd Daʾim Qurasi Timi Bakri Nuwayri"
    ]
  },
  {
    "names": [
      "ابن سيد الناس",
      "Ibn Sayyid al-Nās",
      "فتح الدين أبو الفتح محمد الاشبيلي",
      "Ibn Sayyid Nas",
      "Fatḥ al-dīn Abū al-Fatḥ Muḥammad al-Išbīlī"
    ],
    "variations": [
      "Ibn Sayyid al-Nas",
      "Fath al-din Abu al-Fath Muhammad al-Isbili",
      "Fath din Abu Fath Muhammad Isbili"
    ]
  },
  {
    "names": [
      "ابن الدواداري",
      "Ibn al-Dawādārī",
      "سيف الدين أبو بكر بن عبد الله بن أيبك الدواداري",
      "Ibn Dawadari",
      "Sayf al-Dīn Abū Bakr b. ʿAbd Allāh b. Aybak al-Dawādārī"
    ],
    "variations": [
      "Ibn al-Dawadari",
      "Sayf al-Din Abu Bakr b. ʿAbd Allah b. Aybak al-Dawadari",
      "Sayf Din Abu Bakr b. ʿAbd Allah b. Aybak Dawadari"
    ]
  },
  {
    "names": [
      "المزي",
      "al-Mizzī",
      "جمال الدين أبو الحجاج يوسف بن الزكي عبد الرحمىن بن يوسف الكلبي القضاعي المزي",
      "Mizzi",
      "Ǧamāl al-dīn Abū al-Ḥaǧǧāǧ Yūsuf b. al-Zakī ʿAbd al-Raḥmán b. Yūsuf al-Kalbī al-Quḍāʿī al-Mizzī"
    ],
    "variations": [
      "al-Mizzi",
      "Gamal al-din Abu al-Haggag Yusuf b. al-Zaki ʿAbd al-Rahman b. Yusuf al-Kalbi al-Qudaʿi al-Mizzi",
      "Gamal din Abu Haggag Yusuf b. Zaki ʿAbd Rahman b. Yusuf Kalbi Qudaʿi Mizzi"
    ]
  },
  {
    "names": [
      "يحيى بن حمز العلوي، المؤيد بالله",
      "Yaḥyá b. Ḥamza al-ʿAlawī, al-Muʾayyad bi-Allāh",
      "المؤيد بالله يحيى بن حمز بن علي بن ابراهيم الحسيني العلوي الطالبي",
      "Muayyad Yahya Ibn Hamza Calawi",
      "al-Muʾayyad bi-Allāh Yaḥyá b. Ḥamza b. ʿAlī b. Ibrāhīm al-Ḥusaynī al-ʿAlawī al-Ṭālibī"
    ],
    "variations": [
      "Yahya b. Hamza al-ʿAlawi, al-Muʾayyad bi-Allah",
      "Yahya b. Hamza ʿAlawi, Muʾayyad bi-Allah",
      "al-Muʾayyad bi-Allah Yahya b. Hamza b. ʿAli b. Ibrahim al-Husayni al-ʿAlawi al-Talibi",
      "Muʾayyad bi-Allah Yahya b. Hamza b. ʿAli b. Ibrahim Husayni ʿAlawi Talibi"
    ]
  },
  {
    "names": [
      "اليونيني",
      "al-Yūnīnī",
      "محيي الدين أبو محمد عبد القادر بن علي بن محمد اليونيني البعلبكي",
      "Muhyi Din Yunini",
      "Muḥyī al-dīn Abū Muḥammad ʿAbd al-Qādir b. ʿAlī b. Muḥammad al-Yūnīnī al-Baʿlbakkī"
    ],
    "variations": [
      "al-Yunini",
      "Yunini",
      "Muhyi al-din Abu Muhammad ʿAbd al-Qadir b. ʿAli b. Muhammad al-Yunini al-Baʿlbakki",
      "Muhyi din Abu Muhammad ʿAbd Qadir b. ʿAli b. Muhammad Yunini Baʿlbakki"
    ]
  },
  {
    "names": [
      "أبو الفضل الأدفويىلأدفوي",
      "Abū al-faḍl al-Adfuwī/al-Udfuwī",
      "كمال الدين أبو الفضل جعفر بن ثعلب الأدفويىلأدفوي",
      "Adfuwi",
      "Kamāl -al-Dīn Abū al-faḍl Ǧaʿfar b. Ṯaʿlab al-Adfuwī/al-Udfuwī"
    ],
    "variations": [
      "Abu al-fadl al-Adfuwi/al-Udfuwi",
      "Abu fadl Adfuwi/Udfuwi",
      "Kamal -al-Din Abu al-fadl Gaʿfar b. Taʿlab al-Adfuwi/al-Udfuwi",
      "Kamal -Din Abu fadl Gaʿfar b. Taʿlab Adfuwi/Udfuwi"
    ]
  },
  {
    "names": [
      "الذهبي",
      "al-Ḏahabī",
      "شمس الدين أبو عبد الله محمد بن أحمد بن عثمان بن قايماظ بن عبد الله التركماني، الفارقي، الدمشقي، الشافعي، المؤرخ، الحافظ، الذهبي",
      "Dhahabi",
      "Šams al-dīn Abū ʿAbd Allãh Muḥammad b. Aḥmad b. ʿUṯmān b. Qāymāẓ b. ʿAbd Allãh al-Turkumānī, al-Fāriqī, al-Dimašqī, al-Šāfiʿī, al-Muʾarriḫ, al-Ḥāfiẓ, al-Ḏahabī"
    ],
    "variations": [
      "al-Dahabi",
      "Dahabi",
      "Sams al-din Abu ʿAbd Allah Muhammad b. Ahmad b. ʿUtman b. Qaymaz b. ʿAbd Allah al-Turkumani, al-Fariqi, al-Dimasqi, al-Safiʿi, al-Muʾarrih, al-Hafiz, al-Dahabi",
      "Sams din Abu ʿAbd Allah Muhammad b. Ahmad b. ʿUtman b. Qaymaz b. ʿAbd Allah Turkumani, Fariqi, Dimasqi, Safiʿi, Muʾarrih, Hafiz, Dahabi"
    ]
  },
  {
    "names": [
      "ابن الأكفاني",
      "Ibn al-Akfānī",
      "شمس الدين أبو عبد الله محمد بن ابراهيم بن سعيد الأنصاري الأكفاني",
      "Ibn Akfani Sinjari",
      "Šams al-dīn Abū ʿAbd Al-lãh Muḥammad b. Ibrāhīm b. Saʿīd al-Anṣārī al-Akfānī"
    ],
    "variations": [
      "Ibn al-Akfani",
      "Ibn Akfani",
      "Sams al-din Abu ʿAbd Al-lah Muhammad b. Ibrahim b. Saʿid al-Ansari al-Akfani",
      "Sams din Abu ʿAbd lah Muhammad b. Ibrahim b. Saʿid Ansari Akfani"
    ]
  },
  {
    "names": [
      "ابن فضل الله العمري",
      "Ibn Faḍl Allāh al-ʿUmarī",
      "شهاب الدين أبو العباس أحمد بن يحيى بن فضل الله القرشي، العدوي، العمري",
      "Ibn Fadl Allah Cumari",
      "Šihāb al-dīn Abū al-ʿAbbās Aḥmad b. Yaḥyá b. Faḍl Allāh al-Qurašī, al-ʿAdawī, al-ʿUmarī"
    ],
    "variations": [
      "Ibn Fadl Allah al-ʿUmari",
      "Ibn Fadl Allah ʿUmari",
      "Sihab al-din Abu al-ʿAbbas Ahmad b. Yahya b. Fadl Allah al-Qurasi, al-ʿAdawi, al-ʿUmari",
      "Sihab din Abu ʿAbbas Ahmad b. Yahya b. Fadl Allah Qurasi, ʿAdawi, ʿUmari"
    ]
  },
  {
    "names": [
      "ابن جابر الوادي آشي",
      "Ibn Ǧābir al-Wādī Āšī",
      "شمس الدين أبو عبد الله محمد بن جابر بن محمد بن قاسم بن أحمد بن ابراهيم بن حسان القيسي الوادي آشي",
      "Ibn Jabir Wadi Ashi",
      "Šams al-dīn Abū ʿAbd Al-lãh Muḥammad b. Ǧābir b. Muḥammad b. Qāsim b. Aḥmad b. Ibrāhīm b. Ḥassān al-Qaysī al-Wādī Āšī"
    ],
    "variations": [
      "Ibn Gabir al-Wadi Asi",
      "Ibn Gabir Wadi Asi",
      "Sams al-din Abu ʿAbd Al-lah Muhammad b. Gabir b. Muhammad b. Qasim b. Ahmad b. Ibrahim b. Hassan al-Qaysi al-Wadi Asi",
      "Sams din Abu ʿAbd lah Muhammad b. Gabir b. Muhammad b. Qasim b. Ahmad b. Ibrahim b. Hassan Qaysi Wadi Asi"
    ]
  },
  {
    "names": [
      "القزويني",
      "al-Qazwīnī",
      "سراج الدين أبو حفص عمر بن علي بن عمر القزويني",
      "Abu Hafs Qazwini",
      "Sirāǧ al-dīn Abū Ḥafṣ ʿUmar b. ʿAlī b. ʿUmar al-Qazwīnī"
    ],
    "variations": [
      "al-Qazwini",
      "Qazwini",
      "Sirag al-din Abu Hafs ʿUmar b. ʿAli b. ʿUmar al-Qazwini",
      "Sirag din Abu Hafs ʿUmar b. ʿAli b. ʿUmar Qazwini"
    ]
  },
  {
    "names": [
      "ابن ليون",
      "Ibn Luyūn",
      "أبو عثمان سعد، سعيد بن أحمد بن ابراهيم بن أحمد التجيبي",
      "Ibn Luyun Tujibi",
      "Abū ʿUṯmān Saʿd, Saʿīd b. Aḥmad b. Ibrāhīm b. Aḥmad al-Tuǧībī"
    ],
    "variations": [
      "Ibn Luyun",
      "Abu ʿUtman Saʿd, Saʿid b. Ahmad b. Ibrahim b. Ahmad al-Tugibi",
      "Abu ʿUtman Saʿd, Saʿid b. Ahmad b. Ibrahim b. Ahmad Tugibi"
    ]
  },
  {
    "names": [
      "تقي الدين السبكي",
      "Taqī al-dīn al-Subkī",
      "تقي الدين أبو الحسن علي بن عبد الكافي السبكي الكبير",
      "Taqi Din Subki",
      "Taqī al-dīn Abū al-Ḥasan ʿAlī b. ʿAbd al-Kāfī al-Subkī al-kabīr"
    ],
    "variations": [
      "Taqi al-din al-Subki",
      "Taqi din Subki",
      "Taqi al-din Abu al-Hasan ʿAli b. ʿAbd al-Kafi al-Subki al-kabir",
      "Taqi din Abu Hasan ʿAli b. ʿAbd Kafi Subki kabir"
    ]
  },
  {
    "names": [
      "نجم الدين ابراهيم بن علي الطرسوسي",
      "Naǧm al-Dīn Ibrāhīm b. ʿAlī al-Ṭarasūsī",
      "نجم الدين ابراهيم بن علي بن عبد الوحيد الطرسوسي",
      "Najm Din Tarsusi",
      "Naǧm al-Dīn Ibrāhīm b. ʿAlī b. ʿAbd al-Waḥīd al-Ṭarasūsī"
    ],
    "variations": [
      "Nagm al-Din Ibrahim b. ʿAli al-Tarasusi",
      "Nagm Din Ibrahim b. ʿAli Tarasusi",
      "Nagm al-Din Ibrahim b. ʿAli b. ʿAbd al-Wahid al-Tarasusi",
      "Nagm Din Ibrahim b. ʿAli b. ʿAbd Wahid Tarasusi"
    ]
  },
  {
    "names": [
      "علاء الدين أبو عبدالله مغلطاي بن قليج بن عبدالله البكجري، الحكري، الحنفي",
      "Mughultay Ibn Qilij",
      "ʿAlāʾ al-dīn Abū ʿAbd-Allāh Muġulṭāy b. Ḳilīǧ b. ʿAbd-Allāh al-Bakǧarī, al-Ḥikrī, al-Ḥanafī"
    ],
    "variations": [
      "ʿAlaʾ al-din Abu ʿAbd-Allah Mugultay b. Kilig b. ʿAbd-Allah al-Bakgari, al-Hikri, al-Hanafi",
      "ʿAlaʾ din Abu ʿAbd-Allah Mugultay b. Kilig b. ʿAbd-Allah Bakgari, Hikri, Hanafi"
    ]
  },
  {
    "names": [
      "الصفدي",
      "al-ṣafadī",
      "صلاح الدين أبو الصفاء خليل بن أيبك الصفدي",
      "Safadi",
      "Ṣalāḥ al-dīn Abū al-Ṣafāʾ Ḫalīl b. Aybak al-ṣafadī"
    ],
    "variations": [
      "al-safadi",
      "safadi",
      "Salah al-din Abu al-Safaʾ Halil b. Aybak al-safadi",
      "Salah din Abu Safaʾ Halil b. Aybak safadi"
    ]
  },
  {
    "names": [
      "أبو يزيد خالد بن عيسى بن أحمد خالد بن عيسى البلوي",
      "Balawi",
      "Abū Yazīd Ḫālid b. ʿĪsá b. Aḥmad Ḫālid b. ʿĪsá al-Balawī"
    ],
    "variations": [
      "Abu Yazid Halid b. ʿIsa b. Ahmad Halid b. ʿIsa al-Balawi",
      "Abu Yazid Halid b. ʿIsa b. Ahmad Halid b. ʿIsa Balawi"
    ]
  },
  {
    "names": [
      "اليافعي",
      "al-Yāfiʿī",
      "عفيف الدين أبو محمد عبد الله بن أسعد بن علي بن سليمان اليافعي، اليمني، المكي",
      "Yafici",
      "ʿAfīf al-dīn Abū Muḥammad ʿAbd Allāh b. Asʿad b. ʿAlī b. Sulaymān al-Yāfiʿī, al-Yamanī, al-Makkī"
    ],
    "variations": [
      "al-Yafiʿi",
      "Yafiʿi",
      "ʿAfif al-din Abu Muhammad ʿAbd Allah b. Asʿad b. ʿAli b. Sulayman al-Yafiʿi, al-Yamani, al-Makki",
      "ʿAfif din Abu Muhammad ʿAbd Allah b. Asʿad b. ʿAli b. Sulayman Yafiʿi, Yamani, Makki"
    ]
  },
  {
    "names": [
      "السبكي",
      "al-Subkī",
      "تاج الدين أبو نصر عبد الوهاب بن علي بن عبد الكافي بن علي بن تمام بن يوسف بن موسى بن تمام بن حامد بن عمر بن عثمان بن علي الأنصاري ألخزرجي السبكي",
      "Taj Din Subki",
      "Tāǧ al-dīn Abū Naṣr ʿAbd al-Wahhāb b. ʿAlī b. ʿAbd al-kāfī b. ʿAlī b. Tammām b. Yūsuf b. Mūsá b. Tammām b. Ḥāmid b. ʿUmar b. ʿUṯmān b. ʿAlī al-Anṣārī alḪazraǧī al-Subkī"
    ],
    "variations": [
      "al-Subki",
      "Subki",
      "Tag al-din Abu Nasr ʿAbd al-Wahhab b. ʿAli b. ʿAbd al-kafi b. ʿAli b. Tammam b. Yusuf b. Musa b. Tammam b. Hamid b. ʿUmar b. ʿUtman b. ʿAli al-Ansari alHazragi al-Subki",
      "Tag din Abu Nasr ʿAbd Wahhab b. ʿAli b. ʿAbd kafi b. ʿAli b. Tammam b. Yusuf b. Musa b. Tammam b. Hamid b. ʿUmar b. ʿUtman b. ʿAli Ansari alHazragi Subki"
    ]
  },
  {
    "names": [
      "ابن كثير",
      "Ibn Kaṯīr",
      "عماد الدين أبوالفداء اسماعيل بن عمر بن كثير القرشي، البصري، الدمشقي",
      "Ibn Kathir",
      "ʿImād al-dīn Abū-al-Fadāʾ Ismāʿīl b. ʿUmar b. Kaṯīr al-Qarašī, al-Baṣrī, al-Dimašqī"
    ],
    "variations": [
      "Ibn Katir",
      "ʿImad al-din Abu-al-Fadaʾ Ismaʿil b. ʿUmar b. Katir al-Qarasi, al-Basri, al-Dimasqi",
      "ʿImad din Abu-Fadaʾ Ismaʿil b. ʿUmar b. Katir Qarasi, Basri, Dimasqi"
    ]
  },
  {
    "names": [
      "ابن أبي الوفاء",
      "Ibn Abi Wafa",
      "عبد القادر بن أبي الوفاء محمد بن أبي الوفاء القرشي أبو محمد",
      "عبد القادر بن محمد بن نصر الله القرشي، أبو محمد، محيي الدين الحنفي (المتوفى: 775هـ)",
      "عبد القادر بن محمد بن نصر الله القرشي، أبو محمد، محيي الدين الحنفي",
      "الواحدي :: عَبْد القَادِر القُرَشي"
    ],
    "variations": [
      "الواحدي :: عبد القادر القرشي"
    ]
  },
  {
    "names": [
      "جمال الدين السرمري",
      "Ǧamāl al-dīn al-Surramarrī",
      "جمال الدين أبو المظفر يوسف بن محمد بن مسعود العبادي الحنبلي السرمري",
      "Jamal Din Surramarri",
      "Ǧamāl al-dīn Abū al-Muẓaffar Yūsuf b. Muḥammad b. Masʿūd al-ʿIbādī al-Ḥanbalī al-Surramarrī"
    ],
    "variations": [
      "Gamal al-din al-Surramarri",
      "Gamal din Surramarri",
      "Gamal al-din Abu al-Muzaffar Yusuf b. Muhammad b. Masʿud al-ʿIbadi al-Hanbali al-Surramarri",
      "Gamal din Abu Muzaffar Yusuf b. Muhammad b. Masʿud ʿIbadi Hanbali Surramarri"
    ]
  },
  {
    "names": [
      "البلنسي",
      "al-Balansī",
      "أبو عبد الله محمد بن علي البلنسي",
      "Balansi",
      "Abū ʿAbd Allāh Muḥammad b. ʿAlī al-Balansī"
    ],
    "variations": [
      "al-Balansi",
      "Abu ʿAbd Allah Muhammad b. ʿAli al-Balansi",
      "Abu ʿAbd Allah Muhammad b. ʿAli Balansi"
    ]
  },
  {
    "names": [
      "زين الدين أبو الفرج عبد الرحمان بن أحمد بن رجب عبد الرحمان بن الحسن بن محمد بن أبي البركات مسعود البغدادي السلامي الدمشقي",
      "Ibn Rajab Hanbali",
      "Zayn al-Dīn Abū al-Faraǧ ʿAbd al-Raḥmān b. Aḥmad b. Raǧab ʿAbd al-Raḥmān b. al-Ḥasan b. Muḥammad b. Abī al-Barakāt Masʿūd al-Baġdādī al-Salāmī al-Dimašqī"
    ],
    "variations": [
      "Zayn al-Din Abu al-Farag ʿAbd al-Rahman b. Ahmad b. Ragab ʿAbd al-Rahman b. al-Hasan b. Muhammad b. Abi al-Barakat Masʿud al-Bagdadi al-Salami al-Dimasqi",
      "Zayn Din Abu Farag ʿAbd Rahman b. Ahmad b. Ragab ʿAbd Rahman b. Hasan b. Muhammad b. Abi Barakat Masʿud Bagdadi Salami Dimasqi"
    ]
  },
  {
    "names": [
      "ابن فرحون",
      "Ibn Farḥūn",
      "برهان الدين، نور الدين ابراهيم بن علي بن محمد بن فرحون اليعمري المالكي",
      "Ibn Farhun",
      "Burhān al-dīn, Nūr al-dīn Ibrāhīm b. ʿAlī b. Muḥammad b. Farḥūn al-Yaʿmarī al-Mālikī"
    ],
    "variations": [
      "Burhan al-din, Nur al-din Ibrahim b. ʿAli b. Muhammad b. Farhun al-Yaʿmari al-Maliki",
      "Burhan din, Nur din Ibrahim b. ʿAli b. Muhammad b. Farhun Yaʿmari Maliki"
    ]
  },
  {
    "names": [
      "زين الدين العراقي",
      "Zayn al-Dīn al-ʿIrāqī",
      "زين الدين أبو الفضل عبد الرحيم بن الحسين بن عبد الرحمن بن أبي بكر بن ابراهيم العراقي",
      "Ibn Husayn Zayn Din Ciraqi",
      "Zayn al-dīn Abū al-Faḍl ʿAbd al-Raḥīm b. al-Ḥusayn b. ʿAbd al-Raḥmãn b. Abī Bakr b. Ibrāhīm al-ʿIrāqī"
    ],
    "variations": [
      "Zayn al-Din al-ʿIraqi",
      "Zayn Din ʿIraqi",
      "Zayn al-din Abu al-Fadl ʿAbd al-Rahim b. al-Husayn b. ʿAbd al-Rahman b. Abi Bakr b. Ibrahim al-ʿIraqi",
      "Zayn din Abu Fadl ʿAbd Rahim b. Husayn b. ʿAbd Rahman b. Abi Bakr b. Ibrahim ʿIraqi"
    ]
  },
  {
    "names": [
      "ابن الفرات",
      "Ibn al-Furāt",
      "ناصر الدين محمد بن عبد الرحيم بن علي المصري الحنفي",
      "Ibn Furat",
      "Nāṣir al-Dīn Muḥammad b. ʿAbd al-Raḥīm b. ʿAlī al-Miṣrī al-Ḥanafī"
    ],
    "variations": [
      "Ibn al-Furat",
      "Nasir al-Din Muhammad b. ʿAbd al-Rahim b. ʿAli al-Misri al-Hanafi",
      "Nasir Din Muhammad b. ʿAbd Rahim b. ʿAli Misri Hanafi"
    ]
  },
  {
    "names": [
      "ابن خلدون",
      "Ibn Ḫaldūn",
      "والي الدين أبو زيد عبد الرحمان بن محمد بن محمد بن أبي بكر محمد بن الحسن بن خلدون الحضرمي الاشبيلي",
      "Ibn Khaldun",
      "Wālī al-dīn Abū Zayd ʿAbd al-Raḥmān b. Muḥammad b. Muḥammad b. Abī Bakr Muḥammad b. al-Ḥasan b. Ḫaldūn al-Ḥaḍramī al-Išbīlī"
    ],
    "variations": [
      "Ibn Haldun",
      "Wali al-din Abu Zayd ʿAbd al-Rahman b. Muhammad b. Muhammad b. Abi Bakr Muhammad b. al-Hasan b. Haldun al-Hadrami al-Isbili",
      "Wali din Abu Zayd ʿAbd Rahman b. Muhammad b. Muhammad b. Abi Bakr Muhammad b. Hasan b. Haldun Hadrami Isbili"
    ]
  },
  {
    "names": [
      "الغزلي",
      "al-Ġuzulī",
      "علاء الدين علي بن عبد الله البهائي الدمشقي الغزلي",
      "Ghuzuli",
      "ʿAlāʾ al-Dīn ʿAlī b. ʿAbd Allāh al-Bahāʾī al-Dimašqī al-Ġuzulī"
    ],
    "variations": [
      "al-Guzuli",
      "Guzuli",
      "ʿAlaʾ al-Din ʿAli b. ʿAbd Allah al-Bahaʾi al-Dimasqi al-Guzuli",
      "ʿAlaʾ Din ʿAli b. ʿAbd Allah Bahaʾi Dimasqi Guzuli"
    ]
  },
  {
    "names": [
      "ابن الشحنة",
      "Ibn al-Šiḥnaŧ",
      "محب الدين أبو الوليد محمد بن محمد بن محمد بن محمود بن غازي بن أيوب بن محمود بن الختلو بن الشحنة الحلبي الحنفي",
      "Muhibb Din Ibn Shihna",
      "Muḥibb al-Dīn Abū al-Walīd Muḥammad b. Muḥammad b. Muḥammad b. Maḥmūd b. Ġāzī b. Ayyūb b. Maḥmūd b. al-Ḫatlū b. al-Šiḥnaŧ al-Ḥalabī al-Ḥanafī"
    ],
    "variations": [
      "Ibn al-Sihnat",
      "Ibn Sihnat",
      "Muhibb al-Din Abu al-Walid Muhammad b. Muhammad b. Muhammad b. Mahmud b. Gazi b. Ayyub b. Mahmud b. al-Hatlu b. al-Sihnat al-Halabi al-Hanafi",
      "Muhibb Din Abu Walid Muhammad b. Muhammad b. Muhammad b. Mahmud b. Gazi b. Ayyub b. Mahmud b. Hatlu b. Sihnat Halabi Hanafi"
    ]
  },
  {
    "names": [
      "القلقشندي، الفزاريو الشافعي",
      "al-Qalqašandī, al-Fazārīو al-Šāfiʿī",
      "شهاب الدين أبو العباس أحمد بن علي بن أحمد بن عبد الله القلقشندي",
      "Qalqashandi",
      "Šihāb al-dīn Abū al-ʿAbbās Aḥmad b. ʿAlī b. Aḥmad b. ʿAbd Allāh al-Qalqašandī"
    ],
    "variations": [
      "al-Qalqasandi, al-Fazariو al-Safiʿi",
      "Qalqasandi, Fazariو Safiʿi",
      "Sihab al-din Abu al-ʿAbbas Ahmad b. ʿAli b. Ahmad b. ʿAbd Allah al-Qalqasandi",
      "Sihab din Abu ʿAbbas Ahmad b. ʿAli b. Ahmad b. ʿAbd Allah Qalqasandi"
    ]
  },
  {
    "names": [
      "التقي الفاسي",
      "Taqi Fasi",
      "تقي الدين أبي الطيب محمد بن أحمد الحسني الفاسي المكي",
      "محمد بن أحمد بن علي، تقي الدين، أبو الطيب المكي الحسني الفاسي",
      "تقي الدين محمّد بن أحمد الحسني الفاسي المكّي",
      "تقي الدين محمد بن أحمد الحسني الفاسى المكي (المتوفى: 832 هـ)",
      "al-Fāsī, Taqī al-Dīn Abu l-Ṭayyib Muḥammad b. Shihāb al-Dīn b. al-ʿAbbās Aḥmad b. ʿAlī al-Ḥusaynī al-Makkī al-Mālikī",
      "محمد بن أحمد الفاسي المكي أبو الطيب",
      "أبو الطيب",
      "محمد بن أحمد بن علي، تقي الدين، أبو الطيب المكي الحسني الفاسي (المتوفى: 832هـ)",
      "محمد بن أحمد الفاسي"
    ],
    "variations": [
      "تقي الدين محمد بن أحمد الحسني الفاسي المكي",
      "al-Fasi, Taqi al-Din Abu l-Tayyib Muhammad b. Shihab al-Din b. al-ʿAbbas Ahmad b. ʿAli al-Husayni al-Makki al-Maliki",
      "Fasi, Taqi Din Abu l-Tayyib Muhammad b. Shihab Din b. ʿAbbas Ahmad b. ʿAli Husayni Makki Maliki"
    ]
  },
  {
    "names": [
      "al-Shaybī, Jamāl al-Dīn Muḥammad b. ʿAlī al-Qurashī al-ʿAbdarī",
      "Shaybi"
    ],
    "variations": [
      "al-Shaybi, Jamal al-Din Muhammad b. ʿAli al-Qurashi al-ʿAbdari",
      "Shaybi, Jamal Din Muhammad b. ʿAli Qurashi ʿAbdari"
    ]
  },
  {
    "names": [
      "ابن حجة الحموي، تقي الدين أبو بكر بن علي بن عبد الله الحموي الأزراري (المتوفى: 837هـ)",
      "Ibn Hijja Hamawi",
      "ابن حجة الحموي",
      "ابن حجة الحموي ، تقي الدين أبو بكر بن علي (المتوفى : 837هـ)",
      "ابن حجة الحموي، تقي الدين أبو بكر بن علي (المتوفى: 837هـ)",
      "تقي الدين أبي بكر بن علي بن عبد الله التقي الحموي المعروف ابن حجة",
      "تقي الدين أبي بكرعلي المعروف بابن حجة الحموي",
      "Ibn Ḥijja al-Ḥamawī, Taqī al-Dīn Abū Bakr b. ʿAlī"
    ],
    "variations": [
      "Ibn Hijja al-Hamawi, Taqi al-Din Abu Bakr b. ʿAli",
      "Ibn Hijja Hamawi, Taqi Din Abu Bakr b. ʿAli"
    ]
  },
  {
    "names": [
      "ابن الوزير",
      "Ibn al-Wazīr",
      "عز الدين أبو عبد الله محمد بن ابراهيم بن علي بن المرتضى بن المفضل الحسني، القاسمي، اليمني",
      "Ibn Wazir Yamani",
      "ʿIzz al-Dīn Abū ʿAbd Allāh Muḥammad b. Ibrāhīm b. ʿAlī b. al-Murtaḍá b. al-Mufaḍḍal al-Ḥasanī, al-Qāsimī, al-Yamanī"
    ],
    "variations": [
      "Ibn al-Wazir",
      "Ibn Wazir",
      "ʿIzz al-Din Abu ʿAbd Allah Muhammad b. Ibrahim b. ʿAli b. al-Murtada b. al-Mufaddal al-Hasani, al-Qasimi, al-Yamani",
      "ʿIzz Din Abu ʿAbd Allah Muhammad b. Ibrahim b. ʿAli b. Murtada b. Mufaddal Hasani, Qasimi, Yamani"
    ]
  },
  {
    "names": [
      "ابن ناصر الدين",
      "Ibn Nāṣir al-dīn",
      "شمس الدين محمد بن أبي بكر عبد الله بن محمد بن أحمد بن مجاهد القيسي الدمشقي الشافعي",
      "Ibn Nasir Din Dimashqi",
      "Šams al-dīn Muḥammad b. Abī Bakr ʿAbd Al-lảh b. Muḥammad b. Aḥmad b. Muǧāhid al-Qaysī al-Dimašqī al-Šāfiʿī"
    ],
    "variations": [
      "Ibn Nasir al-din",
      "Ibn Nasir din",
      "Sams al-din Muhammad b. Abi Bakr ʿAbd Al-lah b. Muhammad b. Ahmad b. Mugahid al-Qaysi al-Dimasqi al-Safiʿi",
      "Sams din Muhammad b. Abi Bakr ʿAbd lah b. Muhammad b. Ahmad b. Mugahid Qaysi Dimasqi Safiʿi"
    ]
  },
  {
    "names": [
      "ابن خطيب الناصري",
      "Ibn Ḫaṭīb al-Nāṣiriyya",
      "علاء الدين أبو الحسن علي بن محمد بنسعد الطائي، الجبريني، الشافعي",
      "Ibn Khatib Nasiriyya",
      "ʿAlāʾ al-dīn Abū al-Ḥasan ʿAlī b. Muḥammad b.Saʿd al-Ṭāʾī, al-Ǧibrīnī, al-Šāfiʿī"
    ],
    "variations": [
      "Ibn Hatib al-Nasiriyya",
      "Ibn Hatib Nasiriyya",
      "ʿAlaʾ al-din Abu al-Hasan ʿAli b. Muhammad b.Saʿd al-Taʾi, al-Gibrini, al-Safiʿi",
      "ʿAlaʾ din Abu Hasan ʿAli b. Muhammad b.Saʿd Taʾi, Gibrini, Safiʿi"
    ]
  },
  {
    "names": [
      "المقريزي",
      "al-Maqrīzī",
      "تقي الدين أبو العباس أحمد بن علي بن عبد القادر العبيدي، المقريزي",
      "Maqrizi",
      "Taqī al-dīn Abū al-ʿAbbās Aḥmad b. ʿAlī b. ʿAbd al-Qādir al-ʿUbaydī, al-Maqrīzī"
    ],
    "variations": [
      "al-Maqrizi",
      "Taqi al-din Abu al-ʿAbbas Ahmad b. ʿAli b. ʿAbd al-Qadir al-ʿUbaydi, al-Maqrizi",
      "Taqi din Abu ʿAbbas Ahmad b. ʿAli b. ʿAbd Qadir ʿUbaydi, Maqrizi"
    ]
  },
  {
    "names": [
      "ابن حجر العسقلاني",
      "Ibn Ḥaǧar al-ʿAsqalānī",
      "شهاب الدين أبو الفضل أحمد بن علي بن محمد بن حجر العسقلاني، الشافعي",
      "Ibn Hajar Casqalani",
      "Šihāb al-Dīn Abū al-Faḍl Aḥmad b. ʿAlī b. Muḥammad b. Ḥaǧar al-ʿAsqalānī, al-Šāfiʿī"
    ],
    "variations": [
      "Ibn Hagar al-ʿAsqalani",
      "Ibn Hagar ʿAsqalani",
      "Sihab al-Din Abu al-Fadl Ahmad b. ʿAli b. Muhammad b. Hagar al-ʿAsqalani, al-Safiʿi",
      "Sihab Din Abu Fadl Ahmad b. ʿAli b. Muhammad b. Hagar ʿAsqalani, Safiʿi"
    ]
  },
  {
    "names": [
      "ابن عربشاه",
      "Ibn ʿArabšāh",
      "أحمد بن محمد بن عبد الله",
      "Ibn Carabshah",
      "Aḥmad b. Muḥammad b. ʿAbd Allāh"
    ],
    "variations": [
      "Ibn ʿArabsah",
      "Ahmad b. Muhammad b. ʿAbd Allah"
    ]
  },
  {
    "names": [
      "بدر الدين العيني",
      "Badr al-Dīn al-ʿAynī",
      "بدر الدين أبو محمد مه̣مود بن أه̣مد بن موسى بن أحمد العيني، الحنفي",
      "Badr Din Cayni",
      "Badr al-Dīn Abū Muḥammad Maḥmūd b. Aḥmad b. Mūsá b. Aḥmad al-ʿAynī, al-Ḥanafī"
    ],
    "variations": [
      "Badr al-Din al-ʿAyni",
      "Badr Din ʿAyni",
      "Badr al-Din Abu Muhammad Maḥmud b. Aḥmad b. Musa b. Ahmad al-ʿAyni, al-Hanafi",
      "Badr Din Abu Muhammad Maḥmud b. Aḥmad b. Musa b. Ahmad ʿAyni, Hanafi"
    ]
  },
  {
    "names": [
      "شمس الدين النواجي",
      "Šams al-Dīn al-Nawāǧī",
      "شمس الدين أبو عبدالله محمد بن حسن بن علي بن عثمان النواجي القاهري الشافعي المصري",
      "Shams Din Nawaji",
      "Šams al-Dīn Abū ʿAbdallāh Muḥammad b. Ḥasan b. ʿAlī b. ʿUṯmān al-Nawāǧī al-Qāhirī al-Šāfiʿī al-Miṣrī"
    ],
    "variations": [
      "Sams al-Din al-Nawagi",
      "Sams Din Nawagi",
      "Sams al-Din Abu ʿAbdallah Muhammad b. Hasan b. ʿAli b. ʿUtman al-Nawagi al-Qahiri al-Safiʿi al-Misri",
      "Sams Din Abu ʿAbdallah Muhammad b. Hasan b. ʿAli b. ʿUtman Nawagi Qahiri Safiʿi Misri"
    ]
  },
  {
    "names": [
      "الرضي الغزي",
      "Radi Din Ghazzi",
      "رضي الدين أبو البركات محمد بن أحمد بن عبد الله الغزي العامري الشافعي (المتوفى: 864 ه)",
      "al-Ghazzī, Raḍī al-Dīn Abu l-Barakāt Muḥammad b. Aḥmad"
    ],
    "variations": [
      "al-Ghazzi, Radi al-Din Abu l-Barakat Muhammad b. Ahmad",
      "Ghazzi, Radi Din Abu l-Barakat Muhammad b. Ahmad"
    ]
  },
  {
    "names": [
      "al-Ẓāhirī, Ghars al-Dīn Khalīl b. Shāhīn",
      "Zahiri"
    ],
    "variations": [
      "al-Zahiri, Ghars al-Din Khalil b. Shahin",
      "Zahiri, Ghars Din Khalil b. Shahin"
    ]
  },
  {
    "names": [
      "ابن تغري بردي،الأتابكي",
      "Ibn Taġrī birdī,al-Atābakī",
      "جمال الدين، أبو المحاسن يوسف بن تغري بردي",
      "Ibn Taghribirdi",
      "Ǧamāl al-dīn, Abū al-maḥāsin Yūsuf b. Taġrī birdī"
    ],
    "variations": [
      "Ibn Tagri birdi,al-Atabaki",
      "Ibn Tagri birdi,Atabaki",
      "Gamal al-din, Abu al-mahasin Yusuf b. Tagri birdi",
      "Gamal din, Abu mahasin Yusuf b. Tagri birdi"
    ]
  },
  {
    "names": [
      "al-Ḥusaynī, Tāj al-Dīn ʿAbd al-Wahhāb b. Muḥammad",
      "Husayni"
    ],
    "variations": [
      "al-Ḥusayni, Taj al-Din ʿAbd al-Wahhab b. Muḥammad",
      "Ḥusayni, Taj Din ʿAbd Wahhab b. Muḥammad"
    ]
  },
  {
    "names": [
      "الجيزي",
      "al-Ǧīzī",
      "Jizi"
    ],
    "variations": [
      "al-Gizi",
      "Gizi"
    ]
  },
  {
    "names": [
      "ابن مفتاح",
      "Ibn Miftāḥ",
      "أبو الحسن عبد الله بن أبي القاسم بن مفتاح",
      "Ibn Miftah",
      "Abū al-Ḥasan ʿAbd Allāh b. Abī al-Qāsim b. Miftāḥ"
    ],
    "variations": [
      "Abu al-Hasan ʿAbd Allah b. Abi al-Qasim b. Miftah",
      "Abu Hasan ʿAbd Allah b. Abi Qasim b. Miftah"
    ]
  },
  {
    "names": [
      "ابن قطلوبغا",
      "Ibn Quṭlūbuġā",
      "زين الدين أبو الفداء قاسم بن قطلوبغا السودوني، الجمالي، الحنفي",
      "Ibn Qutlubugha",
      "Zayn al-dīn Abū al-Fidāʾ Qāsim b. Quṭlūbuġā al-Sūdūnī, al-Ǧamālī, al-Ḥanafī"
    ],
    "variations": [
      "Ibn Qutlubuga",
      "Zayn al-din Abu al-Fidaʾ Qasim b. Qutlubuga al-Suduni, al-Gamali, al-Hanafi",
      "Zayn din Abu Fidaʾ Qasim b. Qutlubuga Suduni, Gamali, Hanafi"
    ]
  },
  {
    "names": [
      "شمس الدين محمد بن أحمد بن علي الأسيوطي",
      "Ibn Ahmad Shams Din Asyuti",
      "Šams al-dīn Muḥammad b. Aḥmad b. ʿAlī al-Asyūṭī"
    ],
    "variations": [
      "Sams al-din Muhammad b. Ahmad b. ʿAli al-Asyuti",
      "Sams din Muhammad b. Ahmad b. ʿAli Asyuti"
    ]
  },
  {
    "names": [
      "al-Biqāʿī, Burhān al-Dīn Abu l-Ḥasan Ibrāhīm b. ʿUmar",
      "Burhan Din Biqaci",
      "إبراهيم بن عمر بن حسن الرباط بن علي بن أبي بكر البقاعي (المتوفى: 885هـ)",
      "البقاعي",
      "برهان الدين البقاعي",
      "أبو الحسن، برهان الدين إبراهيم بن عمر بن حسن الرباط بن علي بن أبي بكر البقاعي",
      "برهان الدين أبي الحسن إبراهيم بن عمر البقاعي",
      "برهان الدين إبراهيم بن عمر البقاعي"
    ],
    "variations": [
      "al-Biqaʿi, Burhan al-Din Abu l-Hasan Ibrahim b. ʿUmar",
      "Biqaʿi, Burhan Din Abu l-Hasan Ibrahim b. ʿUmar"
    ]
  },
  {
    "names": [
      "Ibn Fahd, Najm al-Dīn ʿUmar b. Muḥammad b. Muḥammad al-Makkī",
      "Ibn Fahd",
      "عمر بن فهد الهاشمي المكي",
      "عمر بن محمد بن فهد"
    ],
    "variations": [
      "Ibn Fahd, Najm al-Din ʿUmar b. Muḥammad b. Muḥammad al-Makki",
      "Ibn Fahd, Najm Din ʿUmar b. Muḥammad b. Muḥammad Makki"
    ]
  },
  {
    "names": [
      "العامري الحرضي",
      "al-ʿĀmirī al-Ḥaraḍī",
      "يحيى بن أبي بكر بن محمد العامري اليمني الحرضي",
      "Camiri Haradi",
      "Yaḥyá b. Abī Bakr b. Muḥammad al-ʿĀmirī al-Yamanī al-Ḥaraḍī"
    ],
    "variations": [
      "al-ʿAmiri al-Haradi",
      "ʿAmiri Haradi",
      "Yahya b. Abi Bakr b. Muhammad al-ʿAmiri al-Yamani al-Haradi",
      "Yahya b. Abi Bakr b. Muhammad ʿAmiri Yamani Haradi"
    ]
  },
  {
    "names": [
      "ابن عبد المنعم الحميري",
      "Ibn ʿAbd al-Munʿim al-Ḥimyarī",
      "أبو عبد الله محمد بن محمد بن عبد الله بن عبد المنعم بن عبد النور الحميري",
      "Ibn Cabd Muncim Himyari",
      "Abū ʿAbd Al-lãh Muḥammad b. Muḥammad b. ʿAbd Al-lãh b. ʿAbd al-Munʿim b. ʿAbd al-Nūr al-Ḥimyarī"
    ],
    "variations": [
      "Ibn ʿAbd al-Munʿim al-Himyari",
      "Ibn ʿAbd Munʿim Himyari",
      "Abu ʿAbd Al-lah Muhammad b. Muhammad b. ʿAbd Al-lah b. ʿAbd al-Munʿim b. ʿAbd al-Nur al-Himyari",
      "Abu ʿAbd lah Muhammad b. Muhammad b. ʿAbd lah b. ʿAbd Munʿim b. ʿAbd Nur Himyari"
    ]
  },
  {
    "names": [
      "البريهي",
      "al-Burayhī",
      "عبد الوهاب بن عبد الرحمان البريهي السكسكي اليمني",
      "Burayhi",
      "ʿAbd al-wahhāb b. ʿAbd al-Raḥmān al-Burayhī al-Saksakī al-Yamanī"
    ],
    "variations": [
      "al-Burayhi",
      "ʿAbd al-wahhab b. ʿAbd al-Rahman al-Burayhi al-Saksaki al-Yamani",
      "ʿAbd wahhab b. ʿAbd Rahman Burayhi Saksaki Yamani"
    ]
  },
  {
    "names": [
      "ابن ماجد",
      "Ibn Māǧid",
      "Ibn Majid"
    ],
    "variations": [
      "Ibn Magid"
    ]
  },
  {
    "names": [
      "ابن المبرد، ابن عبد الهادي",
      "Ibn al-Mabrid, Ibn ʿAbd al-Hādī",
      "Ibn Mabrid"
    ],
    "variations": [
      "Ibn al-Mabrid, Ibn ʿAbd al-Hadi",
      "Ibn Mabrid, Ibn ʿAbd Hadi"
    ]
  },
  {
    "names": [
      "محمد بن ظهيرة القرشي",
      "Muḥammad b. Ẓahīraŧ al-Qurašī",
      "أبو الخير محمد بن ظهيرة القرشي",
      "Muhammad Ibn Zahira Qurashi",
      "Abū al-Ḫayr Muḥammad b. Ẓahīraŧ al-Qurašī"
    ],
    "variations": [
      "Muhammad b. Zahirat al-Qurasi",
      "Muhammad b. Zahirat Qurasi",
      "Abu al-Hayr Muhammad b. Zahirat al-Qurasi",
      "Abu Hayr Muhammad b. Zahirat Qurasi"
    ]
  },
  {
    "names": [
      "جلال الدين السيوطي",
      "Ǧalāl al-Dīn al-Suyūṭī",
      "جلال الدين، أبو الفضل عبد الرحمان بن أبي بكر بن محمد جلال الدين الخضيري الأسيوطي",
      "Suyuti",
      "Ǧalāl al-dīn, Abū al-faḍl ʿAbd al-Raḥmān b. Abī Bakr b. Muḥammad Ǧalāl al-dīn al-Ḫuḍayrī al-Asyūṭī"
    ],
    "variations": [
      "Galal al-Din al-Suyuti",
      "Galal Din Suyuti",
      "Galal al-din, Abu al-fadl ʿAbd al-Rahman b. Abi Bakr b. Muhammad Galal al-din al-Hudayri al-Asyuti",
      "Galal din, Abu fadl ʿAbd Rahman b. Abi Bakr b. Muhammad Galal din Hudayri Asyuti"
    ]
  },
  {
    "names": [
      "ابن القلاعي",
      "Ibn al-Qilāʿī",
      "جبرائيل",
      "Jibrail Ibn Qilaci",
      "Ǧibrāʾīl"
    ],
    "variations": [
      "Ibn al-Qilaʿi",
      "Ibn Qilaʿi",
      "Gibraʾil"
    ]
  },
  {
    "names": [
      "القسطلاني",
      "al-Qasṭallānī",
      "شهاب الدين أبو العباس أحمد بن محمد بن أبي بكر بن عبد الملك الخطيب، الشافعي",
      "Ahmad Qastallani",
      "Šihāb al-dīn Abū al-ʿAbbās Aḥmad b. Muḥammad b. Abī Bakr b. ʿAbd al-Malik al-Ḫaṭīb, al-Šāfiʿī"
    ],
    "variations": [
      "al-Qastallani",
      "Qastallani",
      "Sihab al-din Abu al-ʿAbbas Ahmad b. Muhammad b. Abi Bakr b. ʿAbd al-Malik al-Hatib, al-Safiʿi",
      "Sihab din Abu ʿAbbas Ahmad b. Muhammad b. Abi Bakr b. ʿAbd Malik Hatib, Safiʿi"
    ]
  },
  {
    "names": [
      "عبد القادر بن محمد النعيمي الدمشقي",
      "ʿAbd al-Qādir b. Muḥammad al-Nuʿaymī al-Dimašqī",
      "Nucaymi"
    ],
    "variations": [
      "ʿAbd al-Qadir b. Muhammad al-Nuʿaymi al-Dimasqi",
      "ʿAbd Qadir b. Muhammad Nuʿaymi Dimasqi"
    ]
  },
  {
    "names": [
      "شيخ عمي سعيد",
      "Šayḫ ʿAmmī Saʿīd",
      "سعيد بن علي بن يحيى بن يدر بن سليمان بن عثمان الخيري الجربي",
      "Shaykh Cammi Sacid",
      "Saʿīd b. ʿAlī b. Yaḥyá b. Yaddar b. Sulaymān b. ʿUṯmān al-Ḫayrī al-Jirbī"
    ],
    "variations": [
      "Sayh ʿAmmi Saʿid",
      "Saʿid b. ʿAli b. Yahya b. Yaddar b. Sulayman b. ʿUtman al-Hayri al-Jirbi",
      "Saʿid b. ʿAli b. Yahya b. Yaddar b. Sulayman b. ʿUtman Hayri Jirbi"
    ]
  },
  {
    "names": [
      "الشماخي",
      "al-Šammāḫī",
      "أبو العباس أحمد بن أبي عثمان سعيد بن عبد الواحد الشماخي الإفراني",
      "Abu Cabbas Shammakhi",
      "Abū al-ʿAbbās Aḥmad b. Abī ʿUṯmān Saʿīd b. ʿAbd al-Wāḥid al-Šammāḫī al-ʾIfrānī"
    ],
    "variations": [
      "al-Sammahi",
      "Sammahi",
      "Abu al-ʿAbbas Ahmad b. Abi ʿUtman Saʿid b. ʿAbd al-Wahid al-Sammahi al-ʾIfrani",
      "Abu ʿAbbas Ahmad b. Abi ʿUtman Saʿid b. ʿAbd Wahid Sammahi ʾIfrani"
    ]
  },
  {
    "names": [
      "ابن كيال",
      "Ibn Kayyāl",
      "أبو البركات محمد بن أحمد",
      "Ibn Kayyal",
      "Abū al-Barakāt Muḥammad b. Aḥmad"
    ],
    "variations": [
      "Abu al-Barakat Muhammad b. Ahmad",
      "Abu Barakat Muhammad b. Ahmad"
    ]
  },
  {
    "names": [
      "البلوي",
      "al-Balawī",
      "أبو جعفر أحمد بن علي البلوي الوادي آشي",
      "Ibn Cali Balawi",
      "Abū Ǧaʿfar Aḥmad b. ʿAlī al-Balawī al-Wādī āšī"
    ],
    "variations": [
      "al-Balawi",
      "Balawi",
      "Abu Gaʿfar Ahmad b. ʿAli al-Balawi al-Wadi asi",
      "Abu Gaʿfar Ahmad b. ʿAli Balawi Wadi asi"
    ]
  },
  {
    "names": [
      "الداوودي",
      "al-Dāwūdī",
      "شمس الدين محمد بن علي بن أحمد الداوودي المالكي",
      "Shams Din Dawudi",
      "Šams al-dīn Muḥammad b. ʿAlī b. Aḥmad al-Dāwūdī al-Mālikī"
    ],
    "variations": [
      "al-Dawudi",
      "Dawudi",
      "Sams al-din Muhammad b. ʿAli b. Ahmad al-Dawudi al-Maliki",
      "Sams din Muhammad b. ʿAli b. Ahmad Dawudi Maliki"
    ]
  },
  {
    "names": [
      "سليمان المهري",
      "Sulaymān al-Mahrī",
      "سليمان بن أحمد بن سليمان المهري",
      "Sulayman Mahri",
      "Sulaymān b. Aḥmad b. Sulaymān al-Mahrī"
    ],
    "variations": [
      "Sulayman al-Mahri",
      "Sulayman b. Ahmad b. Sulayman al-Mahri",
      "Sulayman b. Ahmad b. Sulayman Mahri"
    ]
  },
  {
    "names": [
      "طاشكپري زاده",
      "Ṭāškuprī Zādah",
      "طاشكپري زاده أحمد بن مصطفى بن خليل",
      "Tashkuprizadah",
      "Ṭāškuprī Zādah Aḥmad b. Muṣṭafá b. Ḫalīl"
    ],
    "variations": [
      "Taskupri Zadah",
      "Taskupri Zadah Ahmad b. Mustafa b. Halil"
    ]
  },
  {
    "names": [
      "عبد الوهاب الشعراني",
      "ʿAbd al-Wahhāb al-Šaʿrānī",
      "أبو الوهاب عبد الوهاب بن أحمد بن علي الأنصاري، الشعراني",
      "Cabd Wahhab Shacrani",
      "Abū al-Wahhāb ʿAbd al-Wahhāb b. Aḥmad b. ʿAlī al-Anṣārī, al-Šaʿrānī"
    ],
    "variations": [
      "ʿAbd al-Wahhab al-Saʿrani",
      "ʿAbd Wahhab Saʿrani",
      "Abu al-Wahhab ʿAbd al-Wahhab b. Ahmad b. ʿAli al-Ansari, al-Saʿrani",
      "Abu Wahhab ʿAbd Wahhab b. Ahmad b. ʿAli Ansari, Saʿrani"
    ]
  },
  {
    "names": [
      "أبو البركات محمد بن محمد بن محمد الغزي (المتوفى : 984هـ)",
      "Badr Din Ghazzi",
      "أبو البركات الغزي",
      "محمد بن محمد بن محمد الغزي العامري الدمشقي، أبو البركات، بدر الدين ابن رضي الدين (المتوفى: 984هـ)",
      "بدر الدين، أبو البركات محمد بن محمد بن محمد الغزي (المتوفى: 984هـ)",
      "محمد بن محمد بن محمد الغزي العامري الدمشقي، أبو البركات، بدر الدين ابن رضي الدين",
      "الغزي، أبو البركات",
      "بدر الدين محمّد العامري الغزّي الدمشقي",
      "الغزي",
      "أبو البركات بدر الدين محمد بن محمد الغزي"
    ],
    "variations": [
      "بدر الدين محمد العامري الغزي الدمشقي"
    ]
  },
  {
    "names": [
      "محمّد بن أحمد بن محمّد النهرواني",
      "Qutb Din Nahrawani",
      "محمد بن أحمد النهرواني",
      "قطب الدين محمد بن علاء الدين علي بن أحمد النهرواني المكي الحنفي (ت: 988 ه)",
      "قطب الدين النهرواني"
    ],
    "variations": [
      "محمد بن أحمد بن محمد النهرواني"
    ]
  },
  {
    "names": [
      "علي بن بالي منق",
      "ʿAlī b. Bālī Manq",
      "منق علي بن بالي بن محمد القسطنطيني، الآيديني",
      "Cali Ibn Bali Manq",
      "Manq ʿAlī b. Bālī b. Muḥammad al-Qusṭanṭīnī, al-Āydīnī"
    ],
    "variations": [
      "ʿAli b. Bali Manq",
      "Manq ʿAli b. Bali b. Muhammad al-Qustantini, al-Aydini",
      "Manq ʿAli b. Bali b. Muhammad Qustantini, Aydini"
    ]
  },
  {
    "names": [
      "الشهيد نور الله التستري",
      "Nur Allah Tustari",
      "السيّد نور الله الحسيني المرعشي التستري"
    ],
    "variations": [
      "السيد نور الله الحسيني المرعشي التستري"
    ]
  },
  {
    "names": [
      "محمّد أمين الإسترابادي",
      "Muhammad Amin Astarabadi",
      "محمد أمين الإسترآبادي ، السيد نور الدين العاملي"
    ],
    "variations": [
      "محمد أمين الإسترابادي"
    ]
  },
  {
    "names": [
      "ابن القاضى، المكناسى",
      "Ibn Qadi Maknasi",
      "أبو العبّاس أحمد بن محمّد المكناسى الشّهير بابن القاضى (960 - 1025 هـ‍)"
    ],
    "variations": [
      "أبو العباس أحمد بن محمد المكناسى الشهير بابن القاضى (960 - 1025 هـ‍)"
    ]
  },
  {
    "names": [
      "داوود بن الهادي",
      "Dāwūd b. al-Hādī",
      "داوود بن الهادي بن أحمد بن المهدي بن عز الدين بن الحسن المؤيدي",
      "Dawud Ibn Hadi",
      "Dāwūd b. al-Hādī b. Aḥmad b. al-Mahdī b. ʿIzz al-Dīn b. al-Ḥasan al-Muʾayyadī"
    ],
    "variations": [
      "Dawud b. al-Hadi",
      "Dawud b. Hadi",
      "Dawud b. al-Hadi b. Ahmad b. al-Mahdi b. ʿIzz al-Din b. al-Hasan al-Muʾayyadi",
      "Dawud b. Hadi b. Ahmad b. Mahdi b. ʿIzz Din b. Hasan Muʾayyadi"
    ]
  },
  {
    "names": [
      "المققري",
      "al-Maqqarī",
      "شهاب الدين أحمد بن محمد المققري التلمساني",
      "Maqqari",
      "Šahāb al-Dīn Aḥmad b. Muḥammad al-Maqqarī al-Tilimsānī"
    ],
    "variations": [
      "al-Maqqari",
      "Sahab al-Din Ahmad b. Muhammad al-Maqqari al-Tilimsani",
      "Sahab Din Ahmad b. Muhammad Maqqari Tilimsani"
    ]
  },
  {
    "names": [
      "الداماد",
      "al-Dāmād",
      "مير محمد باقر بن شمس الدين محمد الحسيني الأسترابادي",
      "Mir Damad",
      "Mīr Muḥammad Bāqir b. Šams al-dīn Muḥammad al-Ḥusaynī al-Astarābādī"
    ],
    "variations": [
      "al-Damad",
      "Damad",
      "Mir Muhammad Baqir b. Sams al-din Muhammad al-Husayni al-Astarabadi",
      "Mir Muhammad Baqir b. Sams din Muhammad Husayni Astarabadi"
    ]
  },
  {
    "names": [
      "شمس الدين الشرفي",
      "Šams al-Dīn al-Šarafī",
      "شمس الدين أحمد بن محمد بن صلاح الشرفي",
      "Ahmad Sharafi",
      "Šams al-Dīn Aḥmad b. Muḥammad b. Ṣalāḥ al-Šarafī"
    ],
    "variations": [
      "Sams al-Din al-Sarafi",
      "Sams Din Sarafi",
      "Sams al-Din Ahmad b. Muhammad b. Salah al-Sarafi",
      "Sams Din Ahmad b. Muhammad b. Salah Sarafi"
    ]
  },
  {
    "names": [
      "ابن قيصر",
      "Ibn Qayṣar",
      "عبد الله بن خلفان بن قيصر بن سليمان الصحاري",
      "Ibn Qaysar",
      "ʿAbd Allāh b. Ḫalfān b. Qayṣar b. Sulaymān al-Ṣuḥārī"
    ],
    "variations": [
      "ʿAbd Allah b. Halfan b. Qaysar b. Sulayman al-Suhari",
      "ʿAbd Allah b. Halfan b. Qaysar b. Sulayman Suhari"
    ]
  },
  {
    "names": [
      "نجم الدين محمد الغزي",
      "Naǧm al-Dīn Muḥammad al-Ġazzī",
      "نجم الدين محمد بن بدر الدين محمد بن رضي الدين محمد بن شهاب الدين أحمد الغزي القريشي الدمشقي",
      "Najm Din Ghazzi",
      "Naǧm al-Dīn Muḥammad b. Badr al-Dīn Muḥammad b. Raḍī al-Dīn Muḥammad b. Šihāb al-Dīn Aḥmad al-Ġazzī al-Qurayšī al-Dimašqī"
    ],
    "variations": [
      "Nagm al-Din Muhammad al-Gazzi",
      "Nagm Din Muhammad Gazzi",
      "Nagm al-Din Muhammad b. Badr al-Din Muhammad b. Radi al-Din Muhammad b. Sihab al-Din Ahmad al-Gazzi al-Quraysi al-Dimasqi",
      "Nagm Din Muhammad b. Badr Din Muhammad b. Radi Din Muhammad b. Sihab Din Ahmad Gazzi Quraysi Dimasqi"
    ]
  },
  {
    "names": [
      "حجي خليف، كاتب چeلeبي",
      "Ḥaǧǧī Ḫalīfa, Kātib Čelebī",
      "حجي خليف، كاتب چeلeبي مصطفى بن عبد الله",
      "Hajji Khalifa",
      "Ḥaǧǧī Ḫalīfa, Kātib Čelebī Muṣṭafá b. ʿAbd Allāh"
    ],
    "variations": [
      "Haggi Halifa, Katib Celebi",
      "Haggi Halifa, Katib Celebi Mustafa b. ʿAbd Allah"
    ]
  },
  {
    "names": [
      "محمد كبريت الحسني",
      "Muhammad Kibrit",
      "محمد بن عبد الله بن محمد، من أحفاد شرف الدين بن يحيى الحمزي الحسيني المولوي المعروف ب كبريت",
      "محمد كبريت",
      "محمّد كبريت الحسيني المدني",
      "محمد بن عبد الله بن محمد، من أحفاد شرف الدين بن يحيى الحمزي الحسيني المولوي المعروف بـ كبريت (المتوفى: 1070هـ)",
      "الشيخ علي بن الشيخ أحمد بن الشيخ نور الدين بن محمد بن الشيخ إبراهيم الشهير بالعزيزي",
      "العزيزي"
    ],
    "variations": [
      "محمد كبريت الحسيني المدني"
    ]
  },
  {
    "names": [
      "خميس شقصي",
      "Ḫamīs Šiqṣī",
      "خميس بن سعيد بن علي الشقصي الرستاقي",
      "Khamis Shiqsi",
      "Ḫamīs b. Saʿīd b. ʿAlī al-Šiqṣī al-Rustāqī"
    ],
    "variations": [
      "Hamis Siqsi",
      "Hamis b. Saʿid b. ʿAli al-Siqsi al-Rustaqi",
      "Hamis b. Saʿid b. ʿAli Siqsi Rustaqi"
    ]
  },
  {
    "names": [
      "محمّد بن المرتضى [ الفيض الكاشاني ]",
      "Muhammad Muhsin Fayd Kashani",
      "الفيض الكاشاني",
      "الفيض القاساني"
    ],
    "variations": [
      "محمد بن المرتضى [ الفيض الكاشاني ]"
    ]
  },
  {
    "names": [
      "Muḥammad ibn Maḥfūẓ al-Sanhūrī",
      "Ibn Mahfuz Sanhuri",
      "محمّد بن محفوظ السنهوريّ"
    ],
    "variations": [
      "Muhammad ibn Mahfuz al-Sanhuri",
      "Muhammad ibn Mahfuz Sanhuri",
      "محمد بن محفوظ السنهوري"
    ]
  },
  {
    "names": [
      "الأدنهوي",
      "al-Adnahwī",
      "أحمد بن محمد",
      "Ibn Muhammad Adnahwi",
      "Aḥamd b. Muḥammad"
    ],
    "variations": [
      "al-Adnahwi",
      "Adnahwi",
      "Ahamd b. Muhammad"
    ]
  },
  {
    "names": [
      "الازكاوي",
      "al-Izkāwī",
      "Izkawi"
    ],
    "variations": [
      "al-Izkawi"
    ]
  },
  {
    "names": [
      "القاضي سعيد القمي",
      "al-Qāḍī Saʿīd al-Qummī",
      "محمد سعيد بن محمد مفيد القمي",
      "Qadi Sacid Qummi",
      "Muḥammad Saʿīd b. Muḥammad Mufīd al-Qummī"
    ],
    "variations": [
      "al-Qadi Saʿid al-Qummi",
      "Qadi Saʿid Qummi",
      "Muhammad Saʿid b. Muhammad Mufid al-Qummi",
      "Muhammad Saʿid b. Muhammad Mufid Qummi"
    ]
  },
  {
    "names": [
      "العلامة المجلسي",
      "al-ʿAllāmaŧ al-Maǧlisī",
      "أبو عبيد الله محمد باقر بن محمد تقي بن مقصود علي المجلسي الاصفهاني",
      "Majlisi",
      "Abū ʿUbayd Allāh Muḥammad Bāqir b. Muḥammad Taqī b. Maqṣūd ʿAlī al-Maǧlisī al-Iṣfahānī"
    ],
    "variations": [
      "al-ʿAllamat al-Maglisi",
      "ʿAllamat Maglisi",
      "Abu ʿUbayd Allah Muhammad Baqir b. Muhammad Taqi b. Maqsud ʿAli al-Maglisi al-Isfahani",
      "Abu ʿUbayd Allah Muhammad Baqir b. Muhammad Taqi b. Maqsud ʿAli Maglisi Isfahani"
    ]
  },
  {
    "names": [
      "خير الدين ابن اليس",
      "Ḫayr al-Dīn Ibn Ilyas",
      "خير الدين بن تاج الدين الياس",
      "Khayr Din Ibn Ilyas",
      "Ḫayr al-Dīn b. Tāj al-Dīn Ilyās"
    ],
    "variations": [
      "Hayr al-Din Ibn Ilyas",
      "Hayr Din Ibn Ilyas",
      "Hayr al-Din b. Taj al-Din Ilyas",
      "Hayr Din b. Taj Din Ilyas"
    ]
  },
  {
    "names": [
      "محمّد نعيم بن محمّد تقي [ الملا نعيما العرفي الطالقاني ]",
      "Mulla Nacima Taliqani"
    ],
    "variations": [
      "محمد نعيم بن محمد تقي [ الملا نعيما العرفي الطالقاني ]"
    ]
  },
  {
    "names": [
      "يوسف المحلي",
      "Yūsuf al-Maḥallī",
      "يوسف بن يوسف المحلي، الشافعي، الأشعري، الكلارجي",
      "Yusuf Mahalli",
      "Yūsuf b. Yūsuf al-Maḥallī, al-Šāfiʿī, al-Ašʿarī, al-Kalārjī"
    ],
    "variations": [
      "Yusuf al-Mahalli",
      "Yusuf b. Yusuf al-Mahalli, al-Safiʿi, al-Asʿari, al-Kalarji",
      "Yusuf b. Yusuf Mahalli, Safiʿi, Asʿari, Kalarji"
    ]
  },
  {
    "names": [
      "محمد حياة السندي",
      "Muḥammad Ḥayāŧ al-Sindī",
      "Muhammad Hayat Sindi"
    ],
    "variations": [
      "Muhammad Hayat al-Sindi"
    ]
  },
  {
    "names": [
      "الحسين بن محمّد الورثيلاني",
      "Husayn Warthilani"
    ],
    "variations": [
      "الحسين بن محمد الورثيلاني"
    ]
  },
  {
    "names": [
      "Ḥannā Diyāb",
      "Hanna Diyab",
      "حنّا دياب"
    ],
    "variations": [
      "حنا دياب"
    ]
  },
  {
    "names": [
      "المرادي",
      "al-Murādī",
      "أبو المودة محمد خليل بن ألي بن محمد بن محمد مراد بن ألي المرادي الحسيني الحنفي",
      "Muradi",
      "Abū al-Muwaddaŧ Muḥammad Ḫalīl b. Alī b. Muḥammad b. Muḥammad Murād b. Alī al-Murādī al-Ḥusaynī al-Ḥanafī"
    ],
    "variations": [
      "al-Muradi",
      "Abu al-Muwaddat Muhammad Halil b. Ali b. Muhammad b. Muhammad Murad b. Ali al-Muradi al-Husayni al-Hanafi",
      "Abu Muwaddat Muhammad Halil b. Ali b. Muhammad b. Muhammad Murad b. Ali Muradi Husayni Hanafi"
    ]
  },
  {
    "names": [
      "محمّد جعفر الأسترآبادي",
      "Jacfar Sharicat Madar Astarabadi"
    ],
    "variations": [
      "محمد جعفر الأسترآبادي"
    ]
  },
  {
    "names": [
      "ابن أبي نبهان الخروصي",
      "Ibn Abī Nabhān al-Ḫarūṣī",
      "أبو محمد ناصر بن أبي نبهان جاعد بن خميس بن مبارك الخروصي",
      "Nasir Ibn Abi Nabhan Kharusi",
      "Abū Muḥammad Nāṣir b. Abī Nabhān Jāʿid b. Ḫamīs b. Mubārak al-Ḫarūṣī"
    ],
    "variations": [
      "Ibn Abi Nabhan al-Harusi",
      "Ibn Abi Nabhan Harusi",
      "Abu Muhammad Nasir b. Abi Nabhan Jaʿid b. Hamis b. Mubarak al-Harusi",
      "Abu Muhammad Nasir b. Abi Nabhan Jaʿid b. Hamis b. Mubarak Harusi"
    ]
  },
  {
    "names": [
      "شهاب الدين محمود بن عبد الله الحسيني الألوسي (المتوفى: 1270هـ)",
      "Shihab Din Alusi",
      "محمود شكري الألوسي",
      "أبو المعالي محمود شكري بن عبد الله بن محمد بن أبي الثناء الألوسي (المتوفى : 1342هـ)",
      "الألوسي، محمود شكري",
      "محمود الألوسي أبو الفضل",
      "أبو المعالي محمود شكري بن عبد الله بن محمد بن أبي الثناء الألوسي",
      "أبي الفضل شهاب الدين السيّد محمود الألوسي البغدادي",
      "الالوسي",
      "العلامة أبي الفضل شهاب الدين السيد محمود الألوسي البغدادي",
      "الألوسي",
      "الآلوسي"
    ],
    "variations": [
      "أبي الفضل شهاب الدين السيد محمود الألوسي البغدادي"
    ]
  },
  {
    "names": [
      "فرنسيس فتح الله مَرَّاش",
      "Fransis Marrash"
    ],
    "variations": [
      "فرنسيس فتح الله مراش"
    ]
  },
  {
    "names": [
      "مؤلف مجهول",
      "Muʾallif maǧhūl",
      "Anonymous"
    ],
    "variations": [
      "Muʾallif maghul"
    ]
  },
  {
    "names": [
      "منصور الخروصي",
      "Manṣūr al-Ḫarūṣī",
      "منصور بن محمد بن ناصر بن خميس بن مبارك الخروصي",
      "Mansur Kharusi",
      "Manṣūr b. Muḥammad b. Nāṣir b. Ḫamīs b. Mubārak al-Ḫarūṣī"
    ],
    "variations": [
      "Mansur al-Harusi",
      "Mansur Harusi",
      "Mansur b. Muhammad b. Nasir b. Hamis b. Mubarak al-Harusi",
      "Mansur b. Muhammad b. Nasir b. Hamis b. Mubarak Harusi"
    ]
  },
  {
    "names": [
      "الشيخ محسن أبو الحبّ",
      "Muhsin Abu Hubb"
    ],
    "variations": [
      "الشيخ محسن أبو الحب"
    ]
  },
  {
    "names": [
      "صديق بن حسن القنوجي",
      "Qannawji",
      "القنوجي",
      "أبو الطيب محمد صديق خان بن حسن بن علي ابن لطف الله الحسيني البخاري القنوجي (المتوفى: 1307هـ)",
      "أبو الطيب السيد صديق حسن القنوجي",
      "السيد القنوجي",
      "صديق حسن خان",
      "السيد محمد صديق حسن خان الفتوحي",
      "الملك محمد صديق حسن خان",
      "محمد صديق حسن خان القنوجي",
      "أبو الطيب محمد صديق خان بن حسن بن علي ابن لطف الله الحسيني البخاري القنوجي (المتوفى: 1307ه)",
      "أبو الطيب محمد صديق خان بن حسن بن علي ابن لطف الله الحسيني البخاري القِنَّوجي",
      "أبو الطيب محمد صديق خان بن حسن بن علي ابن لطف الله الحسيني البخاري القِنَّوجي (المتوفى: 1307هـ)",
      "صديق بن حسن بن علي القنوجي"
    ],
    "variations": [
      "أبو الطيب محمد صديق خان بن حسن بن علي ابن لطف الله الحسيني البخاري القنوجي"
    ]
  },
  {
    "names": [
      "كرنليوس فان ديك",
      "Kurniliyūs Fān Dīk",
      "كرنليوس فان آلن فان ديك",
      "Cornelius Van Dyck",
      "Kurniliyūs Fān Ālin Fān Dīk",
      "Cornelius Van Allen Van Dyck"
    ],
    "variations": [
      "Kurniliyus Fan Dik",
      "Kurniliyus Fan Alin Fan Dik"
    ]
  },
  {
    "names": [
      "طبرسي/طبرسي",
      "Ṭabrisī/Ṭabarsī",
      "ميرزا حسين بن محمد تقي نوري طبرسي/طبرسي",
      "Nuri Tabarsi",
      "Mīrzā Ḥusayn b. Muḥammad Taqī Nūrī Ṭabrisī/Ṭabarsī"
    ],
    "variations": [
      "Tabrisi/Tabarsi",
      "Mirza Husayn b. Muhammad Taqi Nuri Tabrisi/Tabarsi"
    ]
  },
  {
    "names": [
      "جُرجي زيدان",
      "Jurji Zaydan"
    ],
    "variations": [
      "جرجي زيدان"
    ]
  },
  {
    "names": [
      "علي الخاقاني",
      "ʿAlī al-Ḫāqānī",
      "أبو الحسن علي بن الشيخ حسين بن الشيخ عباس بن الحاج محمد علي بن الشيخ سالم الخاقاني",
      "Cali Khaqani",
      "Abū al-Ḥasan ʿAlī b. al-šayḫ Ḥusayn b. al-šayḫ ʿAbbās b. al-Ḥāǧǧ Muḥammad ʿAlī b. al-šayḫ Sālim al-Ḫāqānī"
    ],
    "variations": [
      "ʿAli al-Haqani",
      "ʿAli Haqani",
      "Abu al-Hasan ʿAli b. al-sayh Husayn b. al-sayh ʿAbbas b. al-Hagg Muhammad ʿAli b. al-sayh Salim al-Haqani",
      "Abu Hasan ʿAli b. sayh Husayn b. sayh ʿAbbas b. Hagg Muhammad ʿAli b. sayh Salim Haqani"
    ]
  },
  {
    "names": [
      "اسماعيل باشا بغدادي",
      "Ismāʿīl Bāšā Baġdādī",
      "اسماعيل بن محمد أمين بن مير سليم الباباني البغدادي",
      "Ismacil Basha Baghdadi",
      "Ismāʿīl b. Muḥammad Amīn b. Mīr Salīm al-Bābānī al-Baġdādī"
    ],
    "variations": [
      "Ismaʿil Basa Bagdadi",
      "Ismaʿil b. Muhammad Amin b. Mir Salim al-Babani al-Bagdadi",
      "Ismaʿil b. Muhammad Amin b. Mir Salim Babani Bagdadi"
    ]
  },
  {
    "names": [
      "ابن جعفر الكتاني",
      "Ibn Ǧaʿfar al-Kattānī",
      "محمد بن جعفر الكتاني",
      "Ibn Jacfar Kattani",
      "Muḥammad b. Ǧaʿfar al-Kattānī"
    ],
    "variations": [
      "Ibn Gaʿfar al-Kattani",
      "Ibn Gaʿfar Kattani",
      "Muhammad b. Gaʿfar al-Kattani",
      "Muhammad b. Gaʿfar Kattani"
    ]
  },
  {
    "names": [
      "يعقوب صرُّوف",
      "Yacqub Sarruf"
    ],
    "variations": [
      "يعقوب صروف"
    ]
  },
  {
    "names": [
      "محمد المويلحي",
      "Muḥammad al-Muwayliḥī",
      "محمد بن ابراهيم بن عبد الخالق المويلحي",
      "Muhammad Muwaylihi",
      "Muḥammad b. Ibrāhīm b. ʿAbd al-Ḫāliq al-Muwayliḥī"
    ],
    "variations": [
      "Muhammad al-Muwaylihi",
      "Muhammad b. Ibrahim b. ʿAbd al-Haliq al-Muwaylihi",
      "Muhammad b. Ibrahim b. ʿAbd Haliq Muwaylihi"
    ]
  },
  {
    "names": [
      "أحمد بن أحمد بن محمّد المطاع",
      "Ahmad Mutac"
    ],
    "variations": [
      "أحمد بن أحمد بن محمد المطاع"
    ]
  },
  {
    "names": [
      "أنطون الجميِّل",
      "Antun Jumayyil"
    ],
    "variations": [
      "أنطون الجميل"
    ]
  },
  {
    "names": [
      "نجيب نصَّار",
      "Najib Nassar"
    ],
    "variations": [
      "نجيب نصار"
    ]
  },
  {
    "names": [
      "محمد راغب بن محمود بن هاشم الطبّاخ الحلبي",
      "Muhammad Raghib Tabbakh"
    ],
    "variations": [
      "محمد راغب بن محمود بن هاشم الطباخ الحلبي"
    ]
  },
  {
    "names": [
      "محمد كرد علي",
      "Kurd Cali",
      "محمد بن عبد الرزاق بن محمَّد، كُرْد عَلي (المتوفى: 1372هـ)",
      "محمد بن عبد الرزاق بن محمَّد، كُرْد عَلي",
      "محمّد كرد علي",
      "محمد بن عبد الرزاق بن محمد، كرد علي (المتوفى: 1372هـ)",
      "محمد علي كرد"
    ],
    "variations": [
      "محمد بن عبد الرزاق بن محمد، كرد علي"
    ]
  },
  {
    "names": [
      "الأمير محمد علي",
      "Muhammad Cali Tawfiq",
      "الأَمير محمَّد عَلي بن محمد توفيق بن إسماعيل بن إبراهيم بن محمد علي (المتوفى: 1374هـ)"
    ],
    "variations": [
      "الأمير محمد علي بن محمد توفيق بن إسماعيل بن إبراهيم بن محمد علي (المتوفى: 1374هـ)"
    ]
  },
  {
    "names": [
      "بول جيرالدي",
      "Niqula Fayad",
      "نِقولا فياض"
    ],
    "variations": [
      "نقولا فياض"
    ]
  },
  {
    "names": [
      "محمّد بن أحمد الحجري اليماني",
      "Muhammad Ahmad Hajari"
    ],
    "variations": [
      "محمد بن أحمد الحجري اليماني"
    ]
  },
  {
    "names": [
      "الشيخ محمّد حسين المظفّر",
      "Muhammad Husayn Muzaffar"
    ],
    "variations": [
      "الشيخ محمد حسين المظفر"
    ]
  },
  {
    "names": [
      "سيد قطب",
      "Sayyid Quṭb",
      "سيد قطب ابراهيم حسين الشاذلي",
      "Sayyid Qutb",
      "Sayyid Quṭb Ibrāhīm Ḥusayn al-Šāḏilī"
    ],
    "variations": [
      "Sayyid Qutb Ibrahim Husayn al-Sadili",
      "Sayyid Qutb Ibrahim Husayn Sadili"
    ]
  },
  {
    "names": [
      "آقا بزرگ تهراني",
      "Āqā Buzurg Tihrānī",
      "محمد محسن بن علي بن محمد رضى التهراني النجفي",
      "Agha Buzurg Tihrani",
      "Muḥammad Muḥsin b. ʿAlī b. Muḥammad Riḍá al-Tihrānī al-Naǧafī"
    ],
    "variations": [
      "Aqa Buzurg Tihrani",
      "Muhammad Muhsin b. ʿAli b. Muhammad Rida al-Tihrani al-Nagafi",
      "Muhammad Muhsin b. ʿAli b. Muhammad Rida Tihrani Nagafi"
    ]
  },
  {
    "names": [
      "غريغوريوس بولس بهنام",
      "Ġrīġūriyūs Būlus Bihnām",
      "Gregorius Paulus Behnam"
    ],
    "variations": [
      "Griguriyus Bulus Bihnam"
    ]
  },
  {
    "names": [
      "السيد عبد الرزاق الموسوي المقرّم",
      "Cabd Razzaq Muqarrim"
    ],
    "variations": [
      "السيد عبد الرزاق الموسوي المقرم"
    ]
  },
  {
    "names": [
      "عزرا حداد",
      "ʿAzrā Ḥaddād",
      "Cazra Haddad"
    ],
    "variations": [
      "ʿAzra Haddad"
    ]
  },
  {
    "names": [
      "ابن عاشور",
      "Muhammad Tahir Ibn Cashur Tunisi",
      "محمد الطاهر ابن عاشور",
      "محمد الطاهر بن عاشور",
      "الشيخ محمّد الطاهر ابن عاشور",
      "محمد الطاهر بن محمد بن محمد الطاهر بن عاشور التونسي (المتوفى: 1393هـ)"
    ],
    "variations": [
      "الشيخ محمد الطاهر ابن عاشور"
    ]
  },
  {
    "names": [
      "الزركلي",
      "al-Ziriklī",
      "خير الدين بن محمود بن محمد بن علي الدمشقي",
      "Khayr Din Zirikli",
      "Ḫayr al-dīn b. Maḥmūd b. Muḥammad b. ʿAlī al-Dimašqī"
    ],
    "variations": [
      "al-Zirikli",
      "Zirikli",
      "Hayr al-din b. Mahmud b. Muhammad b. ʿAli al-Dimasqi",
      "Hayr din b. Mahmud b. Muhammad b. ʿAli Dimasqi"
    ]
  },
  {
    "names": [
      "سيد طباطبائي، علامة طباطبائي",
      "Sayyid Ṭabāṭabāʾī, ʿAllāmaŧ Ṭabāṭabāʾī",
      "محمد حسين طباطبائي",
      "Sayyid Tabatabai",
      "Muḥammad Ḥusayn Ṭabāṭabāʾī"
    ],
    "variations": [
      "Sayyid Tabatabaʾi, ʿAllamat Tabatabaʾi",
      "Muhammad Husayn Tabatabaʾi"
    ]
  },
  {
    "names": [
      "مصطفى بن حسني السباعي",
      "Ahmad Sibaci",
      "الدكتور مصطفى السّباعي",
      "الواحدي :: مصطفى السباعي",
      "أحمد السباعي"
    ],
    "variations": [
      "الدكتور مصطفى السباعي"
    ]
  },
  {
    "names": [
      "الشيخ محمّد علي المدرّس الأفغاني",
      "Muhammad Cali Mudarris Afghani"
    ],
    "variations": [
      "الشيخ محمد علي المدرس الأفغاني"
    ]
  },
  {
    "names": [
      "جواد شبّر",
      "Jawad Shubbar"
    ],
    "variations": [
      "جواد شبر"
    ]
  },
  {
    "names": [
      "يحيى الخشاب",
      "Yaḥyá al-Ḫaššāb",
      "يحيى محمد عمر الخشاب",
      "Yahya Khashshab",
      "Yaḥyá Muḥammad ʿUmar al-Ḫaššāb"
    ],
    "variations": [
      "Yahya al-Hassab",
      "Yahya Hassab",
      "Yahya Muhammad ʿUmar al-Hassab",
      "Yahya Muhammad ʿUmar Hassab"
    ]
  },
  {
    "names": [
      "عبد الغفار مكاوي",
      "Cabd Ghaffar Makkawi",
      "عبد الغفار مكاوي :: حسن طلب #تقديم#",
      "عبد الغفار مكاوي #جمع وترجمة#",
      "فريتس شتيبات",
      "برتولد برشت",
      "ليبنتز",
      "عبد الغفار مكاوي #دراسة#",
      "عبد الغفار مكاوي #دراسة وترجمة#",
      "لاو تسي :: عبد الغفار مكاوي #تقديم وترجمة#",
      "كارل ياسبرز",
      "إيمانويل كانْت",
      "يوهان فولفجانج جوته",
      "ثيوفراسط"
    ],
    "variations": [
      "إيمانويل كانت"
    ]
  },
  {
    "names": [
      "فريدل فاينِرت",
      "Ahmad Shakl",
      "سايمون كريتشلي"
    ],
    "variations": [
      "فريدل فاينرت"
    ]
  },
  {
    "names": [
      "يوهان ديفيد فيس",
      "Fayiqa Jirjis Hanna",
      "سوزان سكوت :: كريستوفر دنكان",
      "ماري شيلي",
      "روبرت لويس ستيفنسون",
      "جون دَن",
      "لين هانت",
      "بيل هاندلي"
    ],
    "variations": [
      "جون دن"
    ]
  },
  {
    "names": [
      "يان أبوتيكر :: ليفيا سايمون ساركادي",
      "Hiba Cabd Caziz Ghanim",
      "يان فيسترهوف",
      "إدوارد فيليبس أوبنهايم",
      "مايكل جيه نيوفِلد"
    ],
    "variations": [
      "مايكل جيه نيوفلد"
    ]
  },
  {
    "names": [
      "لطف الله الصّافي",
      "Lutf Allah Safi Gulpaygani"
    ],
    "variations": [
      "لطف الله الصافي"
    ]
  },
  {
    "names": [
      "محمود عبد الكريم علي",
      "Maḥmūd ʿAbd al-Karīm ʿAlī",
      "Mahmud Cabd Karim Cali"
    ],
    "variations": [
      "Mahmud ʿAbd al-Karim ʿAli",
      "Mahmud ʿAbd Karim ʿAli"
    ]
  },
  {
    "names": [
      "مرزوق الزهراني",
      "Marzūq al-Zahrānī",
      "مرزوق بن هياس آل مرزوق الزهراني",
      "Marzuq Zahrani",
      "Marzūq b. Hiyās Āl Marzūq al-Zahrānī"
    ],
    "variations": [
      "Marzuq al-Zahrani",
      "Marzuq b. Hiyas Al Marzuq al-Zahrani",
      "Marzuq b. Hiyas Al Marzuq Zahrani"
    ]
  },
  {
    "names": [
      "محمد السِّباعي",
      "Muhammad Sibaci"
    ],
    "variations": [
      "محمد السباعي"
    ]
  },
  {
    "names": [
      "مؤتمر الامام رضى",
      "Muʾtamar al-Imām Riḍá",
      "Mutamar Imam Rida"
    ],
    "variations": [
      "Muʾtamar al-Imam Rida",
      "Muʾtamar Imam Rida"
    ]
  },
  {
    "names": [
      "مُزنة رياض كمال",
      "Muzna Riyad Kamal"
    ],
    "variations": [
      "مزنة رياض كمال"
    ]
  },
  {
    "names": [
      "رياض حمَّادي‎",
      "Riyad Hammadi",
      "رياض حمَّادي‎"
    ],
    "variations": [
      "رياض حمادي‎",
      "رياض حمادي‎"
    ]
  },
  {
    "names": [
      "فيبر بيرين",
      "Safiya Mukhtar",
      "داميان كيون",
      "تيريل كارفر",
      "سو هاميلتون",
      "روبِن لاندا",
      "نايل جرين",
      "أنتوني دي سميث"
    ],
    "variations": [
      "روبن لاندا"
    ]
  }
]